[
  {
    "id": "27c5ae30-bdf0-11e8-8676-d947917b5c6e",
    "created_at": "Wed Oct 24 15:49:12 UTC 2018",
    "title": "Experienced DevOps Engineer",
    "location": "United States",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><a href=\"https://citrusbyte.com\">Citrusbyte</a> is a software consultancy that believes in using simple tools to solve problems. We build custom systems for both startups and enterprises - You can see our portfolio for more information about our clients.</p>\n\n<p>We have offices in Los Angeles and New York, but we work remotely with people from all around the world.</p>\n\n<p>Our engineers have experience in a consultative environment, excellent communication skills and a desire to work with talented teams building innovative products. We work closely with our clients, sharing our experience and processes to help them define and create their products.</p>\n\n<p>We are looking for DevOps Engineers with experience using Infrastructure as Code and Configuration Management tools, deploying applications to cloud services such as AWS and Azure. Experience developing backend applications is not required but definitely a plus.</p>\n\n<h2>Job Requirements:</h2>\n\n<ul>\n<li>Experience with Infrastructure as Code and Configuration Management tools.</li>\n<li>Proficient in Ruby and at least one other programming language.</li>\n<li>Knowledge of the ELK stack.</li>\n<li>Experience with Prometheus/Grafana for metrics aggregation/visualization.</li>\n<li>Configuration of CI/CD pipelines using Jenkins.</li>\n<li>Experience using Kubernetes.</li>\n<li>Experience with automation tools/platforms.</li>\n<li>Experience with alerting and monitoring tools.</li>\n<li>Experience working in a highly distributed company.</li>\n<li>Being open minded and always learning.</li>\n</ul><h2>Duties &amp; Responsibilities:</h2>\n\n<ul>\n<li>Design, creation and provisioning of infrastructure.</li>\n<li>Deploy and maintain applications.</li>\n<li>Collaborate with other engineers to implement operational solutions while adhering to and defining organizational best practices.</li>\n</ul><p>_Citrusbyte expects employees to be honest, trustworthy, and operate with integrity. Discrimination and all unlawful harassment (including sexual harassment) in employment is not tolerated. We encourage success based on our individual merits and abilities, and all decisions regarding recruitment, hiring, promotion, compensation, employee development decisions such as training, and all other terms and conditions of employment, will be made without regard to race, nationality, national origin, citizenship status, employment status, ethnicity, ethnic origin, color, creed, religion, belief, age, marital status, pregnancy, gender, gender identity, sexual preference, lifestyle, social class, military status, disability, physical features, or any other protected status. We oppose all forms of unlawful or unfair discrimination. Citrusbyte is an equal opportunity employer. </p>\n\n<p>No statements by Citrusbyte are intended to create an offer of employment unless made in a writing signed by an officer of the company and no offer shall become effective unless countersigned by the prospective employee._</p>",
    "how_to_apply": "<p><a href=\"https://citrusbyte.applytojob.com/apply/jBS24wN4G3/Senior-DevOps-Engineer-Remote-OK?source=GitHub\">Apply directly on our careers page</a>.</p>",
    "company": "Citrusbyte",
    "company_url": "https://citrusbyte.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/0ee33752-bdf0-11e8-84a6-de5cc5b44b88.png",
    "url": "http://jobs.github.com/positions/27c5ae30-bdf0-11e8-8676-d947917b5c6e"
  },
  {
    "id": "500a45e8-d797-11e8-9589-a611be182446",
    "created_at": "Wed Oct 24 14:16:23 UTC 2018",
    "title": "FPGA Engineer",
    "location": "Austin, Texas ",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>Join our team and develop the next generation of technology for leading-edge research in the Life Sciences, from Cancer Research to Neuroscience. Thorlabs Scientific imaging based in Austin TX is looking for a talented individual with a strong understanding of FPGA architectures and DSP. Our ideal candidate would enjoy collaborating with a multidisciplinary team comprising of scientific researchers from leading university laboratories, algorithm developers and engineers. Our team is focused on the development of scalable hardware platforms aimed at advancing our laser scanning microscopy systems.</p>\n\n<p>Essential Job Functions include the following, but are not limited to:</p>\n\n<ul>\n<li>Technology transfer from Thorlabs R&amp;D division</li>\n<li>Participation in building core technical team</li>\n<li>Working with internal customers to finalize product requirements</li>\n<li>Development of Field Programmable Gate Arrays including coding, test and functional verification, timing closure, and documentation. Emphasis on timing closure and high-speed hardware data paths.</li>\n</ul><p>Qualifications\nExperience:</p>\n\n<ul>\n<li>Minimum 5 years of FPGA design experience with 2 years of board-level product commercialization experience\nEducation:</li>\n<li>Minimum Bachelor's degree or equivalent in Electrical Engineering\nSpecialized Knowledge and Skills:</li>\n<li>Demonstrated strong VHDL and/or Verilog skills; logical and physical design, timing closure</li>\n<li>Recent design of complex, dense design with Xilinx FPGA design flow and simulation tools</li>\n<li>High-speed (GHz) serial and DDR3 implementations</li>\n<li>Familiarity with high-speed (GHz) PCB design techniques</li>\n<li>Recent design of data-intensive architectures and functional blocks; for example RADAR, LIDAR, or HDTV.</li>\n<li>FPGA-based, board-level architecture and design</li>\n<li>Demonstrated ability to bring FPGA subsystem from concept through release to manufacturing</li>\n<li>Working knowledge of signal processing algorithms, host architectures, and host data storage devices and optimization techniques</li>\n<li>Contribute to the development of project timelines and milestones</li>\n<li>Assess FPGA technical risk; including analysis, simulation, prototyping, and contingency planning</li>\n<li>Design for Test and Manufacturability</li>\n<li>Board-level, production test development and implementation</li>\n<li>Electronic device commercialization</li>\n<li>PCIe Host Adaptor Card design and commercialization experience desired</li>\n<li>Imaging Systems experience desired</li>\n<li>Digital Signal Processing experience desired</li>\n</ul><p>Thorlabs values its diverse environment and is proud to be an Equal Employment Opportunity/Affirmative Action employer. All qualified individuals will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status. Job descriptions are not intended as and do not create employment contracts. The organization maintains its status as an at-will employer. Employees can be terminated for any reason not prohibited by law.</p>",
    "how_to_apply": "<p>Please be sure to complete an application on the company's career site for consideration:\n<a href=\"https://www.appone.com/MainInfoReq.asp?R_ID=2125923\">https://www.appone.com/MainInfoReq.asp?R_ID=2125923</a></p>",
    "company": "Thorlabs, Inc.",
    "company_url": "https://www.thorlabs.com/",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/500a45e8-d797-11e8-9589-a611be182446"
  },
  {
    "id": "d662ff1e-d796-11e8-8c81-a8499a7d1c85",
    "created_at": "Wed Oct 24 14:13:02 UTC 2018",
    "title": "Lead Data Acquisition Design Engineer",
    "location": "Austin, Texas",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>Join our team and develop the next generation of technology for leading-edge research in the Life Sciences, from Cancer Research to Neuroscience. Thorlabs Scientific imaging based in Austin TX is looking for a talented individual with a strong understanding of FPGA architectures and DSP. Our ideal candidate would enjoy collaborating with a multidisciplinary team comprising of scientific researchers from leading university laboratories, algorithm developers and engineers. Our team is focused on the development of scalable hardware platforms aimed at advancing our laser scanning microscopy systems.</p>\n\n<p>Essential Job Functions include the following, but are not limited to:</p>\n\n<ul>\n<li>Working with internal customers to finalize product requirements</li>\n<li>Leadership of the hardware and firmware development team from design to sustaining engineering</li>\n<li>Development of data acquisition card design including circuit design, test and functional verification, production test fixtures and documentation. Emphasis on high-speed connectors, GHz-rate data conversion (ADC and DAC), data path, DRAM, FPGA, and PCIe interface</li>\n</ul><p>Qualifications\nExperience:</p>\n\n<ul>\n<li>Minimum 5 years of PCB design experience with 2 years of board-level product commercialization experience\nEducation:</li>\n<li>Minimum Bachelor’s degree or equivalent in Electrical Engineering\nSpecialized Knowledge and Skills:</li>\n<li>Demonstrated strong high speed (GHz) digital and mixed-signal circuit and PCB design skills</li>\n<li>Recent design of high-speed (GHz) mixed-signal, data conversion, serial interface, and DDR implementations</li>\n<li>Recent design of data-intensive board architectures; for example Data Acquisition, RADAR, LIDAR, or HDTV</li>\n<li>Demonstrated ability to bring complex, high speed digital designs from concept through release to manufacturing</li>\n<li>Excellent system- and component-level debugging and troubleshooting skills</li>\n<li>Development of project timelines with milestones</li>\n<li>Management of technical risk; including analysis, simulation, prototyping, and contingency planning</li>\n<li>Design for Test and Manufacturability</li>\n<li>Board-level test</li>\n<li>Strong communication skills</li>\n<li>PCIe Host Adaptor Card design and commercialization</li>\n<li>Imaging Systems</li>\n<li>Digital Signal Processing</li>\n</ul><p>Thorlabs values its diverse environment and is proud to be an Equal Employment Opportunity/Affirmative Action Employer. All qualified individuals will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age or veteran status. Job descriptions are not intended as and do not create employment contracts. The organization maintains its status as an at-will employer. Employees can be terminated for any reason not prohibited by law.</p>",
    "how_to_apply": "<p>Please be sure to complete an application on the company's career site for consideration:\n<a href=\"https://www.appone.com/MainInfoReq.asp?R_ID=1824413\">https://www.appone.com/MainInfoReq.asp?R_ID=1824413</a></p>",
    "company": "Thorlabs, Inc.",
    "company_url": "https://www.thorlabs.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/765a997e-d796-11e8-9454-fd2ba67bccf2.jpg",
    "url": "http://jobs.github.com/positions/d662ff1e-d796-11e8-8c81-a8499a7d1c85"
  },
  {
    "id": "0d240e44-d792-11e8-8b88-a458e5f37601",
    "created_at": "Wed Oct 24 13:38:27 UTC 2018",
    "title": "Tester/Scrummaster",
    "location": "Amsterdam",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><b>Zorg dat onze applicaties probleemloos in gebruik kunnen worden genomen als tester/scrummaster bij DNB. \n</b></p><p>\n<b>Jij hebt impact</b><br>\nBij DNB werk je met impact op financiële stabiliteit en duurzame welvaart. In een snel veranderende omgeving denk jij als tester/scrummaster mee over complexe testtrajecten. Zo zorg jij samen met je collega’s voor een verdere optimalisatie van ons testproces!\n</p><p>\n<b>Zo doe je dat als tester/scrummaster bij DNB</b><br>\nVanuit de dynamiek van het centrum van Amsterdam stap je in de dynamiek van DNB. Je haalt snel een espresso bij de koffiebar, checkt je mail op je telefoon en neemt de trap of lift naar de 2everdieping. Terwijl je bijpraat met je collega’s sluit je jouw laptop aan en begin je aan je werkdag. Je begint de dag met een stand-up, daar geef jij een korte presentatie over de laatste ontwikkelingen in de huidige sprint. Als tester ben je verantwoordelijk voor de uitvoering van functionele testen, de creatie en de uitvoering van de regressietest, verbetering van de testprocessen met behulp van testautomatiseringstools, de coördinatie en begeleiding van de gebruikerstesten.\n</p><p>\nJe luncht met je collega’s van de afdeling in het bedrijfsrestaurant; lastig kiezen die verse lasagne of toch een maaltijdsalade? Of je loopt met een collega van een andere afdeling een rondje over de Albert Cuijpmarkt. Aan het einde van de dag heb je een afspraak met de andere testers van de DevOps teams. Jullie wisselen kennis uit van alle applicaties binnen de keten, zowel front end als back end. Deze sessie gebruik je als input om je presentatie voor te bereiden van de demo die je maakt voor alle stakeholders. Daarnaast sparren jullie – in de vakgroep van de testers – met elkaar over het verder professionaliseren van jullie expertisegebied. De vakgroep komt periodiek bij elkaar om complexe problemen met elkaar op te lossen, van elkaar te leren en de werkwijze te harmoniseren.\n</p><p>\nTijdens de boksles in de eigen fitnessruimte van DNB kom je op een creatief idee voor verbetering van het testproces, dus je doucht snel en zet dit idee nog even op de mail naar je collega’s. Je klapt je laptop in en omdat je de dag erna wat later begint vanwege een privé afspraak, werk je thuis nog even aan de presentatie voor het dagelijks overleg.\n</p><p>\n<b>Hier doe je dat</b><br>\nJe werkt als tester/scrummaster in Amsterdam bij de divisie Statistiek. Daar werken ongeveer 100 collega's samen om tijdig kwalitatief goede cijfers te leveren en hun kennis hierover uit te dragen. Samen verzamelen en verwerken zij een groot aantal gegevens van financiële instellingen en bedrijven. Deze gegevens vormen de input voor nationale en Europese statistieken, zoals de betalingsbalans, de financiële rekeningen, de monetaire statistieken en statistieken ten behoeve van toezicht en financiële stabiliteit. \n</p><p>\nDe processen zijn hoog geautomatiseerd. Het belang van de gebruikte informatiesystemen is daarmee evident. Binnen onze divisie zijn het Business Intelligence Competence Centre en het Data Service Centre verantwoordelijk voor het ontwikkelen, onderhouden en beheren van de gebruikte informatiesystemen en de voortbrenging en ontsluiting van de binnen DNB aanwezige databronnen. De sfeer op beide afdelingen is collegiaal en professioneel met veel ruimte voor eigen verantwoordelijkheid.\n</p><p>\n<b>Dit breng je mee</b><br>\nBij DNB werk je met inhoudelijke professionals. De kwaliteit van het werk van je collega’s is hoog. Daarom vinden we het belangrijk dat jij proactief bent en snel leert. Je bijt je graag ergens in vast en je durft met initiatieven te komen, zowel binnen als buiten je eigen team. Je hebt een natuurlijke drive om nieuwe vaardigheden aan te willen leren en moeilijke problemen op te willen lossen. Je bent gewend om te werken in een agile omgeving waarbij het teambelang voorop staat.\n</p><p>\n<b>Waar zijn we verder nog naar op zoek?</b></p>\n\n<ul>\n<li>Je hebt minimaal een bachelor werk- en denkniveau c.q. opleiding, bijvoorbeeld Informatica.<br>\n</li>\n<li>Je bent TMAP Next en/of ISTQB gecertificeerd, je hebt kennis van en ervaring met XML en bij voorkeur ook XBRL.<br>\n</li>\n<li>Bij voorkeur heb je ook kennis van en ervaring met tooling met betrekking tot testautomatisering en beschik je over TFS-, VBA- en .NET vaardigheden.<br>\n</li>\n<li>Je hebt ervaring als scrummaster of je hebt de ambitie om deze rol op te pakken in het team. Maar past het testprofiel jou als een handschoen en heb je minder affiniteit met de rol van scrummaster, dan is jouw sollicitatie ook van harte welkom!<br>\n</li>\n<li>Jouw communicatieve vaardigheden zijn uitstekend, zowel in het Nederlands als in het Engels. Fluent Dutch is a strict requirement for this position!<br>\n</li>\n</ul><p><b>Dit bieden we je</b><br>\nEen 36-urige werkweek - 32 uur kan ook - met werk midden in de financiële en economische actualiteit. Bij een heel diverse, betrouwbare en maatschappelijk betrokken werkgever, die voortdurend inspeelt op de veranderende eisen van onze omgeving. En die doorlopend innoveert. Dit biedt jou volop kansen je verder te verdiepen en nieuwe ervaringen op te doen. In Nederland, maar ook daarbuiten. Je krijgt een tijdelijk contract van 2 jaar.\n</p><p>\nDe overige goede arbeidsvoorwaarden die horen bij deze functie:<br></p>\n\n<ul>\n<li>Een salaris van minimaal € 3.100,-- en maximaal € 4.400,-- bruto per maand, op basis van een 36-urige werkweek. De uiteindelijke inschaling is onder meer afhankelijk van je kennis en ervaring.</li>\n<li>Een 13de maand en 8% vakantietoeslag berekend over 13 maanden.<br>\n</li>\n<li>Pensioenopbouw op basis van middelloon met voorwaardelijke indexatie. Eigen bijdrage in de premie 6,1%.<br>\n</li>\n<li>Een volledige vergoeding van je OV-reiskosten woon-werkverkeer.</li>\n<li>Veel mogelijkheden jezelf door opleiding en training zowel vakinhoudelijk als persoonlijk te blijven ontwikkelen.<br>\n</li>\n<li>Een goede balans tussen je professionele en je privéleven. In deze functie is het mogelijk om 4 dagen van 9 uur te werken.\n<p>\nDit allemaal bij een werkgever in hartje Amsterdam, die prima per openbaar vervoer bereikbaar is. Waar je bovendien – afhankelijk van je functie – deels thuis kunt werken en waar we ons werk steeds vaker op een agile manier doen.\n</p>\n<p>\nSolliciteer nu! Want bijdragen aan financiële stabiliteit en duurzame welvaart… dat is werken bij DNB\nWil jij als tester/scrummaster werken met impact? Solliciteer dan direct op deze vacature! Als sollicitatie ontvangen we graag uiterlijk 8 november 2018 een motivatiebrief en je complete cv via <a href=\"https://denederlandschebank.redirect.your-jobresponse.com/tester_scrummaster_amsterdam/233715/V819/solliciteren%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20\">deze link</a>. Heb je eerst nog vragen? Neem dan contact op met Arno Griffioen (product owner team rapportage-implementatie) via 06 5249 6462, met Ariane Knoppert (projectmanager) 06 5249 6762 of met Lia van Heerwaarden (recruiter) via 06 5249 6524 / c.m.van.heerwaarden@dnb.nl. We vertellen je graag meer over wat werken bij DNB zo uniek maakt!\n</p>\n<p>\nBij de beoordeling van kandidaten gaan wij heel zorgvuldig te werk. Dat vinden wij als betrouwbare werkgever vanzelfsprekend. Tijdens de selectieprocedure vragen we je daarom om ná een succesvolle eerste gespreksronde een e-assessment te maken. De uitslag van deze cognitietesten is bepalend voor het vervolg van de procedure. Ook willen wij graag aan het eind van de procedure contact kunnen opnemen met minimaal twee referenten.\n</p>\n<p>\nVoor de screeningsprocedure is deze functie ingedeeld in profiel 2a, dit betekent dat er een justitieel antecedentenonderzoek plaatsvindt. Ook online screening kan onderdeel zijn van het proces. Meer informatie over de screening vind je op de pagina <a href=\"https://www.dnb.nl/werken-bij/solliciteren/index.jsp\">Solliciteren</a>.\n</p>\n<p>\n<b>Deze vacature is bedoeld om op te solliciteren, niet voor acquisitie.</b></p>\n</li>\n</ul>",
    "how_to_apply": "<p>Solliciteer direct op deze vacature via <a href=\"https://denederlandschebank.redirect.your-jobresponse.com/tester_scrummaster_amsterdam/233715/V819/solliciteren%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20%20\">deze link</a>.</p>",
    "company": "De Nederlandsche Bank",
    "company_url": "http://dnb.nl",
    "company_logo": "http://github-jobs.s3.amazonaws.com/0a619858-d791-11e8-9446-18768ce54a9d.JPG",
    "url": "http://jobs.github.com/positions/0d240e44-d792-11e8-8b88-a458e5f37601"
  },
  {
    "id": "7c44cf7c-d713-11e8-89be-b3e23046d61a",
    "created_at": "Tue Oct 23 22:32:57 UTC 2018",
    "title": "Senior .NET Developer",
    "location": "New Orleans, LA",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>Susco helps businesses grow by creating software customized to their unique needs.  We believe that our work helps people live more fulfilling lives by reducing their repetitive tasks, allowing them to concentrate on more valuable work.</p>\n\n<p>Susco is located in the Greater New Orleans Area and is one of the fastest-growing tech companies in Louisiana.  We develop custom web-based business software with a focus on legacy system conversions.  Our primary development platforms are C# .NET for web services, and Ionic/Cordova for mobile apps.</p>\n\n<p>Requirements </p>\n\n<ul>\n<li>5 Years web development experience</li>\n<li>Elicitation of requirements from non-technical business users</li>\n<li>Conceptually design systems based on business requirements</li>\n<li>Perform technical lead role through the SDLC</li>\n<li>Highly proficient in database design and SQL</li>\n<li>Highly proficient in a server-side language such as C#, Java, Ruby, Python, or PHP</li>\n<li>Highly proficient with Javascript</li>\n<li>Experience with CSS/HTML</li>\n<li>Ability to adapt to rapidly changing environments</li>\n<li>Self-motivated with a positive attitude</li>\n<li>Willingness to drive projects to completion in a fast-moving environment </li>\n</ul><p>Nice-to-Have</p>\n\n<ul>\n<li>Experience with Kendo UI</li>\n<li>Experience with Legacy system conversions </li>\n<li>BS/BA degree</li>\n<li>Azure experience</li>\n<li>Linux experience </li>\n<li>Mobile development experience</li>\n<li>C# Expertise</li>\n<li>Microsoft Visual Studio</li>\n<li>Salesforce Experience</li>\n</ul><p>Responsibilities </p>\n\n<ul>\n<li>Application Development, primarily ASP.NET (C#.NET) </li>\n<li>Database Design and Maintenance</li>\n<li>Requirements analysis</li>\n<li>Assisting with the development of scope documents and budgets for new work </li>\n<li>Perform work within allotted hourly budgets and within specific timeframes </li>\n<li>Client communication </li>\n</ul><p>Compensation</p>\n\n<ul>\n<li>Salary: $80,000 - $100,000/year</li>\n<li>3 Weeks PTO + 9 Holidays</li>\n<li>3 Days/year of self-driven learning time like conferences</li>\n<li>Health, Dental, Life, Disability Insurance</li>\n<li>Various Wellness activities paid for</li>\n</ul><p>Our Core Values</p>\n\n<p><strong>Growth</strong>: We believe we can create a better world by constantly growing as individuals, resulting in growth for the Company and growth for our clients.</p>\n\n<p><strong>Action</strong>: We believe we don't have good days, we make them.  We believe in being proactive and not reactive. Passivity leads to a lack of involvement, while our focus is on creating the future.  We don't complain, we identify and solve problems.</p>\n\n<p><strong>Teamwork</strong>: We believe that we are human beings first, coworkers second.  We strive to be cognizant as people with lives outside of this office.  As a high-performance organization, there are times of high stress.  In those times, we rally to get the job done and we recognize our behavior and performance impacts our team. </p>\n\n<p><strong>Efficiency</strong>: We believe in learning from our mistakes the first time.  We believe there is a time and place for complex solutions for complex problems.  We also have the ability to decompose complex problems into simpler problems. When we see a problem or inefficiency, we have both the responsibility and ability to propose solutions.</p>",
    "how_to_apply": "<p><a href=\"http://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer\">http://careers.suscosolutions.com/apply/b8W5be/Senior-NET-Developer</a></p>",
    "company": "Susco Solutions",
    "company_url": "http://www.suscosolutions.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e7476e5c-d712-11e8-9aa5-ef3eb55f5e60.png",
    "url": "http://jobs.github.com/positions/7c44cf7c-d713-11e8-89be-b3e23046d61a"
  },
  {
    "id": "ac69c278-d70b-11e8-8d68-56afb6a47cd3",
    "created_at": "Tue Oct 23 21:37:34 UTC 2018",
    "title": "Web Developer",
    "location": "Santa Barbara, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>Yardi Systems, the leader in asset and property management software, is currently seeking a Web Developer to join their growing office in Santa Barbara, CA!</p>\n\n<p>The full stack developer must be able to define project specifications, collaborate with stake holders, code complex business logic, implement intuitive user interfaces and otherwise support the corporate marketing websites. </p>\n\n<p>Responsibilities\n· Create and maintain WordPress plugins and themes\n· Develop appropriate code structures to solve specific tasks\n· Coordinate/collaborate with staff and teams to develop and deploy projects\n· Assist and support in the upkeep and maintenance of websites\n· Troubleshoot and resolve technical problems</p>\n\n<p>Requirements\n· Associate degree, certification or commensurate experience\n· 2+ years of full stack development experience\n· Proficiency with PHP, HTML, CSS, JavaScript/JQuery\n· Experience creating and using APIs and web services (REST/SOAP) \n· An assertive, engaging personality with a history of generating results\n· Goal oriented and able to self-direct\n· Team player who can motivate and encourage the best from others</p>\n\n<p>PLEASE APPLY TO: <a href=\"http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\">http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598</a></p>\n\n<p>Yardi Systems is a successful independent software company with a proven history of growth and market leadership in the multi-billion dollar global commercial real estate industry. We employ talented, motivated and innovative people that are focused on delivering superior solutions to our clients and are passionate about working with other highly skilled professionals in team environments.</p>\n\n<p>If you are seeking an opportunity to join a winning team, work with the latest Microsoft technologies and develop your career, then Yardi Systems is the place for you. We have a pleasant and casual work environment, competitive salaries, and a comprehensive benefits package. Our corporate culture stresses integrity, respect, trust, responsibility, and fun.</p>\n\n<p>EOE Race/Gender/Disability/Vets</p>",
    "how_to_apply": "<p><a href=\"http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598\">http://www.yardi.com/about-us/career-opportunities/?jobRequested=10598</a></p>",
    "company": "Yardi Systems",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/9e7a9de0-d70b-11e8-89e8-0a48bef6c85f.jpg",
    "url": "http://jobs.github.com/positions/ac69c278-d70b-11e8-8d68-56afb6a47cd3"
  },
  {
    "id": "dbfc02f2-fd77-11e3-9627-a101934ea25e",
    "created_at": "Tue Oct 23 16:21:20 UTC 2018",
    "title": "Backend Engineering (Scala+)",
    "location": "San Francisco",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>As an engineer on the Sharethrough Exchange team at Sharethrough, you’ll build out our highly scalable service infrastructure, generating insights used by top publishers and brands on the open web, powering critical revenue behind companies like Disney, CNN, VICE, and CBSi.  You'll be a key contributor to our Scala-based backend services that make thousands of complex, real-time decisions per second possible. Large-scale distributed, high performance = those are the problems you can solve on the team.</p>\n\n<p><strong>What You'll Be Doing</strong></p>\n\n<ul>\n<li>\n<strong>Having a say:</strong> You’ll participate in problem definition and solution with a diverse group of engineers, designers and business owners from around the company.</li>\n<li>\n<strong>Proper engineering:</strong> Writing Scala-based pipeline processing and infrastructure that is performant, well-tested, and easy to maintain. We value teamwork and experimentation to achieve the best outcomes.</li>\n<li>\n<strong>Technical heavy lifting:</strong> You’ll architect and implement major components of an ambitious distributed system at scale.</li>\n</ul><p><strong>Let's Talk If</strong></p>\n\n<ul>\n<li>\n<strong>You’ve shipped software:</strong> You have production experience with large-scale distributed systems and are excited to explore new technologies that can push the boundaries of efficiency.</li>\n<li>\n<strong>You care about code:</strong> You take pride in engineering, and have a deep understanding of how to write high quality, maintainable, extensible software in a collaborative environment.</li>\n<li>\n<strong>You like moving quickly:</strong> We push to production on every commit via our  continuous integration and deployment pipeline and value truly immutable infrastructure.</li>\n</ul><p><strong>Why You'll Love Working at Sharethrough</strong></p>\n\n<ul>\n<li>\n<strong>Values-driven culture:</strong> You’d be walking into a welcoming and diverse environment that is built around action, optimism, purpose and transparency.  We have a fun, supportive culture, and firmly believe in what we’re doing.</li>\n<li>\n<strong>Marry the problem, not the solution:</strong> We’re constantly re-evaluating our technical infrastructure to deliver faster, better, and more reliable software.</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github\">https://jobs.lever.co/sharethrough/33855426-0ce2-47d1-8eaa-66adf6b375d2/apply?lever-source=Github</a></p>",
    "company": "Sharethrough",
    "company_url": "http://Sharethrough",
    "company_logo": "http://github-jobs.s3.amazonaws.com/e0508206-6bc1-11e5-89ca-4c0b59d838c7.png",
    "url": "http://jobs.github.com/positions/dbfc02f2-fd77-11e3-9627-a101934ea25e"
  },
  {
    "id": "75c9618e-d6d8-11e8-9077-2442ddf4c962",
    "created_at": "Tue Oct 23 15:31:48 UTC 2018",
    "title": "Senior Backend Engineer",
    "location": "Zug",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>ricardo.ch is the largest online marketplace in Switzerland with over 1 million listed items and more than 2 million users. If you enjoy solving problems in a creative way with elegant solutions then you will enjoy working with us.</p>\n\n<p>We believe in continuous improvement, clean code, simple design, speed, and scalability. We are looking for a strong engineer who can join work on a diverse set of projects and push innovation forward.</p>\n\n<p><b>What are software engineers building at ricardo.ch?<b></b></b></p>\n\n<ul>\n<li>We deploy 30-50 times per day, using continuous deployment with Werker</li>\n<li>We switched all engineers to node.js and golang in just three months</li>\n<li>Our new platform runs on Kubernetes, and we developed a sweet pipeline for all apps and services to deploy containers easily</li>\n<li>We’re working with Java, Golang, Python, Node and use REST and gRPC (protobuf)</li>\n<li>Our internal APIs are fully documented and we make sure to keep things up to date with a custom tool</li>\n<li>Our engineers and product managers take advantage of feature flags in production, constantly testing and rolling things out gradually</li>\n<li>We implemented multiple solutions with Kafka even streams, ranging from instant search index updates to bookkeeping</li>\n<li>We’ve integrated Stripe, Auth0, SendGrid and many other services into our platform</li>\n<li>Our engineers work with machine-learning algorithms to detect fraud, notice image quality issues, and identify objects within images</li>\n<li>We have released open source libraries for Go and Node, and write blog posts about cool things</li>\n<li>We automate and monitor everything, using tools like Grafana, ElasticSearch, Kibana, Zipkin, Prometheus, Sumologic, and more.</li>\n</ul><p><b>Your responsibilities will be to:<b></b></b></p>\n\n<ul>\n<li>Build robust and scalable software</li>\n<li>Design and create services and system architecture for your projects, and contribute and provide feedback to other team members</li>\n<li>Help improve our code quality through writing unit tests, automation and performing code reviews\nParticipate in brainstorming sessions and contribute ideas to our technology, algorithms and products</li>\n<li>Work with the product and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution</li>\n<li>Dive into difficult problems and successfully deliver results on schedule</li>\n</ul><p><b>Examples of profiles we are looking for:<b></b></b></p>\n\n<ul>\n<li>Strong experience in SOA environments, APIs, services, architectures</li>\n<li>Mastery of best practices in server-side development using multiple languages and related frameworks, preferably Java with Spring , Go, Javascript, etc.</li>\n<li>Experience designing and implementing APIs and microservices using REST and RPC</li>\n<li>Plus: experience with event-driven and pub/sub systems, Kafka, CQRS, ActiveMQ/ZeroMQ etc.</li>\n<li>Plus: Experience with frontend-backend architecture, web applications, mobile clients</li>\n</ul><p><b>About ricardo.engineering<b></b></b></p>\n\n<p>ricardo.engineering is the largest part of EPD - a unified Engineering, Product and Design department. We work cross-functionally, with around 6-8 teams active on different topics at once. We share a hackday-style way of working, with weekly shared standups and demos, strong self-organization, and individual responsibility. With over 60 engineers, and three offices (Zug,CH Valbonne, FR, Belgrade, SRB), we work remotely, and travel often. Together, we share in workshops, hack days, and allocate 20% of engineering time for innovation, learning, and experiments. Our culture is geek, our working style is agile, our mindset is collaborative.</p>\n\n<p>Today, ricardo.ch is the largest online marketplace in Switzerland with over 1 million listed items and more than 2 million users. We aim to improve our platform, innovate, grow the marketplace even further. If you enjoy challenges at scale, high energy work, and are creative in the solutions you bring, then you will enjoy working with us.</p>",
    "how_to_apply": "<p>Please apply here:\n<a href=\"https://ricardochag.teamtailor.com/jobs/65576-senior-backend-engineer-80-100/applications/new\">https://ricardochag.teamtailor.com/jobs/65576-senior-backend-engineer-80-100/applications/new</a></p>",
    "company": "ricardo.ch",
    "company_url": "https://www.ricardo.ch/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/401a93d2-d6d8-11e8-9289-45812383d918.jpg",
    "url": "http://jobs.github.com/positions/75c9618e-d6d8-11e8-9077-2442ddf4c962"
  },
  {
    "id": "c307e4ca-d6a6-11e8-8f6e-f00ef74f7cb0",
    "created_at": "Tue Oct 23 09:36:02 UTC 2018",
    "title": "Senior Python Engineer",
    "location": "Zurich",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>We’re looking for senior engineers with solid Python skills to join our team, which is building a platform, called Squirro, for unstructured data analysis.</p>\n\n<p>Squirro can ingest data from anywhere, be it public on the web or social medium or internal, such as a CRM, database or ITSM system, and add structure to it so that it can be delivered to business users using our dashboard visualisations or consumed by other systems using our APIs. We add structure to unstructured data by employing a range of techniques, from statistical and Bayesian models to supervised and unsupervised machine learning which we serve to our customers as a unified and patented technology we call Smartfilters. Meanwhile, for our users, we provide a simple interface to access these technologies so that anyone with basic analytical skills can get value out of their companies unstructured data.</p>\n\n<p>Our customers are some of the largest banks and financial institutions in the world, across the US, UK, EU, Switzerland and Asia. Many of our customers are just beginning to discover the potential of unstructured data analysis and we’re excited by the opportunity as an early mover in this young market. While we host some of these customers in the cloud, the majority prefer to install Squirro on-premise for security reasons.</p>\n\n<p>We need you to help us build out and scale this platform, as our customers apply it to ever growing volumes of data and discover new ways to structure and analyse that data.</p>\n\n<p><strong>Required Qualifications</strong></p>\n\n<ul>\n<li>Exceptional programming experience in Python</li>\n<li>Extensive knowledge of UNIX/Linux from a developers perspective</li>\n<li>Strong track record in software systems design, from initial implementation to performance optimisation and scaling</li>\n<li>Experience developing professionally as part of a team, giving and receiving code reviews, test-driven development etc.</li>\n<li>Good communication skills with fluency in English</li>\n<li>Swiss citizenship or work permit in Switzerland, or living and working in UK, EU or EFTA member state. We’d love to hire people worldwide but Swiss immigration law makes this problematic except in rare cases.</li>\n</ul><p><strong>Nice to Have</strong></p>\n\n<ul>\n<li>BS, MS or PhD in Computer Science or related technical field</li>\n<li>Experience with information retrieval technologies (Elasticsearch, Lucene)</li>\n<li>Comfortable working with large datasets and designing systems able to process and scale up to large data volumes</li>\n<li>Familiarity with RESTful web services and microservices architectures</li>\n<li>Experience with MySQL, Redis, nginx, Zookeeper and other technologies in the Squirro stack</li>\n<li>Familiarity with AWS, Terraform, Prometheus, Grafana, Ansible and other DevOps related tools</li>\n<li>Awareness of machine learning as applied to text analysis</li>\n</ul><p><strong>Working with Us</strong></p>\n\n<p>Squirro is a Swiss startup with an international flavour. Our team of passionate technology geeks and entrepreneurs mix local “Swissness” with American, German, French, Russian, Indian, Portuguese, Polish and British into an all-round startup team that combines the excellence of the ETH and EPFL with experience from technology companies such as Microsoft and Google as well as Swiss players such as local.ch and DeinDeal.</p>\n\n<p>We love Python and ElasticSearch on the server side and JavaScript, backbone.js, React, D3 and more on the client side. We work with git, believe in testing, code reviews, continuous integration and continuous deployment. Our work is structured loosely around scrum with help from Jira and the Atlassian tool suite. We take design and user experience seriously and apply machine learning in the context of text analysis.</p>\n\n<p>Most of all we’re serious about building a world-class company and our compensation package includes shares because we believe our employees should be rewarded for their hard work and dedication.</p>\n\n<p>Our engineering office is in the heart of Zürich, with easy access to public transport.</p>",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:jobs@squirro.com\">jobs@squirro.com</a></p>",
    "company": "Squirro",
    "company_url": "https://www.squirro.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a7b5b95e-d6a6-11e8-975b-63b2d8fcf3be.png",
    "url": "http://jobs.github.com/positions/c307e4ca-d6a6-11e8-8f6e-f00ef74f7cb0"
  },
  {
    "id": "126c5b80-d626-11e8-9e0e-830fc841cb6b",
    "created_at": "Mon Oct 22 18:13:39 UTC 2018",
    "title": "Data Engineer, Hedge Fund",
    "location": "San Francisco, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>ABOUT THE FIRM</p>\n\n<p>Resonate Capital is an SEC registered long/short equity investment firm headquartered in San Francisco. Resonate Capital’s “next-generation” investment research approach is built off the ability to extract information from the growing digital footprint of the global consumer. The Resonate Capital Investment Team utilizes non-traditional data collection methods to detect how various technologies are disrupting “old world” business and naturally evolving into new business models.</p>\n\n<p>The firm’s guiding business principles reflect our basic values and guide our daily actions and investment activities:</p>\n\n<p>-Build a successful asset management business centered on the highest ethical standards, integrity, creativity, hard work, and due diligence.\n-Build the next generation data-driven, alpha generating research platform.\n-Build a track record that is respected for its consistency and quality of return characteristics.\n-Focus on performance, not maximizing assets. When we create value for our investors, our own success will follow.\n-Create a structure that aligns our personal interests directly with our investors’ interests.\n-Communicate regularly with investors in an open, direct, and honest manner.</p>\n\n<p>THE OPPORTUNITY</p>\n\n<p>This is an opportunity to join a cutting edge firm at one of the most exciting frontiers in investment research and management. Resonate is seeking an individual who embraces the firm’s focus on upholding our fiduciary duty to our clients and maintaining the highest ethical standards. We are men and women of integrity who place a premium on hard work, creativity, and diligence in the pursuit of getting the job done for our clients. Responsibilities include, but are not limited to:</p>\n\n<p>-Leading all infrastructure, software, and technology initiatives\n-Developing software for the collection and processing of data that can inform investment decisions\n-Having full control over the technology stack\n-Web harvesting (scraping) unstructured data and helping convert it into structured data\n-Advancing existing initiatives and generating new research opportunities for non-traditional data collection\n-Managing our internal network and software/hardware\n-Presenting our technology and research initiatives to potential investors on a regular basis</p>\n\n<p>REQUIREMENTS</p>\n\n<p>-Bachelor’s degree in computer science, engineering, math, or related subject - master’s or PhD a plus\n-Be a solid coder – we use Python and SQL mostly, but being able to learn any new technology is most important\n-Ability to take ownership of our entire architecture – experience with AWS and evaluating cloud services is important\n-Extreme attention to detail, and being comfortable working in a high-paced environment\n-Self-motivated and capable of working independently – you will have a very high level of responsibility very quickly\n-High level of creativity, imagination, and intellectual curiosity\n-Comfort with financial markets – you don’t have to be an expert, but be willing to learn\n-Communication skills to work with everyone from management to potential investors</p>",
    "how_to_apply": "<p>Please send your resume to <a href=\"mailto:resume@resonatecap.com\">resume@resonatecap.com</a></p>",
    "company": "Resonate Capital, LLC",
    "company_url": null,
    "company_logo": null,
    "url": "http://jobs.github.com/positions/126c5b80-d626-11e8-9e0e-830fc841cb6b"
  },
  {
    "id": "e187e176-d4d9-11e8-89b9-2c50d9a12d58",
    "created_at": "Mon Oct 22 17:33:55 UTC 2018",
    "title": "Full Stack Engineer",
    "location": "San Francisco",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>SUPERHUMAN </p>\n\n<p>We're building the fastest email experience in the world.</p>\n\n<p>Superhuman is:</p>\n\n<ul>\n<li>The most wanted product on Product Hunt, with 70K+ people on our waitlist</li>\n<li>Growing revenue 7% week-week, 30% month-month</li>\n<li>Loved and adored: <a href=\"https://twitter.com/SuperhumanCo/timelines/911278863216340992\">see what our users say</a>\n</li>\n<li>Come shape the future of email, communication, and productivity!</li>\n</ul><p>BUILD LOVE </p>\n\n<p>At Superhuman, we deeply understand <a href=\"https://www.linkedin.com/pulse/goodbye-mr-iwata-rahul-vohra\">how to build products that people love</a>. We incorporate fun and play; we infuse magic and joy; we make experiences that amaze and delight.</p>\n\n<p>For us, emotive design is not some afterthought.  It is a core part of our strategy.</p>\n\n<p>CREATE MASSIVE IMPACT </p>\n\n<p>We're not solving a small problem, and we're not addressing a small market. We're going after email; the one activity that consumes more of our work day than any other.</p>\n\n<p>Our ambition doesn't stop there. Next: calendars, notes, contacts, tasks. We are building the productivity platform of the future.</p>\n\n<p>At Superhuman, you will have massive impact: you will define product strategy, and translate big ideas into experiences that delight. You will create gorgeous products that millions of people use for hours every single day.  </p>\n\n<p>DO THE BEST WORK OF YOUR LIFE </p>\n\n<p>As a fullstack engineer, you will join as a core member of a seasoned 5-person team.</p>\n\n<p>We made products at Apple, Google, LinkedIn, Zynga, Flipboard, and Facebook. We founded Rapportive (acquired by LinkedIn), LiveRamp (acquired for $310M), and built pry (used by 25% of Ruby developers). Our investors include First Round Capital, Sam Altman, and the founders of Gmail, Stripe, AngelList, Intercom.</p>\n\n<p>This time, we're swinging for beyond the fences. We are building a household brand and a worldwide organization. We are here to do the best work of our lives, and we hope you are too.</p>\n\n<p>ROLE ‍‍</p>\n\n<ul>\n<li>Develop new products and features, improve existing products and features</li>\n<li>Become an expert in web app development</li>\n<li>Expand your development experience across the stack and to other platforms</li>\n<li>Contribute in the product process: thinking through UX, designing beautify UI, and working with - customers to solve their problems</li>\n<li>Develop and utilize your skills as a mentor and leader</li>\n<li>Help estimate, plan and execute on projects, features, and integrations</li>\n<li>Champion code quality, new technologies, and architectural design within the company</li>\n<li>Technologies we use: React, Golang, Postgres, Electron, Google Cloud</li>\n</ul><p>SOUND LIKE YOU? </p>\n\n<ul>\n<li>Experience: You are a proficient engineer with a well rounded software engineering background\nYou have 3+ years of professional full stack web development experience, working across the stack from the database to the UI\nYou have a deep understanding of browser Javascript (including the DOM and platform APIs)</li>\n<li>Product focused: You take pride in building elegant and beautiful product</li>\n<li>Problem solver: You excel at understanding and solving complex problems. You have astonishing attention to detail.</li>\n<li>Quality communicator: You can confidently break down tricky topics in writing and in person.</li>\n<li>Surprisingly efficient: You get a lot done quickly, and can translate your skills into new processes that your team will follow.</li>\n<li>Leadership: You will rapidly grow into a company leader. You will build company culture and help shape our future.</li>\n<li>Location: San Francisco Bay Area</li>\n</ul><p>BENEFITS </p>\n\n<ul>\n<li>Flexible vacation\n-Catered lunch (5x per week)</li>\n<li>$3k desk set up of your choice</li>\n<li>Full medical, dental, and vision insurance</li>\n<li>Paid parental leave</li>\n<li>401K</li>\n</ul><p>Superhuman is an equal opportunity employer: we value diversity. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.</p>",
    "how_to_apply": "<p>Please apply: <a href=\"https://grnh.se/ece028bb1\">here</a>. :)</p>",
    "company": "Superhuman",
    "company_url": "https://superhuman.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/bc8d6bd4-d4d9-11e8-85d5-12c0dcdbe11d.png",
    "url": "http://jobs.github.com/positions/e187e176-d4d9-11e8-89b9-2c50d9a12d58"
  },
  {
    "id": "b074b280-d61e-11e8-8192-cb6bb088ec42",
    "created_at": "Mon Oct 22 17:20:28 UTC 2018",
    "title": "Technical Product Lead",
    "location": "Remote",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>As a <strong>Technical Product Lead</strong> at Clevertech, you'll bring to life the true mastery of your craft while working alongside and leading a single-focused team of 3-7 dedicated developers with one mission in mind - creating world class, bespoke software solutions. Our most successful Tech Leads are the types of individuals that have a passion for leading the charge, but can't go a day without getting into the nitty gritty of the code.</p>\n\n<p>We’re looking for someone who is experienced in custom software development, has career successes under their belt, enjoys being a business analyst and now wants to apply all they’ve learned to the hard problems of today, while being 100% remote.</p>\n\n<p><strong>What you can expect from a Technical Product Lead role at Clevertech:</strong></p>\n\n<p>-Career advancement through the use of cutting edge technologies to build out major accomplishments.</p>\n\n<p>-Work alongside professional teams of experienced developers that invest energy into providing world-class solutions for ambitious clients.</p>\n\n<p>-A stress-free, ego-less workplace where amazing things get done every day, and everyone gives a damn.</p>\n\n<p>-Lead the charge on innovative, greenfield projects for products used at large scale.</p>\n\n<p>-Realistic timelines to dedicate to one project with high respect for flow.</p>\n\n<p>-Consistent support from a devoted DevOps team for cutting-edge cloud services.</p>\n\n<p><strong>REQUIREMENTS</strong></p>\n\n<p>-You’ve managed a team of 4-6 developers, BONUS for greenfield projects</p>\n\n<p>-You thrive in a lead role where hands-on development is KEY</p>\n\n<p>-You’re an experienced senior developer and can confidently approach challenges with your languages and tools of choice, whether it's Python, Java, Node.js, etc.</p>\n\n<p>-You’ve led client meetings to discover requirements and can confidently and respectfully manage client expectations</p>\n\n<p>-You can work in EST/PST - you can be located anywhere</p>\n\n<p>-You’re able to travel to USA for client meetings</p>\n\n<p><strong>BENEFITS</strong></p>\n\n<p><em>Own Your Time</em></p>\n\n<p>We are a completely remote team. That means we have a large amount of trust and a lot of flexibility. World travellers, young parents, nature lovers, and commute avoiders love working here. Manage your own desk successfully with Clevertech’s support resources - learn how to manage your time, organize your digital life, etc. We also will pay for a co-working space in case you feel like working outside of your normal setting. </p>\n\n<p><em>Recharge Time</em></p>\n\n<p>We insist that you take recharge time. This means, you’re required to take at least two weeks per year to refresh, plus you’ll have the day off for major holidays and that includes your birthday because your existence is worth celebrating!</p>\n\n<p><em>Care For Yourself</em></p>\n\n<p>You’ll receive a health/wellness monthly stipend that goes towards covering medical insurance, dental insurance, or joining a gym!</p>\n\n<p><em>Stability</em></p>\n\n<p>Kick that consulting/agency work stigma out the door! We’re looking for future Clevertech Brand Champions - a majority of our developers have been here for 4-7 years and we’re not looking to change this. When one project is finished, the next is close on the horizon, take the time in between to brush up on technologies with our corporate access logins, work on over 30 exciting open source projects, or take some time to relax and reward yourself for a job well done. Just because a project is done, does not mean you’re employment is done!</p>\n\n<p><em>Focused Work</em></p>\n\n<p>You will work together on a dedicated team with your eye on one finish line at a time. Our teams are nimble and agile, and cover the technical range you would expect from world class product delivery teams.</p>\n\n<p><em>Learn At Your Edges</em></p>\n\n<p>We believe in learning and provide unique programs that improve your tech skills, leadership skills and even challenge you in personal development. CleverWednesdays, guest speakers, leadership training, mentorship opportunities and in-depth industry exposure are all on offer here. And of course, if you speak at a tech conference, we cover all expenses.</p>\n\n<p><em>Clevertech Swag</em></p>\n\n<p>Keep your eye on the mail - we send out swag everywhere in the world and there are celebratory pictures of Clevertech socks, hoodies, and mugs all over Slack. Earn swag through providing support to your team, being one step ahead, working at a delightful speed, OWNING IT, and much more!\nWant to learn more about Clevertech and the team? </p>\n\n<p>Check out <a href=\"https://www.clevertech.biz/careers\">Clevertech Careers</a></p>\n\n<p><a href=\"https://youtu.be/z5daft3oGjM\">Clevertech Culture Video</a></p>",
    "how_to_apply": "<p>Please apply here -&gt; <a href=\"https://grnh.se/295d71782\">https://grnh.se/295d71782</a></p>",
    "company": "Clevertech",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/82a080a0-d61e-11e8-8a74-1a448047be6a.jpeg",
    "url": "http://jobs.github.com/positions/b074b280-d61e-11e8-8192-cb6bb088ec42"
  },
  {
    "id": "40ca8a98-a4bb-11e8-9a40-f75b414612e1",
    "created_at": "Mon Oct 22 16:33:37 UTC 2018",
    "title": "Senior Software Engineer",
    "location": "New York",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>We’re looking for great engineers with diverse backgrounds. We need people that can fill hybrid roles with different emphases on the wide context of product development. We don’t have predefined positions: instead, we invite you to come talk to us about your skills, experience, ambitions, and dream role.  We hope to find exceptional people to do exceptional work with us, and we believe it’s important that we define your role and path to our mutual growth together.</p>\n\n<p>Reaktor is a hybrid partner for all things future. We reimagine businesses, and we design and build tomorrow’s digital products. Our full range of consultancy and agency services include expertise from high-level business consulting, to hands-on service and product design and development, to branding and marketing.</p>\n\n<p>We believe in technology-agnostic product thinking, defined only by finding meaningful solutions to challenging problems. Your passion should be the same as ours: unmatched execution of those solutions. We structure, create, iterate, and reinvent, delivering tangible value faster than anyone in the world.</p>\n\n<p><strong>What we can offer you:</strong></p>\n\n<ul>\n<li>Hybrid, completely autonomous teams, filled with experts in everything from design, to data science, to business consulting, to content.</li>\n<li>A community of amazing people who you will learn from and will learn from you.</li>\n<li>Experimentation and continuous improvement of our skills and ways of working.</li>\n<li>A dedication to constant evolution (and the occasional revolution).</li>\n<li>A world without rigid hierarchy—big ideas can come from anyone and anywhere.</li>\n<li>Endless fun!</li>\n</ul><p><strong>What you’ll bring:</strong></p>\n\n<ul>\n<li>Exceptional technological competence.</li>\n<li>Ability to make things, and to make things happen.</li>\n<li>Compassion for people—both those around you, and those who will use what we build.</li>\n<li>Drive to work on complex problems at any part of the project, from type system nuances to organizational dynamics.</li>\n<li>A vision and commitment to the future of work: being truly lean and agile and human-centered, and leaving yesterday’s pointless rituals behind.</li>\n<li>Readiness to be responsible for your work, development, and career path. Don’t worry: we’ll have your back in whatever you want to achieve, but the end goal is yours to define.</li>\n<li>6+ years of real-world experience in building digital products and services.</li>\n<li>Authorization to work in the United States.</li>\n</ul><p>Think Reaktor sounds like home? Great. Introduce yourself via <a href=\"https://www.reaktor.com/careers/senior-software-engineer/?utm_source=Github&amp;utm_campaign=2018\">our careers page</a>.</p>\n\n<p>We invite you to share details of any open source projects, your GitHub profile, and most importantly, your personality. Be original, not official.</p>\n\n<p>We are an Equal Employment Opportunity (EEO) employer and do not discriminate on the basis of race, color, national origin, religion, gender, age, veteran status, political affiliation, sexual orientation, marital status or disability.</p>",
    "how_to_apply": "<p>Introduce yourself via <a href=\"https://www.reaktor.com/careers/senior-software-engineer/?utm_source=Github&amp;utm_campaign=2018\">our careers page</a></p>",
    "company": "Reaktor",
    "company_url": "http://reaktor.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/17cc4636-a4bb-11e8-8d04-d939382b1feb.png",
    "url": "http://jobs.github.com/positions/40ca8a98-a4bb-11e8-9a40-f75b414612e1"
  },
  {
    "id": "344c3696-d615-11e8-8a8f-c5721159ad4c",
    "created_at": "Mon Oct 22 16:12:19 UTC 2018",
    "title": "Sr. Software Developer",
    "location": "Des Moines, IA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>WHY PILLAR? WHY NOT?</p>\n\n<p>Pillar Technology is a high-tech consulting company taking marketing and strategy by the horns, with an unmatched company culture. Inspired by the inventions of the future, we fuse software craftsmanship, creativity and innovation together to solve our clients’ most challenging problems. And the driving force behind it all? Our people—the Pillar family.</p>\n\n<p>SOFTWARE ARTISAN, WHAT?</p>\n\n<p>Our developers are called “artisans” because creating software not only requires technical knowledge, but also skilled artistry and craftsmanship. Our software artisans are successful because they have:</p>\n\n<p>Super solid skills in multiple object-oriented and/or front-end languages (Java, C#, .NET, Ruby, Angular, JavaScript, Ember, etc.) and a drive to hone their craft and develop new skills.\nPractice getting their hands dirty in Agile development practices including test-driven development (TDD), continuous integration and pair programming.\nSuperhero powers in consulting, collaboration and communication.\nExperience cranking out mobile applications and desktop solutions in true Agile environments.\nAn advanced understanding of object-oriented design and development principles including SOLID, DRY and CAT (OK, we made that last one up).</p>\n\n<p>ARE YOU A GAME CHANGER?</p>\n\n<p>Our mission is to provide an environment where people do what they love and feel empowered to influence change. Of course our open and flexible workspaces, fully-stocked fridge and pantry help create a thriving work ecosystem. But we also support this goal in ways that can’t be contained within four walls—so whether you are working at a client site or at home from your patio, the Forge mindset goes where you go.</p>\n\n<p>“No-constraints” thinking—we’re talking “change the world” kind of thinking.\nTeam members who push you to succeed, because they expect you to do the same for them.\nDiverse and changing work environments.\nLearning, sharing and working closely with other team members because we take the “two heads are better than one” saying very seriously.\nA “Speed2Value” approach to solving problems and delivering value.\nOpen communication across the company—direct, expert and personal.\nActive participation in Agile and software craftsmanship communities and we hope you do the same!\nHaving a direct impact on projects by commuting across Southeast Michigan to work personally with clients, teams, community groups and candidates.</p>\n\n<p>PERKS OF THE JOB.</p>\n\n<p>So what’s in it for you, right? On top of “Creative Collision” lunches served up every Friday, we provide our team members with a dynamic and supportive environment that promotes a healthy work-life balance.</p>\n\n<p>Competitive compensation package including salary, medical, dental, vision, short and long-term disability, and life insurance.\nPTO to do literally whatever you want, and holidays off to spend with whoever you want.\n401K with match, because we care about your future beyond Pillar.\nA flexible and customizable career growth path.\nFamily is family—that’s why it’s important to us to offer adoption assistance, reimbursement of infertility treatment-related expenses, and maternity and paternity leave.\nKnowledge is power, so we’ll drop $500 a year for you to spend on continuous learning (conferences, books, workshops, etc.).\nOne word—PillarCon—a weekend filled with fun and learning for Pillarites, their families and guests.\nFlexible work environment, because we know things just come up sometimes.</p>\n\n<p>LIKE WHAT YOU SEE?\nNow that you’ve got the goods on being a part of the Pillar family, we just have one question: Are you ready to unleash your potential? If so, let’s chat. Go ahead and click the “apply” button. Tell us a bit about yourself and one of our Talent Engagement Specialists will be in touch.</p>\n\n<p>For more info, check out our website, come to an event at the Forge or reach out and start a conversation with us. We’d love to talk!</p>\n\n<p>Pillar Technology is an Equal Opportunity Employer (EOE). We strongly support diversity in the workplace.</p>",
    "how_to_apply": "<p><a href=\"https://pillartechnology.com/opportunities/15E8E0C853\">https://pillartechnology.com/opportunities/15E8E0C853</a></p>",
    "company": "Pillar Technology",
    "company_url": "http://pillartechnology.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/344c3696-d615-11e8-8a8f-c5721159ad4c"
  },
  {
    "id": "03617820-d615-11e8-9a63-1d47919dbf84",
    "created_at": "Mon Oct 22 16:11:12 UTC 2018",
    "title": "Sr. Software Developer",
    "location": "Ann Arbor MI ",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>WHY PILLAR? WHY NOT?</p>\n\n<p>Pillar Technology is a high-tech consulting company taking marketing and strategy by the horns, with an unmatched company culture. Inspired by the inventions of the future, we fuse software craftsmanship, creativity and innovation together to solve our clients’ most challenging problems. And the driving force behind it all? Our people—the Pillar family.</p>\n\n<p>SOFTWARE ARTISAN, WHAT?</p>\n\n<p>Our developers are called “artisans” because creating software not only requires technical knowledge, but also skilled artistry and craftsmanship. Our software artisans are successful because they have:</p>\n\n<p>Super solid skills in multiple object-oriented and/or front-end languages (Java, C#, .NET, Ruby, Angular, JavaScript, Ember, etc.) and a drive to hone their craft and develop new skills.\nPractice getting their hands dirty in Agile development practices including test-driven development (TDD), continuous integration and pair programming.\nSuperhero powers in consulting, collaboration and communication.\nExperience cranking out mobile applications and desktop solutions in true Agile environments.\nAn advanced understanding of object-oriented design and development principles including SOLID, DRY and CAT (OK, we made that last one up).</p>\n\n<p>ARE YOU A GAME CHANGER?</p>\n\n<p>Our mission is to provide an environment where people do what they love and feel empowered to influence change. Of course our open and flexible workspaces, fully-stocked fridge and pantry help create a thriving work ecosystem. But we also support this goal in ways that can’t be contained within four walls—so whether you are working at a client site or at home from your patio, the Forge mindset goes where you go.</p>\n\n<p>“No-constraints” thinking—we’re talking “change the world” kind of thinking.\nTeam members who push you to succeed, because they expect you to do the same for them.\nDiverse and changing work environments.\nLearning, sharing and working closely with other team members because we take the “two heads are better than one” saying very seriously.\nA “Speed2Value” approach to solving problems and delivering value.\nOpen communication across the company—direct, expert and personal.\nActive participation in Agile and software craftsmanship communities and we hope you do the same!\nHaving a direct impact on projects by commuting across Southeast Michigan to work personally with clients, teams, community groups and candidates.</p>\n\n<p>PERKS OF THE JOB.</p>\n\n<p>So what’s in it for you, right? On top of “Creative Collision” lunches served up every Friday, we provide our team members with a dynamic and supportive environment that promotes a healthy work-life balance.</p>\n\n<p>Competitive compensation package including salary, medical, dental, vision, short and long-term disability, and life insurance.\nPTO to do literally whatever you want, and holidays off to spend with whoever you want.\n401K with match, because we care about your future beyond Pillar.\nA flexible and customizable career growth path.\nFamily is family—that’s why it’s important to us to offer adoption assistance, reimbursement of infertility treatment-related expenses, and maternity and paternity leave.\nKnowledge is power, so we’ll drop $500 a year for you to spend on continuous learning (conferences, books, workshops, etc.).\nOne word—PillarCon—a weekend filled with fun and learning for Pillarites, their families and guests.\nFlexible work environment, because we know things just come up sometimes.</p>\n\n<p>LIKE WHAT YOU SEE?</p>\n\n<p>Now that you’ve got the goods on being a part of the Pillar family, we just have one question: Are you ready to unleash your potential? If so, let’s chat. Go ahead and click the “apply” button. Tell us a bit about yourself and one of our Talent Engagement Specialists will be in touch.</p>\n\n<p>For more info, check out our website, come to an event at the Forge or reach out and start a conversation with us. We’d love to talk!</p>\n\n<p>Pillar Technology is an Equal Opportunity Employer (EOE). We strongly support diversity in the workplace.</p>",
    "how_to_apply": "<p><a href=\"https://pillartechnology.com/opportunities/690EE96AD6\">https://pillartechnology.com/opportunities/690EE96AD6</a></p>",
    "company": "Pillar Technology",
    "company_url": "http://pillartechnology.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/03617820-d615-11e8-9a63-1d47919dbf84"
  },
  {
    "id": "9c5547d8-d614-11e8-9416-2a9877150ccb",
    "created_at": "Mon Oct 22 16:08:23 UTC 2018",
    "title": "Sr. Software Developer",
    "location": "Columbus, OH ",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>WHY PILLAR? WHY NOT?</p>\n\n<p>Pillar Technology is a high-tech consulting company taking marketing and strategy by the horns, with an unmatched company culture. Inspired by the inventions of the future, we fuse software craftsmanship, creativity and innovation together to solve our clients’ most challenging problems. And the driving force behind it all? Our people—the Pillar family.</p>\n\n<p>SOFTWARE ARTISAN, WHAT?</p>\n\n<p>Our developers are called “artisans” because creating software not only requires technical knowledge, but also skilled artistry and craftsmanship. Our software artisans are successful because they have:</p>\n\n<p>Super solid skills in multiple object-oriented and/or front-end languages (Java, C#, .NET, Ruby, Angular, JavaScript, Ember, etc.) and a drive to hone their craft and develop new skills.\nPractice getting their hands dirty in Agile development practices including test-driven development (TDD), continuous integration and pair programming.\nSuperhero powers in consulting, collaboration and communication.\nExperience cranking out mobile applications and desktop solutions in true Agile environments.\nAn advanced understanding of object-oriented design and development principles including SOLID, DRY and CAT (OK, we made that last one up).</p>\n\n<p>ARE YOU A GAME CHANGER?</p>\n\n<p>Our mission is to provide an environment where people do what they love and feel empowered to influence change. Of course our open and flexible workspaces, fully-stocked fridge and pantry help create a thriving work ecosystem. But we also support this goal in ways that can’t be contained within four walls—so whether you are working at a client site or at home from your patio, the Forge mindset goes where you go.</p>\n\n<p>“No-constraints” thinking—we’re talking “change the world” kind of thinking.\nTeam members who push you to succeed, because they expect you to do the same for them.\nDiverse and changing work environments.\nLearning, sharing and working closely with other team members because we take the “two heads are better than one” saying very seriously.\nA “Speed2Value” approach to solving problems and delivering value.\nOpen communication across the company—direct, expert and personal.\nActive participation in Agile and software craftsmanship communities and we hope you do the same!\nHaving a direct impact on projects by commuting across Southeast Michigan to work personally with clients, teams, community groups and candidates.</p>\n\n<p>PERKS OF THE JOB.</p>\n\n<p>So what’s in it for you, right? On top of “Creative Collision” lunches served up every Friday, we provide our team members with a dynamic and supportive environment that promotes a healthy work-life balance.</p>\n\n<p>Competitive compensation package including salary, medical, dental, vision, short and long-term disability, and life insurance.\nPTO to do literally whatever you want, and holidays off to spend with whoever you want.\n401K with match, because we care about your future beyond Pillar.\nA flexible and customizable career growth path.\nFamily is family—that’s why it’s important to us to offer adoption assistance, reimbursement of infertility treatment-related expenses, and maternity and paternity leave.\nKnowledge is power, so we’ll drop $500 a year for you to spend on continuous learning (conferences, books, workshops, etc.).\nOne word—PillarCon—a weekend filled with fun and learning for Pillarites, their families and guests.\nFlexible work environment, because we know things just come up sometimes.</p>\n\n<p>LIKE WHAT YOU SEE?\nNow that you’ve got the goods on being a part of the Pillar family, we just have one question: Are you ready to unleash your potential? If so, let’s chat. Go ahead and click the “apply” button. Tell us a bit about yourself and one of our Talent Engagement Specialists will be in touch.</p>\n\n<p>For more info, check out our website, come to an event at the Forge or reach out and start a conversation with us. We’d love to talk!</p>\n\n<p>Pillar Technology is an Equal Opportunity Employer (EOE). We strongly support diversity in the workplace.</p>",
    "how_to_apply": "<p><a href=\"https://pillartechnology.com/opportunities/88FB1C755E\">https://pillartechnology.com/opportunities/88FB1C755E</a></p>",
    "company": "Pillar Technology",
    "company_url": "http://pillartechnology.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/9c5547d8-d614-11e8-9416-2a9877150ccb"
  },
  {
    "id": "df5b47be-d612-11e8-88f4-50633736745c",
    "created_at": "Mon Oct 22 15:56:13 UTC 2018",
    "title": "Technology Team Lead, Design Agency for Social Impact",
    "location": "New York City",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>Constructive (<a href=\"https://constructive.co\">https://constructive.co</a>), a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to take over for our current Technology Team Lead, who will sadly be transitioning out of the role at the end of 2018 to live abroad.</p>\n\n<p>If you’re an experienced technologist who wants to work on websites and products that are at the front of the field, knows how to architect and build complex websites, thrives on being a consultative, collaborative problem solver, and believes that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. If you care deeply about issues like climate change, social justice, and economic equality—and want the work you do to make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n\n<h2>A bit about the role</h2>\n\n<p>Our Technology Team Lead needs a holistic understanding of modern web development techniques and infrastructure. They need experience building strong and scalable websites. They must thrive on being hands-on with development projects. They’ll need a leadership mindset, and must be capable of working on multi-disciplinary teams to communicate complex technological choices to non-developers.</p>\n\n<p>That’s all fancy job-posting language for: you really know your stuff and don’t have a big ego, you take responsibility for the quality of our work and the growth of your team, you still like to get your hands dirty with code, and you’re an effective collaborator—especially with people who don’t understand technology as well as you do.</p>\n\n<h2>A bit about us</h2>\n\n<p>We’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got each other’s backs. We’ve got high expectations and we’ve got the work ethic to match them. We’re all together in the same open office, so there’s music and joking mixed-in with being heads-down on work.</p>\n\n<h2>A bit about diversity</h2>\n\n<p>We believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant—and if you meet those and add to our diversity, all the better.</p>\n\n<h2>What we need you to do extremely well</h2>\n\n<p>This role combines technology team leadership and hands-on development, emphasizing one or the other at any given time. We’ll need you to have strong demonstrated success having done all or most of these things for at least 3-5 years—and a passion for doing them well. </p>\n\n<ul>\n<li>\n<strong>Provide strong technical leadership</strong>—both for our internal team of developers, strategists, and designers; and for our clients and occasional external dev partners.\nManage and mentor junior developers—two in-house developers, one ongoing external partner, and any additional developers when project load requires it.<br>\n</li>\n<li>\n<strong>Guide development team</strong> and our company on planning, prioritizing, mitigating risks, and balancing technical debt to meet project milestones so that we deliver exceptional work that meets expectations.</li>\n<li>\n<strong>Work with stakeholders to define strategic goals</strong> and the context in which they need to be met, gather requirements, and produce technical documentation that makes it very clear how technology will help achieve them.</li>\n<li>\n<strong>Develop requirements, specifications, and architecture</strong> to document what we’re building and what’s been built.</li>\n<li>\n<strong>Lead development of ambitious digital products,</strong> serving as the point person for both the end-to-end process and the outcomes we deliver, aligning our work with Constructive’s broader strategic position as a leading brand experience design firm.</li>\n<li>\n<strong>Be a hands-on developer</strong> who takes on specific aspects of complex jobs or plays a lead developer role on a project when needed. </li>\n<li>\n<strong>Review code and provide feedback</strong> on work done by other developers; oversee the UAT and QA processes in coordination with project managers.</li>\n<li>\n<strong>Improve best practices, recommend tools, and build frameworks</strong> that make our work more efficient, effective, and technically front-of field.</li>\n<li>\n<strong>Be the face of Constructive’s technical expertise</strong> throughout client engagements, in the development community, and when needed in our sales cycle.</li>\n<li>\n<strong>Contribute to developing proposals and estimates</strong> for technical projects, particularly those with complex requirements.</li>\n<li>\n<strong>Lead vetting and hiring of web developers</strong> and external development partners.</li>\n<li>\n<strong>Be a team player</strong> who knows how to lead, has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out. </li>\n<li><strong>It definitely helps if you also have a good sense of humor</strong></li>\n</ul><h2>Expertise that’s important in our work</h2>\n\n<p>Right now, these are the specific technologies and tasks that are essential to our work. We’ll need you to have about 5 years of experience in most of these things, and we’re very open to new ideas on which specific technologies and tools can improve on what we have.</p>\n\n<ul>\n<li>Expert Wordpress &amp; Drupal development (Minimum 5 years of experience)</li>\n<li>Expert front-end development experience</li>\n<li>Strong experience with Webpack / Gulp / SCSS </li>\n<li>Strong experience doing large-scale content migrations</li>\n<li>Strong experience doing third-party integrations (Solr, Salesforce, Mailchimp, Fluxx)</li>\n<li>Experience with Data Visualization (D3, Highcharts)</li>\n<li>Experience with Infrastructure, System Administration &amp; DevOps</li>\n<li>Experience with ES6, Node, React</li>\n<li>Comfortable with AWS (S3, Route 53)</li>\n</ul><h2>What’s in it for you?</h2>\n\n<p>Work/Life balance matters at Constructive, and we do our best to make sure everyone is well-taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success with bonuses. We expect this position to be in the $100-$130K range plus annual bonuses. Here’s what we have on tap for 2018-2019 to add to this:</p>\n\n<h2>Benefits &amp; Perks</h2>\n\n<ul>\n<li>Company-Sponsored Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus (Approx 10% of company profit distributed equally)</li>\n<li>Discretionary performance-based bonuses</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year’s</li>\n<li>1/2-day Summer Fridays (Approx 16)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly &amp; Annual employee-voted \"shout-out\" gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place</li>\n</ul>",
    "how_to_apply": "<p><strong>Interested? Great! Then please send an email to titled “Technology Team Lead” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong></p>\n\n<ul>\n<li>• A resume</li>\n<li>• A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>• Links to your own website, websites you’ve worked on, github, whatever</li>\n<li>• Desired salary (freelance rate for those interested in consulting with us)</li>\n</ul>",
    "company": "Constructive",
    "company_url": "http://www.constructive.co",
    "company_logo": "http://github-jobs.s3.amazonaws.com/7c7a1634-d612-11e8-90b5-33073882d8e0.png",
    "url": "http://jobs.github.com/positions/df5b47be-d612-11e8-88f4-50633736745c"
  },
  {
    "id": "e46aaaf0-d60e-11e8-81c9-f8b1893678c9",
    "created_at": "Mon Oct 22 15:26:48 UTC 2018",
    "title": "Podcasts Server Engineer, Apple Media Products",
    "location": "San Francisco, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The podcast server engineering team is looking for a new member passionate about making Apple Podcasts its very best. Our goal is to support listening, discovery, and the growth of podcasts as a medium.\n </p>\n\n<p>Key Qualifications: </p>\n\n<ul>\n<li>Practical background in server software engineering and distributed systems</li>\n<li>Proven track record delivering production software</li>\n<li>Fluency in Java, Python, or Ruby</li>\n<li>Takes initiative, tinkering mindset, phenomenal teammate, creative in solving problems\n•Effective interpersonal skills with people from diverse technical backgrounds</li>\n</ul><p>Description:\nAs part of our team, you’ll work with software engineering teams throughout Apple to make Podcasts a truly cross-platform experience. You will propose architecture, follow through with implementation, and iterate in response to feedback. The services you make will generate directly impact Apple Podcasts listeners. This is a hands-on work environment where you are self-motivated, proficient with a wide range of technologies, and support several projects concurrently.\n </p>\n\n<p>Education:\nB.S. in Computer Science, Computer Engineering, or relevant work experience.</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 114359798\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=59f706b260d6d3cb103bdea01c37a5c0\">https://ars2.equest.com/?response_id=59f706b260d6d3cb103bdea01c37a5c0</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/810f66da-d60e-11e8-930e-d37f60e00fff.jpeg",
    "url": "http://jobs.github.com/positions/e46aaaf0-d60e-11e8-81c9-f8b1893678c9"
  },
  {
    "id": "e220f39e-d60e-11e8-87ff-5ea77c7e1742",
    "created_at": "Mon Oct 22 15:26:44 UTC 2018",
    "title": "iCloud - Solutions Engineer -Software Engineering",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>Imagine what you could do here. At Apple, new ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish.</p>\n\n<p>Key Qualifications: </p>\n\n<ul>\n<li>Experience designing, delivering and supporting solutions using cloud services</li>\n<li>Excellent analytical and problem solving skills</li>\n<li>Excellent written and interpersonal skills</li>\n<li>Aptitude to independently learn new technologies.</li>\n<li>Be able to drive a project from a simple idea to an implementation</li>\n<li>Be a leader who possesses both strong programming skills and a creative, user-focused mindset</li>\n<li>Ability to thrive in a multi-functional team on high profile, critical projects</li>\n<li>Preferred Experience:</li>\n<li>Java, Javascript, Swift, Objective-C</li>\n<li>Experience with SQL and NoSQL database technologies</li>\n</ul><p>Description:\nConsider joining a small team guiding the use of iCloud across some of the most exciting Apple products and features. We are looking for a talented individual with a strong engineering background who has a history of delivering technical solutions. In this highly visible position, you will collaborate with multi-functional engineering teams to define and deliver features using iCloud's high-performance, scalable and extensible systems. Do you love the challenge of solving complex problems that can have a direct impact on the success of the company? Then we have the job for you! We promote innovation and new technology to further improve our creative output. We're looking for passionate person to join this amazing team. If you feel this is you, we'd love to hear from you.</p>\n\n<p>Education:\nBachelor's degree in computer science or equivalent</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 114207178\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=cd59d4a618d5bbde78fbb0a7241352f4\">https://ars2.equest.com/?response_id=cd59d4a618d5bbde78fbb0a7241352f4</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d892e30a-d60e-11e8-8f4c-1bad9b637be7.jpeg",
    "url": "http://jobs.github.com/positions/e220f39e-d60e-11e8-87ff-5ea77c7e1742"
  },
  {
    "id": "daf8765a-d60e-11e8-97c4-999c50ec0568",
    "created_at": "Mon Oct 22 15:26:32 UTC 2018",
    "title": "Siri - Senior Data Infrastructure Engineer",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>As a member of the Data Infrastructure Engineering team within the Siri Production Engineering organization, you will be faced with highly complex issues in a large scale, distributed system environment. In order to ensure a reliable and rewarding Siri experience, you will be empowered to develop and design new solutions heavily focused on data infrastructure and DevOps style system automation. We look for talented engineers with a passion for data in both the Operations and Development space to bring these unique solutions to production at a rapid pace. From an Operations perspective, this makes us the most successful personal assistant in the industry.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>In depth understanding of Big Data technologies (Hadoop, Hbase, Spark, Kafka, Flume, Hive, HDFS, etc)</li>\n<li>Solid experience in large scale production data and systems environments</li>\n<li>Experience in one or more object-oriented programming languages (Scala, Java, C++)</li>\n<li>Fluent in at least one scripting or systems programming language (Python, Ruby, Bash, Go, Rust, Crystal etc.)</li>\n<li>Knowledge of the Linux operating system (OS, networking, process level)</li>\n<li>Interest in DevOps style engineering teams - we operate what we build!</li>\n<li>Strong verbal and written communication skills</li>\n<li>Passionate about data and in being a part of a tight-knit Data Infrastructure Engineering team</li>\n</ul><p>Description:\nThe Siri Data Infrastructure Engineering team manages data ingestion and the data storage platform used for analytics and machine learning of worldwide Siri events. Using internally built systems platforms, open source data platform tools, and purpose built solutions developed by our own team, the Data Infrastructure Engineering team members strive to build out a performant and scalable data platform at huge scale with high quality data that can be operated at by our relatively small team. To accomplish this, we build operations focused automation tools and services to prevent failures and page individuals when there really is a problem, not just noise.</p>\n\n<p>Our engineers not only work closely within the Siri Production Engineering team, but also with the development and analytics engineers within Siri as well as outside organizations. We build out data platform infrastructure for maximum efficiency, scalability and reliability to allow domain specific data scientists and machine learning engineers to focus on their specialties. A successful candidate will be someone who can actively take part in the design, build, and operation of our data and systems infrastructure.</p>\n\n<p>As a member of the Siri Production Engineering Team within Apple you will:</p>\n\n<ul>\n<li>Build and Operate Apple’s largest data infrastructure supporting millions of Siri customers at double digit PB scale</li>\n<li>Work with open source technologies such as Spark, Kafka, Presto, Hbase, and Hadoop in building out our data platform</li>\n<li>Develop data platform services that enhance how we operate our data platform, store our data securely, ensure data privacy, and enhance ease of use for everyone that makes use of our data</li>\n<li>Ensure our systems and data platform offers reliable high quality data with consistent SLAs</li>\n<li>Design and engineer scalable streaming data solutions that analytic engineering teams can build metric platforms on top of</li>\n<li>Make use of Anomaly Detection and Machine Learning to enhance the operation and understanding of our data from an operational perspective</li>\n<li>Troubleshoot complex issues across the entire stack</li>\n<li>Create automation frameworks to handle both development and production events at scale</li>\n<li>Advise other teams (within and outside of Siri) on technical direction</li>\n<li>Help grow our data environment with the purpose of pushing Siri to the next level of scale and stability\n </li>\n</ul><p>Education:\nBS,MS, or PhD degree in Computer Science, EE, Physics, or other technical discipline and 5+ years of building data pipelines experience</p>\n\n<p>Additional Requirements:  </p>\n\n<ul>\n<li>Strong Scala and/or Java expertise with JVM performance tuning/optimization</li>\n<li>Experience with Kubernetes or Mesos compute platforms</li>\n<li>Workflow and data pipeline orchestration experience (Oozie, Airflow, Pinball, Jenkins, Luigi, etc.)</li>\n<li>In depth experience with resource managers such as Yarn and Marathon</li>\n<li>Experience with Microservices oriented systems and framework development</li>\n<li>Strong statistics and/or machine learning knowledge</li>\n<li>Open source code involvement such as taking part as an Apache PMC and/or Committer</li>\n</ul><p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 114348577\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=20e2e0b140b78f5192aa59ccd4e5a219\">https://ars2.equest.com/?response_id=20e2e0b140b78f5192aa59ccd4e5a219</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/ad95cd48-d60e-11e8-8c6e-fe303a14372a.jpeg",
    "url": "http://jobs.github.com/positions/daf8765a-d60e-11e8-97c4-999c50ec0568"
  },
  {
    "id": "da8ad94e-d5f8-11e8-8225-f199d46197fd",
    "created_at": "Mon Oct 22 12:49:21 UTC 2018",
    "title": "Senior Software Entwickler Java (m/w/d)",
    "location": "München",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><b>Lust auf Veränderung?<br></b></p>\n\n<p><b>Du bist ein Java-Profi und hast Lust Teil unseres Teams zu werden? Du bist neugierig, aufgeschlossen und bringst gerne Deine eigenen Ideen ein? Dann freuen wir uns auf Deine Bewerbung!<br></b></p>\n\n<p><b>(Senior) Softwareentwickler Java (m/w/d)</b> <br>\nfür unsere Kundenprojekte in Köln, München, Nürnberg, Düsseldorf und Hannover<br></p>\n\n<p><b>Das sind wir: </b><br></p>\n\n<p>• <b>Branche:</b> Softwareentwicklung für namhafte Versicherungen<br>\n• <b>Unsere Produkte:</b> Kernversicherungssysteme, mobile Anwendungen und Individuallösungen<br>\n• <b>Unser Motto:</b> Endlich mal mit Profis arbeiten!<br>\n• <b>Kollegen:</b> insgesamt 140 in München, Köln und Wien<br>\n• <b>Unsere Arbeitswelt:</b> Implementierung unserer Lösungen beim Kunden und Inhouse-Produktentwicklung<br></p>\n\n<p><b>Das bieten wir Dir: </b><br></p>\n\n<p>• Arbeitsfelder in eigener Verantwortung<br>\n• Eigenverantwortliches Handeln und aktive Mitgestaltung<br>\n• Offenes und ehrliches Miteinander<br>\n• Freiraum für individuelle Weiterbildung (In- und externe Schulungen,Forschungsprojekte, Konferenzteilnahmen)<br>\n• Zahlreiche Zusatzleistungen (Firmenwagen, -fahrrad, Kinderbetreuung, Sport AG)<br>\n• Flexible Arbeitszeitmodelle<br>\n• Zahlreiche Firmenevents für den fachlichen Austausch und die Stärkung unserer Firmenkultur<br></p>\n\n<p><b>Deine Aufgaben:</b><br></p>\n\n<p>• Funktionale Softwareentwicklung mit Java SE/EE, Scala und Kotlin<br>\n• Web-Anwendungen mit Vaadin/linkki oder Angular<br>\n• Aufnahme und Analyse von Kundenanforderungen<br>\n• Unterstützung unserer Kunden bei der Einführung unserer Software<br>\n• Sicherstellung höchster Code-Qualität durch testgetriebene Softwareentwicklung, Continous Integration und Delivery<br>\n• Kontinuierliche Verbesserung der Entwicklung durch neue Konzepte, Werkzeuge und Sprachen<br>\n• Arbeit in agilen &amp; klassischen Projekten<br>\n• Ausbildung und Betreuung unserer Junior Softwareentwickler als Mentor<br></p>\n\n<p><b>Das bringst Du mit: </b><br></p>\n\n<p>• Sehr gute Java-Kenntnisse ((Java 8 ff., JEE 7)<br>\n• Spaß an Teamarbeit und am Umgang mit Kunden<br>\n• Leidenschaft für Software Design und hohe Qualität<br>\n• Begeisterung für neue Themen<br>\n• Sichere Deutsch- und Englischkenntnisse<br></p>\n\n<p><b>Dein Ansprechpartner: </b><br>\nAndrea Hohenadl / Human Resources / <a href=\"mailto:Jobs@FaktorZehn.de\">Jobs@FaktorZehn.de</a> / 089 520 311 634<br></p>\n\n<p><b>Interessiert?</b><br>\nJetzt per Mail oder über das Bewerbungsformular bewerben.<br></p>\n\n<p><a href=\"https://faktorzehn.redirect.your-jobresponse.com/senior_software_entwickler_java_m_w_muenchen/233123/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a><br></p>\n\n<p><b>Faktor Zehn GmbH | Friedenheimer Brücke 21 | 80639 München | <a href=\"http://www.FaktorZehn.com\">www.FaktorZehn.com</a></b><br></p>",
    "how_to_apply": "<p><a href=\"https://faktorzehn.redirect.your-jobresponse.com/senior_software_entwickler_java_m_w_muenchen/233123/V819/anwenden\">Klicken Sie hier um zum Bewerbungsformular zu gelangen!</a><br></p>",
    "company": "www.FaktorZehn.com",
    "company_url": "http://www.FaktorZehn.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/b43252d6-d5f8-11e8-940f-d4d1c88dff6f.jpg",
    "url": "http://jobs.github.com/positions/da8ad94e-d5f8-11e8-8225-f199d46197fd"
  },
  {
    "id": "95048694-1952-11e8-86d5-38e7f24d7ed9",
    "created_at": "Sun Oct 21 23:46:24 UTC 2018",
    "title": "SENIOR FULL-STACK DEV WITH RUBY/PYTHON/REACT -- 100% REMOTE, FLEXIBLE HOURS",
    "location": "Remote",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><strong>Job Description</strong></p>\n\n<p>Analytics Fire builds custom software for the solar power industry. We’re looking for a senior full-stack developer with a willingness to acquire deep expertise around Ruby, Python, and React.js, in order to help us expand to support additional new high-tech sectors.</p>\n\n<p>Analytics Fire is a small, distributed team working on a range of interesting projects. For example, last year we worked on a scalable IoT platform for utility grade solar power plants, a sales and design tool for residential solar, and a machine-learning powered autonomous cleaning robot. We’re looking for a fun, reliable, and highly collaborative, senior dev to join our team.\nFor reference, here is a list of technologies and tools we are currently actively using on a day-to-day basis:</p>\n\n<ul>\n<li>Front-end: JavaScript / React / Angular</li>\n<li>Back-end: Ruby / Python / Node.js</li>\n<li>Embedded (IoT): C, Embedded Linux, MQTT</li>\n<li>Embedded (robotics): C/C++, ROS</li>\n<li>Modern software techniques: RESTful APIs, SOA, PaaS, etc</li>\n<li>Agile collaboration and DevOps tools: Github, Trello, Slack, Chef, Ansible, Docker, Vagrant, etc</li>\n<li>Occasionally we need to do a small amount of work around: SFDC, iOS, Android, ARKit</li>\n</ul><p>This is a remote position. We’re flexible about location and hours, so long as your working hours are in a very heavily US-overlapping time zone (eg: North America, Central America, South America, etc). We’re a really great match for a senior dev in a US-overlapping timezone who wants to work hard on interesting projects, while also having flexibility around time and geography.</p>\n\n<p><strong>Skills &amp; Requirements</strong></p>\n\n<p>Ideally, you should have 5+ years commercial full stack development, ideally within a startup environment. You should be comfortable autonomously driving your own high quality / high velocity contributions using a range of technologies.</p>\n\n<p>We work with a variety of technologies, but are currently specifically looking for someone that has or can obtain expert level skills around Python, Ruby, and React.js.</p>\n\n<p><strong>About Analytics Fire</strong></p>\n\n<p>Analytics Fire was founded by a couple of data-nerds -- one a PHd in machine learning and the other a former VP of Engineering for an analytics platform -- who both are also serial entrepreneurs backed by prominent angels and VCs including Y Combinator and 500 Startups.</p>\n\n<p>“Our goal founding, Analytics Fire, was to create the engineering department that we always dreamed of working for. Our dream is to be able to spend our time working on interesting problems, while simultaneously having flexibility around time and geography and being part of a small, tightly-knit team of world-class engineers.”</p>",
    "how_to_apply": "<p>Please email your resume and cover letter to <a href=\"mailto:join-us@analyticsfire.com\">join-us@analyticsfire.com</a></p>",
    "company": "Analytics Fire",
    "company_url": "http://analyticsfire.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/17ab996c-1952-11e8-81e3-b60098bb6179.jpg",
    "url": "http://jobs.github.com/positions/95048694-1952-11e8-86d5-38e7f24d7ed9"
  },
  {
    "id": "c37e8b54-d555-11e8-8730-c2f34a443e55",
    "created_at": "Sun Oct 21 17:25:33 UTC 2018",
    "title": "Senior Full-Stack JS Engineer/Tech Lead with Node, React & TypeScript",
    "location": "Remote",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<h2>‼️ [Senior Full-Stack JS Engineer/Tech Lead with Node &amp; React needed!] ‼️</h2>\n\n<ul>\n<li>Full-time (40h a week)</li>\n<li>Location: remotely (3 - 4 weeks on-boarding in Oslo + regular flights later afterwards every ~ 1.5 - 2 months)</li>\n<li>$70 - $120 an hour</li>\n<li>Duration: 12+ months (permanent employment / long-term contract)</li>\n<li>Start: beginning of December 2018 (negotiable)</li>\n<li>1-month-long on-site visit in Oslo at the beginning of the project</li>\n<li>3-4 people with this profile are needed</li>\n</ul><p>Yet another time we search for extraordinary specialists to join our nerdy crew! :)</p>\n\n<p>Project for a big retail corporation in Norway (12k employees) with stores across entire Europe.</p>\n\n<p>You’ll be working closely with business people (including ex-McKinsey partner with 20 years of business experience; Harvard graduate), IT specialists (SE architects, DevOps, UI/UX people), marketing/sales department, Machine Learning/Artificial Intelligence professionals, QA, logistics department and product manager to design, prioritize, and build new IT products in fashion, retail/e-commerce sectors related to a digital transformation that is happening in the organization.</p>\n\n<p>One of the most important products that will need to be build is a new ecommerce platform (think: Zalando competitor) as well as information/data exchange platform for physical stores and IT tools for supply chain optimisation.</p>\n\n<p>The role is a fast-paced environment that involves above-average degree of tech &amp; business conceptual thinking, swiftness, communication &amp; people skills and ecommerce/retail understanding. Ideal candidate can present a work history for well-known brands, some startup world experience (we’re lean and move quickly), min 2 years of similar commercial experience on a similar position.</p>\n\n<p>If you are looking for an easy next project/job, or quick cash - there are better offers out there.</p>\n\n<p>Basic algorithmic experience and problem solving absolutely required - if you're strong in JS/React, but struggle at algo or data structures, don't bother applying. </p>\n\n<p>A rare, exciting opportunity to hone industry-related, practical business know-how, system design skills and work/network with top-notch world-class professionals (we already relocated people from the US and Canada for this project; people with Harvard and Google on their CVs).</p>\n\n<p>Initial tech stack (likely to be refined, but not totally changes):\n️- Front-End: JS, TypeScript, React, Vue, MobX.js, Redux, Web Assembly, Sharing components, PWA, Jest, Mocha, Karma\n️- Back-End: mainly - NodeJS and serverless, but also: GoLang, Python, grpc, RabbitMQ, Celery, Redis, Nginx*, HAProxy, Varnish HTTP cache\n️- DevOps: Kubernetes, Ansible, Docker, Prometheus, Grafana, ELK, Fluentd, Collectd, Terraform, Helm, New Relic, Sentry, secret management tools, InfluxDB, Telegraf, Swagger*\n️- FaaS: OpenFaas, Serverless, AWS Lambda*, Fission, Syncano</p>\n\n<p>The most important are: JS, TypeScript, React &amp; Node</p>\n\n<p>Requirements</p>\n\n<p>️- Previous involvement in building large IT product totally from scratch</p>\n\n<p>️- Wide-range of technologies that you're comfortable using (ideally covering majority of tools mentioned in this offer, and especially strong in JS environments including Node and React)</p>\n\n<p>️- Minimum 1 year of professional experience on commercial projects and similar position (tech lead / senior FE/JS engineer)</p>\n\n<p>️- Minimum 7 years of commercial, hands-on IT experience in total</p>\n\n<p>️- International experience</p>\n\n<p>️- Fluent English communication skills</p>\n\n<p>️- Being up to date with recent tech tools &amp; frameworks, extensive overall IT knowledge</p>\n\n<p>️- Willingness to spend the initial period in locally Oslo</p>\n\n<p>Big pluses:</p>\n\n<p>️- Studied Computer Science at a prestigious university - e.g. Harvard, Oxford, Cambridge, MIT, Stanford, Wharton, Berkeley (or top universities in your country)</p>\n\n<p>️- Worked or contracted to well-know brands and corporations e.g. Google, Palantir, Hedge Funds, Amazon, eBay, Microsoft, Goldman Sachs (joking, GS is actually a minus :)), Intel, Nvidia</p>\n\n<p>️- Work experience also from the fast-paced startup world</p>\n\n<p>️- Worked with a distributed/remote team before</p>\n\n<ul>\n<li><p>Excellent communication skills</p></li>\n<li><p>Business understanding / product skills</p></li>\n</ul><p>️- If you consider yourself a nerd :) and are passionate about the technology, that's a big plus</p>",
    "how_to_apply": "<p><a href=\"mailto:tomasz@potanski.pl\">tomasz@potanski.pl</a></p>",
    "company": "DevsData",
    "company_url": null,
    "company_logo": "http://github-jobs.s3.amazonaws.com/bd1e08ca-d555-11e8-8046-bbf075faedad.jpg",
    "url": "http://jobs.github.com/positions/c37e8b54-d555-11e8-8730-c2f34a443e55"
  },
  {
    "id": "02de4670-d422-11e8-9a23-1b89c17761cc",
    "created_at": "Sat Oct 20 04:38:52 UTC 2018",
    "title": "Senior Back-End Developer",
    "location": "Portland",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "description": "<p>Wieden+Kennedy is an independent, global creative company. We're here to do the best work of our lives with inspiring clients. We make work that influences culture and builds business value.</p>\n\n<p>We're looking for a back-end development expert to join our IT team. The right candidates is excited to work in a creative environment and will have a deep knowledge of development principles, industry trends, and emerging technologies.</p>\n\n<p>Expert-level knowledge of one or more system languages below, database architecture, and Unix operating systems is required. Experience working in a creative agency or comparable project-driven environment is a plus!</p>\n\n<p>Major Responsibilities/Primary Functions:</p>\n\n<ul>\n<li>Develop back-end solutions for agency-led executions in web, mobile, and emerging technology; Projects including but not limited to API development, custom content management, front-end integration, and similar types of builds.</li>\n<li>You'll lead the way on project architecture and database structure while utilizing best practices in performance, stability, scalability, and security</li>\n<li>Design and develop web applications that help automate and optimize the agency workflow</li>\n<li>Provide technical leadership and mentoring to the development team</li>\n<li>You'll be an integral partner between agency producers and client-based IT teams (when necessary), ensuring all productions meet client policy and security requirements</li>\n<li>Deliver well-tested, maintainable and efficient code</li>\n<li>Implement capacity and monitoring plans</li>\n<li>Integrate front-end user experience elements with server-side logic</li>\n<li>Occasionally you may even set up deployment servers, establishing effective code review and quality assurance processes</li>\n</ul><p>Qualifications, Distinguishing Characteristics and Special Requirements:</p>\n\n<ul>\n<li>A degree in CS or software engineering is highly desired</li>\n<li>Fluency in C#, C++, JAVA, Python, ASP.NET, SQL development</li>\n<li>8+ years of overall software engineering experience is strongly preferred, with ideally 7+ years of database development</li>\n<li>ADO.Net, AJAX, JQuery, JavaScript, Silverlight, XML, source control systems (VSS, Subversion, Git), SQL Server, Entity Framework</li>\n<li>A solid understanding of Object Oriented Design and Programming</li>\n<li>Understanding of SLDC’s, common development practices, Agile, Waterfall and Lean principles are a plus</li>\n<li>Experience creating and maintaining applications which have been released and ideally thrived in the real world</li>\n<li>Experience integrating 3rd party APIs/microservices and working with REST/JSON APIs</li>\n<li>Knowledge of web analytics (e.g. Omniture, WebTrends, Google Analytics)</li>\n<li>Ability to work on multiple projects and prioritize accordingly</li>\n<li>A strong track record of gaining trust and respect by consistently demonstrating sound strategic and analytical thinking skills, while maintaining composure in stressful situations</li>\n<li>Experience modifying and maintaining legacy codebases</li>\n<li>Experience managing Azure, AWS and GCP workloads</li>\n<li>Ability to keep your cool under pressure and excellent customer service skills, plus the ability to communicate effectively with clients at a variety of levels and across functions is key</li>\n<li>A proven track record of gaining trust and respect by consistently demonstrating sound critical thinking and maintaining composure in stressful situations</li>\n<li>And of course, someone highly organized with keen attention to detail, displays exceptional initiative, follow through and work ethic will fit right in!</li>\n</ul>",
    "how_to_apply": "<p>Directly apply here: <a href=\"https://bit.ly/2JNUv2k\">https://bit.ly/2JNUv2k</a></p>\n\n<p>We kindly request no headhunter or recruiter friends, please.</p>",
    "company": "Wieden + Kennedy",
    "company_url": "http://Wieden + Kennedy",
    "company_logo": "http://github-jobs.s3.amazonaws.com/a2b406ea-d421-11e8-9e20-4619bc38623d.png",
    "url": "http://jobs.github.com/positions/02de4670-d422-11e8-9a23-1b89c17761cc"
  },
  {
    "id": "9e7edf22-d3c8-11e8-8eac-c3c5b9846ed0",
    "created_at": "Fri Oct 19 17:59:16 UTC 2018",
    "title": "Senior Web Applications Developer - React/Redux",
    "location": "New York, New York",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "description": "<p>We are Adaptive, a growing and successful software company with a great reputation amongst staff and clients alike. We work closely with our financial clients to build bespoke software solutions to support their business goals. Our client's success relies on us making sound technical decisions, collaborating with stakeholders and being up to date with the latest technology and practices in the Fintech industry. </p>\n\n<p>This role is located in our NYC office. We do not offer remote work at this time</p>\n\n<p>As a web applications developer, you will:</p>\n\n<p>Build greenfield financial applications alongside your Adaptive colleagues\nUse the latest technology to create elegant and robust solutions\nContribute to building and releasing quality software on time\nUse your knowledge to build great-looking, event-driven and highly interactive interfaces\nCollaborate with server-side developers, user-experience designers and business analysts\nParticipate in a test-driven, agile environment\nKeep up to date with the developments in technology and quickly adapt to them to achieve better results\nRequired skills and experience:</p>\n\n<p>-Extensive client-side development experience, gained while building single-page web applications\n-Expertise in JavaScript: you understand prototypical inheritance, scope, and closures\n-Proficiency in user-interface technologies in addition to JavaScript, eg HTML5 and CSS3; and in React.js\n-Practical knowledge of web tooling such as Webpack, NPM, Yarn, Gulp and PostCSS\n-Understanding of ES6 and newer ES specifications\n-Proficient with Chrome developer tools, including knowing how to diagnose and fix performance issues\n-Experience of working on front office systems\n-Language: English (fluent)</p>\n\n<p>Desirable skills and experience:</p>\n\n<p>-Working with distributed teams\n-TypeScript, Rx.js, Redux\n-Event-driven APIs\n-Real time trading experience</p>\n\n<p>Personal qualities:</p>\n\n<p>-Strong desire to raise the bar for your team technically\n-Tenacious, curious, and collaborative in all aspects of your work\n-A quick learner with excellent communication skills</p>\n\n<p>About us:</p>\n\n<p>     No politics\n     No cumbersome hierarchy: our teams feel free to speak up, to make suggestions and raise concerns\n     Collaborative team environment: we all work together, respect each other and pitch in\n     Smart, welcoming and motivated colleagues\n     Good work/life balance and Friday beers</p>",
    "how_to_apply": "<p>Email resume to <a href=\"mailto:Mike.schoen@weareadaptive.com\">Mike.schoen@weareadaptive.com</a></p>",
    "company": "Adaptive Financial Consulting",
    "company_url": "http://Adaptive Financial Consulting",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9b6bd1b4-d3c8-11e8-816d-62eaba28ef13.png",
    "url": "http://jobs.github.com/positions/9e7edf22-d3c8-11e8-8eac-c3c5b9846ed0"
  },
  {
    "id": "cdf328e0-d3ae-11e8-8087-30824e5f99f7",
    "created_at": "Fri Oct 19 14:54:12 UTC 2018",
    "title": "DevOps Engineer",
    "location": "Rotterdam",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "description": "<p><i>You are a DevOps or System Engineer who can’t wait to be part of a growing team and to make actual impact. At VONQ we do cool stuff, like building a flagship product, tools and APIs that serve global customers. Are you ready to get your hands dirty in the design, implementation and testing of various infrastructure services that are used by our development teams? Apply at VONQ for DevOps Engineer in Rotterdam!</i><br></p>\n\n<p><b>DevOps Engineer</b><br><i>Rotterdam, fulltime, ASAP</i><br></p>\n\n<p><b>Be part of our journey and bring our development process, infrastructure and engineering practices to the next level</b><br>\nAs our System Engineer you will be the one leading critical platform development efforts. What you’ll actually be contributing to? Our core product, the Job Marketing Platform (JMP). It’s a data-driven application with a recommendation engine that is advising recruiters how they should reach their target audience online.<br></p>\n\n<p>We have an ambitious roadmap for the upcoming period. Your part in the process? We will start to utilise a number of various DevOps practices - and that’s where you come in!<br></p>\n\n<p><b>You will be part of an international and experienced Engineering department</b> consisting of Backend and Frontend Developers, Data Engineers, an Agile Coach and a CTO.<br></p>\n\n<p><b>Your day-to-day job in a nutshell as VONQ’s DevOps Engineer</b><br></p>\n\n<ul>\n<li>Make fully functional environments available on demand for the development team<br>\n</li>\n<li>Provide guidance and support on application architecture as we move to a container based architecture<br>\n</li>\n<li>Ensure a smooth flow of work for all of our development teams<br>\n</li>\n<li>Enable fast clear feedback for our development team (and the wider business) on application changes, by providing clear logging, metrics and supporting the team's automated testing infrastructure<br>\n</li>\n<li>You'll work autonomously to make our architectural and business goals a reality<br>\n</li>\n</ul><p><b>Great understanding of DevOps practices and an Agile mindset, that is you!</b><br><i>This describes the ideal candidate, but above all we value people that are eager to grow, autonomous, work together, and love to get things done! Furthermore we think you need:</i><br></p>\n\n<ul>\n<li>3+ years relevant experience<br>\n</li>\n<li>Excellent communication skills in English<br>\n</li>\n<li>Experience working in application development, systems or IT operations<br>\n</li>\n<li>Experience with Cloud and container technologies (e.g. AWS, docker, rocket)<br>\n</li>\n<li>Great understanding DevOps practices and why to use them (e.g. CI,CD, Infrastructure as code, automated testing)<br>\n</li>\n<li>You can develop an array of tools using various programming languages (e.g. Golang, Python, PHP, Scala)<br>\n</li>\n<li>Experience with at least some of our middleware and databases: NGINX, Elasticsearch, RabbitMQ, MySQL, Mongo<br>\n</li>\n<li>Experience in contributing to the systems architecture of a company<br>\n</li>\n</ul><p>Last but not least, you are not afraid to get your hands dirty on older infrastructure, to maintain it and migrate it to the new environment.<br></p>\n\n<p><b>Bonus points!</b><br></p>\n\n<ul>\n<li>Experience with application development (e.g. PHP, Scala, Ruby, Golang)<br>\n</li>\n<li>Experience with data engineering (e.g. spark, scala, databricks)<br>\n</li>\n<li>Worked as part of a distributed (or international) team<br>\n</li>\n</ul><p><b>This is why you should join our team</b><br>\nWe promise that at VONQ you’ll never stop learning! You’ll be surrounded by international and experienced colleagues, so prepare yourself for some interesting and intellectual conversations.<br>\nOur product has still a lot of potential to grow, and YOU can make impact on that. You’ll get freedom and space for own initiatives, in fact, we encourage you!<br></p>\n\n<p>We have legendary company outing, beers on Friday and lots of FUN!<br></p>\n\n<p><b>There is more! We offer:</b><br></p>\n\n<ul>\n<li>A good salary and 8% holiday allowance<br>\n</li>\n<li>100% commuting expenses compensation<br>\n</li>\n<li>Pension contribution<br>\n</li>\n<li>Flexible working hours<br>\n</li>\n<li>Unlimited (paid!) holidays<br>\n</li>\n<li>Time and budget for training<br>\n</li>\n<li>Relocation support, and more!<br>\n</li>\n</ul><p><b>Up for the challenge? Join VONQ as System Engineer and make things happen!</b> Apply by clicking on the application form. Questions? Contact Sarah (Recruiter) -&gt; sarahellithy(at)vonq.com.<br></p>\n\n<p><a href=\"https://vonq.redirect.your-jobresponse.com/devops_engineer_rotterdam/201779/V819/apply\">Click here for the application form!</a></p>",
    "how_to_apply": "<p><a href=\"https://vonq.redirect.your-jobresponse.com/devops_engineer_rotterdam/201779/V819/apply\">Click here for the application form!</a></p>",
    "company": "VONQ",
    "company_url": "http://www.vonq.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/cdf328e0-d3ae-11e8-8087-30824e5f99f7"
  },
  {
    "id": "cb51fa8a-d39a-11e8-862b-41328a80d959",
    "created_at": "Fri Oct 19 12:31:31 UTC 2018",
    "title": "Software Developer Payment",
    "location": "Hamburg",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "description": "<p>As <strong>Software Developer - Payment</strong>, you’ll play a key role in our agile and cross-functional development team. You will be a driving force behind the development of our financial systems like the in-house payment platform – the platform behind our great and continuously growing financial success. Through elegant and object-oriented concepts, you will deliver high available and secure solutions for a trouble-free payment process and an amazing user experience.</p>\n\n<p><strong>Your mission:</strong></p>\n\n<ul>\n<li>Autonomous conception and realization of new as well as the further development of existing features within our financial systems</li>\n<li>Integration of the financial systems into a wide range of internal and external systems</li>\n<li>Optimization and automation of the existing technical infrastructure</li>\n<li>Creatively co-shape our systems by contributing your own ideas</li>\n<li>Ensure high code quality through unit testing, pair programming and code reviews</li>\n<li>Managing cross-team cooperation with teams throughout the company (Marketing, Business Intelligence, Accounting, Analytics and of course with the game teams) to create a seamless, centralised purchase experience</li>\n</ul><p><strong>Your profile:</strong></p>\n\n<ul>\n<li>You have completed a Computer Sciences, Business Information Systems degree or have relevant experience</li>\n<li>You know the advantages and disadvantages of various architectures and have experience implementing them</li>\n<li>Successful realization of OOP projects, ideally in an agile environment</li>\n<li>Solid experience in using various methods to guarantee and improve code quality (Unit Testing, Design Patterns, Domain-driven Design, Code Reviews) </li>\n<li>You are proficient in SQL and have proven experience with databases and alternative data storage systems</li>\n<li>You have excellent communication skills and are willing to embrace our company culture and values</li>\n<li>You have excellent English language skills</li>\n</ul><p><strong>Why join us?</strong></p>\n\n<ul>\n<li>Shape the success story of InnoGames with a great team of driven experts in an international culture</li>\n<li>You’ll work in a multicultural Kanban-based team with daily stand ups and regular retrospectives – enabling you and your team to form and actively optimize your work processes</li>\n<li>Competitive compensation and an atmosphere to empower creative thinking and strong results</li>\n<li>Exceptional benefits ranging from flawless relocation support to company gym, smartphone or tablet of your own choice for personal use, roof terrace with BBQ and much more</li>\n</ul><p>Excited to start your journey with InnoGames and join our dynamic team as a <strong>Software Developer - Payment</strong>? We look forward to receiving your application as well as your salary expectations and earliest possible start date through our <a href=\"https://www.innogames.com/career/detail/job/software-developer-payment/?s=Github\">online application form</a>. <strong>Maximilian Kaeding</strong> would be happy to answer any questions you may have.</p>\n\n<p>InnoGames, based in Hamburg, is one of the leading developers and publishers of online games with more than 200 million registered players around the world. Currently, more than 400 people from 30 nations are working in the Hamburg-based headquarters. We have been characterized by dynamic growth ever since the company was founded in 2007. In order to further expand our success and to realize new projects, we are constantly looking for young talents, experienced professionals, and creative thinkers.</p>",
    "how_to_apply": "<p><a href=\"https://www.innogames.com/career/detail/job/software-developer-payment/?s=Github\">online application form</a></p>",
    "company": "InnoGames GmbH",
    "company_url": "https://www.innogames.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/c76ca4ba-d39a-11e8-9b20-727993e78707.png",
    "url": "http://jobs.github.com/positions/cb51fa8a-d39a-11e8-862b-41328a80d959"
  },
  {
    "id": "924c96ee-d356-11e8-9a27-32322f326b43",
    "created_at": "Fri Oct 19 04:22:39 UTC 2018",
    "title": "Senior php Developer",
    "location": "Brisbane",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "keywords": "php",
    "description": "<p><strong>ABOUT THE OPPORTUNITY</strong></p>\n\n<p>Your role as a Senior PHP Developer is to work within an Agile development team to design, test and implement scalable, testable &amp; performant solutions with a collaborative, innovative and customer-focused mindset while being empowered by management to deliver on your team objectives.</p>\n\n<p><strong>RESPONSBILITIES</strong></p>\n\n<ul>\n<li>Write code and tests according to agreed upon team standards.</li>\n<li>Review code changes and implementations while adhering to security and design standards.</li>\n<li>Take ownership of for your product end-to-end</li>\n<li>Contribute to feature design by collaborating with Product Manager, UX/UI designers and your team members.</li>\n<li>Adopt best DevOps practices (Continuous Integration, infrastructure-as-code, monitoring, etc.) supported by our SRE team.</li>\n<li>Help prioritise technical tasks with your team.</li>\n<li>Take ownership of your team’s objectives and contribute to the team roadmap.</li>\n<li>Contribute to adopting an Agile mindset within your team and focussing on delivering customer value.</li>\n<li>Continuously participate with knowledge sharing and discussions within various technical guilds.</li>\n<li>Actively learn new skills, languages, technologies and methodologies to hone you and your team's skill sets.</li>\n</ul><p><strong>REQUIREMENTS</strong></p>\n\n<ul>\n<li>A customer-centric focus, ensuring that the customer experience is kept in mind at all times.</li>\n<li>Honed skill-set in “Backend” software development, with prior experience with scalable/performant code.</li>\n<li>Some experience or interest in Frontend technologies beneficial.</li>\n<li>Ability to help design an optimal solution to a technical problem via Software Architecture.</li>\n<li>Prior experience with unit, functional and behavioural testing, ensuring high quality.</li>\n<li>Previous experience working with Symfony &amp; Doctrine PHP frameworks.</li>\n<li>Substantial knowledge surrounding MySQL, Linux, REST API’s and debugging.</li>\n<li>A willingness to learn and to grow both yourself and your team's’ technical abilities.</li>\n</ul><p>For more information about careers at Neto, click <a href=\"https://www.netohq.com/careers?_ga=2.19718200.1468138358.1539921084-553465287.1527466080\">here</a></p>\n\n<p><strong>ABOUT NETO</strong></p>\n\n<p>Backed by Telstra, Neto is the only Australian retail and wholesale management platform that provides a complete solution for ecommerce, point of sale, inventory and fulfilment.</p>\n\n<p>Our customers include some of Australia's best known online retail success stories. Find out more at <a href=\"www.neto.com.au\">here</a>.</p>\n\n<p>Neto is a collaborative and energetic environment with more than 140 like-minded people who are REALLY great at what they do.  </p>\n\n<p><strong>BENEFITS</strong></p>\n\n<p>We pride ourselves on creating an awesome place to work with a number of benefits for our employees:</p>\n\n<ul>\n<li>A free online store to help you live out your entrepreneurial dreams</li>\n<li>Paid study leave to support individual learning</li>\n<li>Monthly company-wide social and fundraising events</li>\n<li>Access to discounted private healthcare</li>\n<li>Access to work-life coaching program for you and your family</li>\n<li>State-of-the-art offices in South Brisbane complete with a games room, beer on tap and espresso machines</li>\n</ul>",
    "how_to_apply": "<p>We are looking for talented people who are passionate and have the desire to succeed. If you are a high achiever who is willing to learn and grow with us, email your CV to <a href=\"mailto:karen.whiteford@neto.com.au\">karen.whiteford@neto.com.au</a> come and join our team!</p>",
    "company": "Neto Ecommerce Solutions",
    "company_url": "https://www.netohq.com/au/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/825a1c02-d356-11e8-9b1f-59a501aa3826.png",
    "url": "http://jobs.github.com/positions/924c96ee-d356-11e8-9a27-32322f326b43"
  },
  {
    "id": "9e6c40d2-d342-11e8-8c01-03489e06ba44",
    "created_at": "Fri Oct 19 02:00:00 UTC 2018",
    "title": "Chief Technology Officer / Chief Architect SAP Leonardo",
    "location": "Walldorf, Germany",
    "type": "Part Time",
    "jobtype": "Contract",
    "label": "gold",
    "description": "<p>View job and apply on the corporate career site <a href=\"https://jobs.sap.com/job/WalldorfSt_-Leon-Rot-Chief-Technology-Officer-Chief-Architect-SAP-Leonardo-Machine-Learning-Job-BW/490493701/?feedId=118400&amp;utm_source=github&amp;utm_campaign=Leo_CTO\">here</a>.</p>\n\n<p>As a Chief Technology Officer / Chief Architect for SAP Leonardo Machine Learning, you will define technology strategy and architecture across Leonardo platforms and consuming applications. Continuously injecting external state of the art and best practices, you will engage with platform and application teams to drive consistent implementation, lead the ML architecture community of practice and become a trusted advisor to senior leadership.</p>\n\n<p>Requirements:</p>\n\n<ul>\n<li>Master’s Degree in Computer Science, Physics, Mathematics or Engineering</li>\n<li>Profound first-hand understanding of ML/deep learning technology on all levels of the stack</li>\n<li>Senior leadership-level written and oral communication skills in English and German</li>\n</ul><p>View job and apply on the corporate career site <a href=\"https://jobs.sap.com/job/WalldorfSt_-Leon-Rot-Chief-Technology-Officer-Chief-Architect-SAP-Leonardo-Machine-Learning-Job-BW/490493701/?feedId=118400&amp;utm_source=github&amp;utm_campaign=Leo_CTO\">here</a>.</p>",
    "how_to_apply": "<p>View job and apply on the corporate career site <a href=\"https://jobs.sap.com/job/WalldorfSt_-Leon-Rot-Chief-Technology-Officer-Chief-Architect-SAP-Leonardo-Machine-Learning-Job-BW/490493701/?feedId=118400&amp;utm_source=github&amp;utm_campaign=Leo_CTO\">here</a>.</p>",
    "company": "SAP",
    "company_url": "https://jobs.sap.com/job/WalldorfSt_-Leon-Rot-Chief-Technology-Officer-Chief-Architect-SAP-Leonardo-Machine-Learning-Job-BW/490493701/?feedId=118400&utm_source=github&utm_campaign=Leo_CTO",
    "company_logo": "http://github-jobs.s3.amazonaws.com/70a041d0-d342-11e8-8cdc-7ec7d7175449.png",
    "url": "http://jobs.github.com/positions/9e6c40d2-d342-11e8-8c01-03489e06ba44"
  },
  {
    "id": "98399cf2-d31d-11e8-859b-82549602a445",
    "created_at": "Thu Oct 18 21:35:03 UTC 2018",
    "title": "Technology Team Lead, Digital Agency for Social Change",
    "location": "New York, New York",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>Constructive, a leading brand experience design &amp; digital design agency that works exclusively with social impact organizations is looking for an outstanding technical expert and creative thinker to take over for our current Technology Team Lead, who will sadly be transitioning out of the role at the end of 2018 to live abroad.</p>\n\n<p>If you’re an experienced technologist who knows how to architect and build complex websites, thrives on being a consultative, collaborative problem solver, and believes that the best digital experiences happen when strategy, technology, and design work together, then we’d love to hear from you. If you care deeply about issues like climate change, social justice, and economic equality—and want the work you do to make a meaningful positive impact on them—then we think you’ll love working with us and our clients.</p>\n\n<p><strong>A bit about the role</strong></p>\n\n<p>Our Technology Team Lead needs a holistic understand of modern web development techniques and infrastructure. They need experience building strong and scalable websites. They must thrive on being hands-on with development projects. They’ll need a leadership mindset, and must be capable of working on multi-disciplinary teams to communicate complex technological choices to non-developers.</p>\n\n<p>That’s all fancy job-posting language for: you really know your stuff and don’t have a big ego, you take responsibility for the quality of our work and the growth of your team, you still like to get your hands dirty with code, and you’re an effective collaborator—especially with people who don’t understand technology as well as you do.</p>\n\n<p><strong>A bit about us</strong></p>\n\n<p>We’re a diverse, close-knit bunch who are serious about having fun producing exceptional work. We play to win—for our clients, for ourselves, and for the world. We’ve got high expectations and we’ve got the work ethic to match them. We’re all together in the same open office. There’s music and a lot of joking mixed-in with being heads-down on work. And we’ve got each-other’s backs. </p>\n\n<p><strong>A bit about diversity</strong></p>\n\n<p>We believe strongly that diversity is one of our greatest strengths—that the more perspectives we bring to the mix, the better we are as people and the better partner we are for our clients. So, in considering if Constructive is a good fit for you, know that all we care about is that you’re qualified to do the job, share most or all of our values, and want to be here. These are the things we’ll be evaluating for every applicant—and if you meet those and add to our diversity, all the better.</p>\n\n<p><strong>What we need you to do extremely well</strong></p>\n\n<p>This role combines technology team leadership and hands-on development, emphasizing one or the other at any given time. We’ll need you to have strong demonstrated success having done all or most of these things for at least 3-5 years—and a passion for doing them well. </p>\n\n<ul>\n<li>Provide strong technical leadership—both for our internal team of developers, strategists, and designers; and for our clients and occasional external dev partners.\nManage and mentor junior developers—two in-house developers, one ongoing external partner, and any additional developers when project load requires it.<br>\n</li>\n<li>Guide development team and our company on planning, prioritizing, mitigating risks, and balancing technical debt to meet project milestones so that we deliver exceptional work that meet expectations.</li>\n<li>Communicate with stakeholders to understand strategic goals and the context in which they need to be met, gather requirements, and produce technical documentation that makes it very clear how technology will help achieve them.</li>\n<li>Develop requirements and develop specifications and architecture to document what we’re building and what’s been built.</li>\n<li>Lead development of ambitious digital products, serving as the point person for both the end-to-end process and the outcomes we deliver, aligning our work with Constructive’s broader strategic position as a leading brand experience design firm.</li>\n<li>Be a hands-on developer who takes on specific aspects of complex jobs or plays a lead developer role on a project when needed. </li>\n<li>Review code and provide feedback on work done by other developers; oversee the UAT and QA processes in coordination with project managers.</li>\n<li>Improve best practices, recommend tools, and build technical frameworks that make our work more efficient, effective, and technically front-of field.</li>\n<li>Be the face of Constructive’s technical expertise throughout client engagements, in the development community, and when needed in our sales cycle.</li>\n<li>Contribute to developing proposals and estimates for technical projects, particularly those with complex requirements.</li>\n<li>Lead vetting and hiring of new web developers and external development partners.</li>\n<li>Be a team player who knows how to lead, has a bias towards listening, takes serious pride in their work, and is always looking for our process and results to be better the next time out. It helps if you also have a good sense of humor.</li>\n</ul><p><strong>Expertise that’s important in our work</strong></p>\n\n<p>Right now, these are the specific technologies and tasks that are essential to our work. We’ll need you to have about 5 years of experience in most of these things, and we’re very open to new ideas on which specific technologies and tools can improve on what we have.</p>\n\n<ul>\n<li>Expert Wordpress &amp; Drupal development (Minimum 5 years of experience)</li>\n<li>Expert front-end development experience</li>\n<li>Strong experience with Webpack / Gulp / SCSS </li>\n<li>Strong experience doing large-scale content migrations</li>\n<li>Strong experience doing third-party integrations (Solr, Salesforce, Mailchimp, Fluxx)</li>\n<li>Experience with Data Visualization (D3, Highcharts)</li>\n<li>Experience with Infrastructure, System Administration &amp; DevOps</li>\n<li>Experience with ES6, Node, React</li>\n<li>Comfortable with AWS (S3, Route 53)</li>\n</ul><p><strong>What’s in it for you?</strong></p>\n\n<p>We do our best to make sure everyone at Constructive is taken care of with a great mix of salary, benefits and perks, opportunities for professional growth, and a healthy dose of time off. We also always reward individual initiative and outsized contributions to our collective success. Our clients are essentially all nonprofits—so if you’re in it solely for the money, there are places that will probably offer you a bit more of that. But we like to think Constructive offers the complete package. </p>\n\n<p>We expect this position to be in the $100-$125K range plus bonuses. Here’s what we have on tap for 2018-2019 to add to this:</p>\n\n<p><strong>Benefits &amp; Perks</strong></p>\n\n<ul>\n<li>Company-Sponsored Health, Dental &amp; Vision Insurance</li>\n<li>401K plan with 4% company match</li>\n<li>Annual profit sharing bonus (Approx 10% of company profit distributed equally)</li>\n<li>Discretionary performance-based bonuses</li>\n<li>2 weeks paid vacation (+1 additional day per year)</li>\n<li>Paid vacation between Christmas &amp; New Year's</li>\n<li>1/2-day Summer Fridays (Approx 16)</li>\n<li>1 week paid personal/sick days</li>\n<li>Unlimited work-from-home days (within reason!) after 6 months</li>\n<li>Monthly employee-voted gift card awards</li>\n<li>TransitChek (pay for transit w/ pre-tax $)</li>\n<li>Discounted Company Cell Phone Plan</li>\n<li>$1K annual professional development stipend</li>\n<li>New client bonus (2.5% of largest contract in year 1 for any non-inbound client)</li>\n<li>Coffee, healthy snacks, soda</li>\n<li>Company lunch every Wednesday</li>\n<li>Weekly Happy Hr (every non-summer Friday)</li>\n<li>Bi-monthly Company Events (sporting events, bowling, holiday party, etc)</li>\n<li>The feeling of satisfaction knowing that your work is helping make the world a better place</li>\n</ul><p><strong>Interested? Great! Then please send an email to titled “Technology Team Lead” to <a href=\"mailto:jobs@constructive.co\">jobs@constructive.co</a> with the following</strong> </p>\n\n<ul>\n<li>A resume</li>\n<li>A cover letter telling us a bit about you and what excites you about joining our team</li>\n<li>Links to your own website, websites you’ve worked on, github, whatever</li>\n<li>Desired salary (freelance rate for those interested in consulting with us)</li>\n</ul>",
    "how_to_apply": "<p>Please email a resume, cover letter, your website, examples of websites you've worked on, and desired salary (freelance rate for those interested in consulting)</p>",
    "company": "Constructive",
    "company_url": "http://constructive.co",
    "company_logo": "http://github-jobs.s3.amazonaws.com/3a754482-d31c-11e8-9104-0dedb3568d96.png",
    "url": "http://jobs.github.com/positions/98399cf2-d31d-11e8-859b-82549602a445"
  },
  {
    "id": "8176aed4-d303-11e8-8d9b-d82717283ef7",
    "created_at": "Thu Oct 18 18:29:20 UTC 2018",
    "title": "Software Engineer- JIRA & SBM Solutions Specialist ",
    "location": "Santa Clara",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><strong>Job Description:</strong><br>Agilent inspires and supports discoveries that advance the quality of life. We provide life science, diagnostic and applied market laboratories worldwide with instruments, services, consumables, applications and expertise. Agilent enables customers to gain the answers and insights they seek ---- so they can do what they do best: improve the world around us. Information about Agilent is available at www.agilent.com.</p>\n\n<p>IT -- ES (Engineering Services) organization is looking for an JIRA applications specialist to be part of the Software engineering team to support enterprise-wide instance. Expertise in SBM (Serena Business Manager) will be preferred. Expertise in other tools like Confluence, BitBucket, Jenkins, Nexus will be an advantage.</p>\n\n<p><strong>Position Responsibilities:</strong></p>\n\n<ul>\n<li>Administer Atlassian toolset including Jira, confluence, Bitbucket, etc. in a validated environment.</li>\n<li>Gather requirements for business process improvements and determine ways to optimize and improve JIRA environment and workflows</li>\n<li>Create, design, and deploy comprehensive JIRA custom workflows, fields, permission schemes, post functions, etc.</li>\n<li>Develop, Install, configure, test, and manage plug-ins</li>\n<li>Support of integrations between tools in our development landscape, including, but not limited to: Atlassian tools, confluence, bitbucket, Serena Business Manager (SBM)</li>\n<li>Develop solutions extending Atlassian REST services and JIRA plugins using the Atlassian SDK</li>\n<li>Research and implement Atlassian best practices &amp; actively develop and improve JIRA skill set by keeping up on JIRA industry trends, tools, and techniques</li>\n<li>Develop and maintain a validated procedures and governance for medical compliant systems.</li>\n<li>Provide and maintain test procedures for new versions of Jira tools and plug-ins to ensure compatibility during testing.</li>\n<li>Proven track record with Atlassian installations, migrations and upgrades.</li>\n<li>Maintain and support already existing MicroFocus Serena Business Manager applications (workflows).</li>\n</ul><div>\n<div><strong>Travel Required:</strong></div>\n<div>Occasional</div>\n<div> </div>\n<strong>Requirements:</strong>\n</div>\n<div>\n<p>Educational &amp; Technical Qualifications:</p>\n<div>\n<ul>\n<li>Bachelors, Masters or University Degree or equivalent in Software/Computer Engineering or other Scientific/Technical discipline or equivalent combination of education and experience</li>\n<li>5+ years relevant professional experience in programming/configuration of workflow management systems in JIRA &amp; SBM</li>\n<li>Experience with performing Atlassian installations, migrations, and plugin installation</li>\n<li>Programming experience in Java, Javascript, ChaiScript and Visual Basic</li>\n<li>Experience with SQL queries &amp; JIRA plug-ins, JIRA Query Language (JQL) and scripting</li>\n<li>Ability to create complex JIRA workflows including project workflows, security schemes, screen schemes, JIRA vocabulary, permission and notification schemes</li>\n<li>Hands-on custom Plugin development with good scripting and programming knowledge.</li>\n<li>Hands-on experience using JIRA REST APIs for integration with other tools like Jenkins, Sonar</li>\n<li>Familiarity with Java, Apache Tomcat, APIs, Certificates, POSTGRES and SQL.</li>\n<li>Software development background preferred</li>\n<li>Experience working on an Agile development teams (Scrum/Kanban)</li>\n<li>Experience administering and customizing JIRA projects, experience performing data migrations from other Jira and non-Jira sources.</li>\n<li>DevOps experience</li>\n</ul>\n</div>\n\n<p><strong>Personal skills:</strong></p>\n\n<div>\n<ul>\n<li>Optimistic, eager, forward-looking and open attitude that supplements our team</li>\n<li>Self-organized and independent work style with strong customer focus</li>\n<li>Detail-oriented with Excellent collaboration and communication skills</li>\n<li>Demonstrates strong teamwork skills collaborate and work effectively in teams across different businesses, functions and geographies</li>\n<li>Ability to manage several issues in parallel while keeping focus on priority and due dates</li>\n<li>Strong influencing skills paired with project management/leadership skills</li>\n<li>Willingness to work globally across different time zones</li>\n</ul>\n<p> </p>\n<p>Agilent Technologies, Inc. is an Equal Employment Opportunity and Affirmative Action employer. We value diversity at all levels. All individuals, regardless of personal characteristics, are encouraged to apply. All qualified applicants will receive consideration for employment without regard to sex, pregnancy, race, religion or religious creed, color, gender, gender identity, gender expression, national origin, ancestry, physical or mental disability, medical condition, genetic information, marital status, registered domestic partner status, age, sexual orientation, military or veteran status, protected veteran status, or any other basis protected by federal, state, local law, ordinance, or regulation and will not be discriminated against on these bases.</p>\n<p>Agilent Technologies, Inc., is committed to diversity in the workplace and strives to support candidates with disabilities. If you have a disability and need assistance with any part of the application or interview process or have questions about workplace accessibility, please contact +1-262-754-5030 email <a href=\"mailto:job_posting@agilent.com\">job_posting@agilent.com opens an email client application</a>. EOE AA M/F/Vet/Disability/Sexual Orientation/Gender Identity.</p>\n<p>For more information about equal employment opportunity protections, please see all of our notices for EEO below.</p>\n<p><a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf\">https://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf opens a pdf file</a>,</p>\n<p><a href=\"https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pd\">https://www.dol.gov/ofccp/regs/compliance/posters/pdf/OFCCP_EEO_Supplement_Final_JRF_QA_508c.pd</a></p>\n</div>\n\n<p></p>\n</div>",
    "how_to_apply": "<p><a href=\"http://bit.ly/2zyLytT\">http://bit.ly/2zyLytT</a></p>",
    "company": "Agilent",
    "company_url": "http://Agilent",
    "company_logo": "http://github-jobs.s3.amazonaws.com/bc798502-d302-11e8-93ad-53d775fdf695.png",
    "url": "http://jobs.github.com/positions/8176aed4-d303-11e8-8d9b-d82717283ef7"
  },
  {
    "id": "23f94994-d2f7-11e8-918b-5730c182158c",
    "created_at": "Thu Oct 18 16:59:13 UTC 2018",
    "title": "Siri - Machine Learning Engineer, Modeling",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Siri Northstar group is building novel AI-based products and the technology to make building those products easier. We work on features that become part of high-profile NLP products used by hundreds of millions of people, including Siri, Messages, News, and other products. We also work on novel methods and tools that make engineering AI products faster, easier, and more bug-free.</p>\n\n<p>As part of this group, you will have access to exciting unique datasets, and use your statistical and systems-building skills to create software that has never existed before. Compared to other machine learning groups, we place an especially heavy emphasis on evaluation and systems-building skills.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Extensive experience in designing, training, and evaluating machine learning models</li>\n<li>Strong background in computer science, especially machine learning, statistics, NLP, or similar subareas</li>\n<li>Programming experience in Go, C/C++, or Python</li>\n<li>Excellent communication and collaborative skills</li>\n</ul><p>Description:\nPassionate about shipping products used by hundreds of millions of customers? Applying state of the art technologies to create services that just work? If so, this might just be the place for you. Come work in an environment that will challenge you to push your limits, and train you to succeed as part of a team. You are willing to tackle demanding projects in the areas of semantic search, structured data, knowledge representation, and distributed architecture. Key to success will be the ability to deliver results, a real passion for excellence, and a willingness to keep learning and improving oneself.</p>\n\n<p>Education:\n· PhD in Computer Science, with emphasis on statistics, machine learning, NLP, data management, or similar area; or equivalent work experience.</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 114329946\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=4b11d800ff74ef7c25990cca389a749f\">https://ars2.equest.com/?response_id=4b11d800ff74ef7c25990cca389a749f</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/18323206-d2f7-11e8-9adb-947eb4cfe44e.jpeg",
    "url": "http://jobs.github.com/positions/23f94994-d2f7-11e8-918b-5730c182158c"
  },
  {
    "id": "2258b2aa-d2f7-11e8-857b-80975262efed",
    "created_at": "Thu Oct 18 16:59:10 UTC 2018",
    "title": "iOS Wallet and Apple Pay Engineer",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>The Wallet &amp; Apple Pay team is looking for talented, proactive, and hardworking software engineers to join our growing team. Wallet allows you to collect your boarding passes, movie tickets, coupons, and more, all in one place. It’s also the home for Apple Pay, the easiest and most convenient way to pay in stores, apps, and on the web. In iOS 11.2, we introduced Apple Pay Cash which allows you to send and receive money from friends and family right in Messages, and we’ve revolutionized how our customers ride public transit in Japan and China.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>Strong programming skills, preferably with C, Objective-C and/or C++</li>\n<li>User-interface programming experience</li>\n<li>Excellent communication and collaborative skills</li>\n<li>Passion for product quality and attention to detail</li>\n<li>Comfortable with rapid development cycles, tight schedules</li>\n<li>Excellent understanding of optimization and performance issues across OS software layers</li>\n</ul><p>Description:\nAs an engineer on our team, your responsibilities will range from high-level user interfaces, to writing background processing and networking code, to developing frameworks used by other teams at Apple and third party developers.</p>\n\n<p>You'll be responsible for maintaining and improving existing features and implementing new and innovative ideas for the future. You will also be responsible for delivering the best possible application performance including fast launch times and smooth scrolling. We work closely with the other iOS engineering teams, human interface designers, different groups across Apple, and our partners at other companies.</p>\n\n<p>Our goals are simple but the task is large; create the most amazing products on the planet that our customers will love.</p>\n\n<p>Education:\nBS Computer Science or Equivalent</p>\n\n<p>Additional Requirements:</p>\n\n<ul>\n<li>iOS programming experience</li>\n<li>CoreAnimation experience</li>\n<li>Familiarity with NFC, iBeacon, and related technologies</li>\n<li>Understanding of security, digital signatures, and PKI</li>\n<li>Advanced performance analysis including Instruments and DTrace</li>\n</ul><p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 114316404\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=28658c20aaaaadc489de7518830f8a65\">https://ars2.equest.com/?response_id=28658c20aaaaadc489de7518830f8a65</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/1fa94ea2-d2f7-11e8-8557-3ea32c8eef0e.jpeg",
    "url": "http://jobs.github.com/positions/2258b2aa-d2f7-11e8-857b-80975262efed"
  },
  {
    "id": "29a5c824-d2f5-11e8-995c-9c6feac72528",
    "created_at": "Thu Oct 18 16:45:04 UTC 2018",
    "title": "(Senior) C#-Entwickler (m/w)",
    "location": "Hamberg",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><strong>Statista</strong>, mit Hauptsitz in Hamburg, ist eines der f¸hrenden Online-Statistik-Portale der Welt.</p>\n\n<p>Mehrfach ausgezeichnet als innovatives, digitales Unternehmen versorgt Statista Kunden wie Google, Bloomberg, Forbes, Procter &amp; Gamble oder Porsche mit qualitativ hochwertigen Produkten und Services aus den Bereichen Research &amp; Analysis, Data Intelligence, Content Marketing und News. </p>\n\n<p>Mit 550 Mitarbeitern aus ¸ber 45 verschiedenen Nationen und B¸ros in Hamburg, New York, London und Paris schˆpft Statista seine Innovationskraft aus der Internationalit‰t und Vielf‰ltigkeit. </p>\n\n<p>Statista bietet eine Learning-by-Doing-Unternehmenskultur, lebt den \"Entrepreneurial Spirit\", zeichnet sich durch sehr gute Karrierechancen aus und verbindet den Pioniergeist eines Start-ups mit der Stabilit‰t eines etablierten Unternehmens.</p>\n\n<h2>Das Team</h2>\n\n<p>Die <strong>IT</strong> ist die zentrale Produktenwicklungsabteilung und daf¸r verantwortlich, dass Statista-Kunden weltweit zu jeder Zeit ein funktionsf‰higes und einwandfreies Produkt nutzen kˆnnen. Das  Team plant, konzipiert und gestaltet die Statista-Plattform und entwickelt sie stetig weiter ñ damit sie die f¸hrende, anwenderorientierte B2B2C-Plattform f¸r statistische Inhalte bleibt. Dar¸ber hinaus stellt die Statista IT sicher, dass den Mitarbeitern alle benˆtigten technischen Ressourcen jederzeit und ¸berall zur Verf¸gung stehen.</p>\n\n<h2>Deine Aufgaben</h2>\n\n<ul>\n<li>(Weiter-) Entwicklung von In-House-Tools f¸r unser Redaktions- und Sales-Team</li>\n<li>Betreuung des gesamten Software-Lebenszyklus (Software-Design, Programmierung, Test, Deployment, Wartung)</li>\n<li>Kontinuierliche Weiterentwicklung und Optimierung der Systeme</li>\n</ul><h2>Dein Profil</h2>\n\n<ul>\n<li>Abgeschlossene Ausbildung in der IT oder Studium der Informatik</li>\n<li>Mehrj‰hrige Praxiserfahrung in der objektorientierten Programmierung mit C# (oder Java)</li>\n<li>Gute Kenntnisse in der Entwicklung von Rich Clients f¸r Windows (WinForms, WPF oder vergleichbare Technologien)</li>\n<li>Erfahrung in der Anwendung von UI-Design Patterns wie MVVM oder MVC</li>\n<li>Kenntnisse relationaler Datenbanken (MySQL)</li>\n<li>Erfahrungen mit Versionskontrollsystemen (GIT)</li>\n<li>Pragmatische, proaktive und eigenverantwortliche Arbeitsweise</li>\n<li>Erste Erfahrungen mit automatisierten Tests</li>\n<li>Idealerweise erste Erfahrungen mit Linux-Systemen</li>\n<li>Nice-to-Haves: Jenkins, NoSQL, Sphinx Search, REST-APIs, Message Queues, Amazon AWS, PHP</li>\n</ul><h2>Was wir bieten</h2>\n\n<ul>\n<li>Teilnahme an Konferenzen</li>\n<li>Zahlreiche Weiterbildungsmˆglichkeiten</li>\n<li>Aktuelle Hardware</li>\n<li>Eigenverantwortliches Arbeiten vom ersten Tag an</li>\n<li>Sehr gute Entwicklungs- und Karrieremˆglichkeiten</li>\n<li>Zentrale Lage in Hamburgs Innenstadt</li>\n<li>Zuschuss zum HVV &amp; einer betrieblichen Altersvorsorge</li>\n</ul>",
    "how_to_apply": "<p>Please send your CV to <a href=\"mailto:jobs@statista.com\">jobs@statista.com</a></p>",
    "company": "Statista",
    "company_url": "https://de.statista.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/96822a86-d2f6-11e8-93ca-e0bc283c6d40.png",
    "url": "http://jobs.github.com/positions/29a5c824-d2f5-11e8-995c-9c6feac72528"
  },
  {
    "id": "28284922-d2f5-11e8-8034-eeccf795a4bf",
    "created_at": "Thu Oct 18 16:45:01 UTC 2018",
    "title": "PHP-Lead-Developer (m/w)",
    "location": "Hamberg",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<h1></h1>\n\n<p><strong>Statista</strong>, mit Hauptsitz in Hamburg, ist eines der f¸hrenden Online-Statistik-Portale der Welt.</p>\n\n<p>Mehrfach ausgezeichnet als innovatives, digitales Unternehmen versorgt Statista Kunden wie Google, Bloomberg, Forbes, Procter &amp; Gamble oder Porsche mit qualitativ hochwertigen Produkten und Services aus den Bereichen Research &amp; Analysis, Data Intelligence, Content Marketing und News. </p>\n\n<p>Mit 550 Mitarbeitern aus ¸ber 45 verschiedenen Nationen und B¸ros in Hamburg, New York, London und Paris schˆpft Statista seine Innovationskraft aus der Internationalit‰t und Vielf‰ltigkeit. </p>\n\n<p>Statista bietet eine Learning-by-Doing-Unternehmenskultur, lebt den \"Entrepreneurial Spirit\", zeichnet sich durch sehr gute Karrierechancen aus und verbindet den Pioniergeist eines Start-ups mit der Stabilit‰t eines etablierten Unternehmens.</p>\n\n<h2>Das Team</h2>\n\n<p>Die <strong>IT</strong> ist die zentrale Produktenwicklungsabteilung und daf¸r verantwortlich, dass Statista-Kunden weltweit zu jeder Zeit ein funktionsf‰higes und einwandfreies Produkt nutzen kˆnnen. Das  Team plant, konzipiert und gestaltet die Statista-Plattform und entwickelt sie stetig weiter ñ damit sie die f¸hrende, anwenderorientierte B2B2C-Plattform f¸r statistische Inhalte bleibt. Dar¸ber hinaus stellt die Statista IT sicher, dass den Mitarbeitern alle benˆtigten technischen Ressourcen jederzeit und ¸berall zur Verf¸gung stehen.</p>\n\n<h2>Deine Aufgaben</h2>\n\n<ul>\n<li>F¸hrung des 6-kˆpfigen PHP-Entwicklerteams</li>\n<li>Optimierung, Skalierung und Weiterentwicklung der Gesamtplattform</li>\n<li>Betreuung des gesamten Software-Lebenszyklus (Anforderungsanalyse, Design, Programmierung, Test, Deployment, Wartung)</li>\n<li>Erfahrungsaustausch innerhalb eines erfahrenen Entwicklerteams</li>\n<li>Kontinuierliche Weiterentwicklung und Administration einer komplexen Internetarchitektur</li>\n</ul><h2>Dein Profil</h2>\n\n<ul>\n<li>Fundierte Ausbildung in der IT oder Studium der Informatik</li>\n<li>Mehrj‰hrige Praxiserfahrung in der objektorientierten Programmierung mit PHP</li>\n<li>Sehr gute Kenntnisse in mind. einem Framework (idealerweise Symfony2)</li>\n<li>Kenntnisse relationaler Datenbanken (MySQL)</li>\n<li>Kenntnisse im Umgang mit linux-basierten Webservern (CentOS)</li>\n<li>Zielorientierte, pragmatische und pro-aktive Arbeitsweise</li>\n<li>Erfahrung im Delegieren von Aufgaben</li>\n<li>Erfahrungen mit Versionskontrollsystemen (GIT)</li>\n<li>Nice-to-Haves : C#, No-SQL-Datenbanken, jQuery, REST-APIs, Message Queues, nginx, Amazon AWS</li>\n</ul><h2>Was wir bieten</h2>\n\n<ul>\n<li>Teilnahme an Konferenzen</li>\n<li>Zahlreiche Weiterbildungsmˆglichkeiten</li>\n<li>Aktuelle Hardware</li>\n<li>Eigenverantwortliches Arbeiten vom ersten Tag an</li>\n<li>Sehr gute Entwicklungs- und Karrieremˆglichkeiten</li>\n<li>Zentrale Lage in Hamburgs Innenstadt</li>\n<li>Zuschuss zum HVV &amp; einer betrieblichen Altersvorsorge</li>\n</ul>",
    "how_to_apply": "<p>Please send your CV to <a href=\"mailto:jobs@statista.com\">jobs@statista.com</a></p>",
    "company": "Statista",
    "company_url": "https://de.statista.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/96822a86-d2f6-11e8-93ca-e0bc283c6d40.png",
    "url": "http://jobs.github.com/positions/28284922-d2f5-11e8-8034-eeccf795a4bf"
  },
  {
    "id": "2676ed40-d2f5-11e8-8fde-2efb6e389368",
    "created_at": "Thu Oct 18 16:44:58 UTC 2018",
    "title": "Netzwerkadministrator (m/w)",
    "location": "Hamberg",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<h1></h1>\n\n<p><strong>Statista</strong>, mit Hauptsitz in Hamburg, ist eines der f¸hrenden Online-Statistik-Portale der Welt.</p>\n\n<p>Mehrfach ausgezeichnet als innovatives, digitales Unternehmen versorgt Statista Kunden wie Google, Bloomberg, Forbes, Procter &amp; Gamble oder Porsche mit qualitativ hochwertigen Produkten und Services aus den Bereichen Research &amp; Analysis, Data Intelligence, Content Marketing und News. </p>\n\n<p>Mit 550 Mitarbeitern aus ¸ber 45 verschiedenen Nationen und B¸ros in Hamburg, New York, London und Paris schˆpft Statista seine Innovationskraft aus der Internationalit‰t und Vielf‰ltigkeit. </p>\n\n<p>Statista bietet eine Learning-by-Doing-Unternehmenskultur, lebt den \"Entrepreneurial Spirit\", zeichnet sich durch sehr gute Karrierechancen aus und verbindet den Pioniergeist eines Start-ups mit der Stabilit‰t eines etablierten Unternehmens.</p>\n\n<h2>Das Team</h2>\n\n<p>Die <strong>IT</strong> ist die zentrale Produktenwicklungsabteilung und daf¸r verantwortlich, dass Statista-Kunden weltweit zu jeder Zeit ein funktionsf‰higes und einwandfreies Produkt nutzen kˆnnen. Das  Team plant, konzipiert und gestaltet die Statista-Plattform und entwickelt sie stetig weiter ñ damit sie die f¸hrende, anwenderorientierte B2B2C-Plattform f¸r statistische Inhalte bleibt. Dar¸ber hinaus stellt die Statista IT sicher, dass den Mitarbeitern alle benˆtigten technischen Ressourcen jederzeit und ¸berall zur Verf¸gung stehen.</p>\n\n<h2>Deine Aufgaben</h2>\n\n<ul>\n<li>Planung, Aufbau, Betrieb und Weiterentwicklung der Netzwerkinfrastruktur der verschiedenen Offices</li>\n<li>Sicherstellung des reibungslosen Betriebs unserer IT-Systeme</li>\n<li>Analyse und Lˆsen von Infrastrukturproblemen</li>\n<li>Durchf¸hrung und ‹berwachung des Backups, sowie dessen Weiterentwicklung</li>\n<li>Analyse und Weiterentwicklung der eingesetzten Monitoringlˆsungen (Grafana, check_mk, Graylog)</li>\n<li>Wartung und Optimierung der Firewallsysteme (FortiGate, Edgerouter)</li>\n</ul><h2>Dein Profil</h2>\n\n<ul>\n<li>Fundierte Ausbildung in der IT oder technisches Studium</li>\n<li>Erfahrung in Netzwerk- und Infrastrukturthemen, wie Routing und Switching, Quality of Service, VPN, IT-Sicherheit und Storage</li>\n<li>Linux-Kenntnisse (bevorzugt CentOS / Debian)</li>\n<li>Erfahrungen mit Konfiguration und Betrieb von Firewalls (Fortigate)</li>\n<li>Gute Kenntnisse von Netzwerkprotokollen (DNS, RADIUS, DHCP, iSCSI etc.)</li>\n<li>Erfahrungen mit Server Virtualisierung (VMWare)</li>\n<li>Erfahrungen mit Backup-Systemen</li>\n<li>Strategisches Denken und analytische F‰higkeiten zur Erfassung und Umsetzung komplexer Aufgabenstellungen</li>\n<li>Nice-to-Haves: Python, Office365, Monitoring, Dynamisches Routing (OSPF)</li>\n</ul><h2>Was wir bieten</h2>\n\n<ul>\n<li>Teilnahme an Konferenzen</li>\n<li>Zahlreiche Weiterbildungsmˆglichkeiten</li>\n<li>Aktuelle Hardware</li>\n<li>Eigenverantwortliches Arbeiten vom ersten Tag an</li>\n<li>Sehr gute Entwicklungs- und Karrieremˆglichkeiten</li>\n<li>Zentrale Lage in Hamburgs Innenstadt</li>\n<li>Zuschuss zum HVV &amp; einer betrieblichen Altersvorsorge</li>\n</ul>",
    "how_to_apply": "<p>Please send your CV to <a href=\"mailto:jobs@statista.com\">jobs@statista.com</a></p>",
    "company": "Statista",
    "company_url": "https://de.statista.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/96822a86-d2f6-11e8-93ca-e0bc283c6d40.png",
    "url": "http://jobs.github.com/positions/2676ed40-d2f5-11e8-8fde-2efb6e389368"
  },
  {
    "id": "24ce81f6-d2f5-11e8-81e6-5ccb6d9bdf75",
    "created_at": "Thu Oct 18 16:44:56 UTC 2018",
    "title": "Linux System-Administrator (m/w)",
    "location": "Hamberg",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<h1></h1>\n\n<p><strong>Statista</strong>, mit Hauptsitz in Hamburg, ist eines der f¸hrenden Online-Statistik-Portale der Welt.</p>\n\n<p>Mehrfach ausgezeichnet als innovatives, digitales Unternehmen versorgt Statista Kunden wie Google, Bloomberg, Forbes, Procter &amp; Gamble oder Porsche mit qualitativ hochwertigen Produkten und Services aus den Bereichen Research &amp; Analysis, Data Intelligence, Content Marketing und News. </p>\n\n<p>Mit 550 Mitarbeitern aus ¸ber 45 verschiedenen Nationen und B¸ros in Hamburg, New York, London und Paris schˆpft Statista seine Innovationskraft aus der Internationalit‰t und Vielf‰ltigkeit. </p>\n\n<p>Statista bietet eine Learning-by-Doing-Unternehmenskultur, lebt den \"Entrepreneurial Spirit\", zeichnet sich durch sehr gute Karrierechancen aus und verbindet den Pioniergeist eines Start-ups mit der Stabilit‰t eines etablierten Unternehmens.</p>\n\n<h2>Das Team</h2>\n\n<p>Die <strong>IT</strong> ist die zentrale Produktenwicklungsabteilung und daf¸r verantwortlich, dass Statista-Kunden weltweit zu jeder Zeit ein funktionsf‰higes und einwandfreies Produkt nutzen kˆnnen. Das  Team plant, konzipiert und gestaltet die Statista-Plattform und entwickelt sie stetig weiter ñ damit sie die f¸hrende, anwenderorientierte B2B2C-Plattform f¸r statistische Inhalte bleibt. Dar¸ber hinaus stellt die Statista IT sicher, dass den Mitarbeitern alle benˆtigten technischen Ressourcen jederzeit und ¸berall zur Verf¸gung stehen.</p>\n\n<h2>Deine Aufgaben</h2>\n\n<ul>\n<li>Sicherstellen des reibungslosen Betriebs der Statista-Plattform</li>\n<li>Automatisierung und Monitoring der Server-Infrastruktur</li>\n<li>Kontinuierliche Weiterentwicklung und Optimierung der Systeme</li>\n<li>Wartung interner Hardware und Backup von Daten</li>\n<li>Verwaltung des Quellcodes in Git und Betreuung von Continuous Integration Jobs in Jenkins</li>\n<li>Erfahrungsaustausch innerhalb eines erfahrenen Entwicklerteams</li>\n<li>Logfile-Analyse</li>\n</ul><h2>Dein Profil</h2>\n\n<ul>\n<li>Fundierte Ausbildung in der IT oder technisches Studium</li>\n<li>Linux-Kenntnisse (bevorzugt CentOS / RedHat)</li>\n<li>Erfahrungen mit Server Virtualisierung</li>\n<li>Erste Erfahrungen mit Cloud-Systemen (AWS, Azure, Google Cloud)</li>\n<li>Erfahrungen mit Versionskontrollsystemen (GIT, Mercurial)</li>\n<li>Erfahrungen mit Deploymentsystemen (z.B. Jenkins, Capifony)</li>\n<li>Nice-to-Haves: Python, Office365</li>\n</ul><h2>Was wir bieten</h2>\n\n<ul>\n<li>Teilnahme an Konferenzen</li>\n<li>Zahlreiche Weiterbildungsmˆglichkeiten</li>\n<li>Aktuelle Hardware</li>\n<li>Eigenverantwortliches Arbeiten vom ersten Tag an</li>\n<li>Sehr gute Entwicklungs- und Karrieremˆglichkeiten</li>\n<li>Zentrale Lage in Hamburgs Innenstadt</li>\n<li>Zuschuss zum HVV &amp; einer betrieblichen Altersvorsorge</li>\n</ul>",
    "how_to_apply": "<p>Please send your CV to <a href=\"mailto:jobs@statista.com\">jobs@statista.com</a></p>",
    "company": "Statista",
    "company_url": "https://de.statista.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/96822a86-d2f6-11e8-93ca-e0bc283c6d40.png",
    "url": "http://jobs.github.com/positions/24ce81f6-d2f5-11e8-81e6-5ccb6d9bdf75"
  },
  {
    "id": "23370e62-d2f5-11e8-82db-351ad9cb84fd",
    "created_at": "Thu Oct 18 16:44:53 UTC 2018",
    "title": "Helpdesk Specialist (m/w) ",
    "location": "Hamberg",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><strong>Statista</strong>, mit Hauptsitz in Hamburg, ist eines der f¸hrenden Online-Statistik-Portale der Welt.</p>\n\n<p>Mehrfach ausgezeichnet als innovatives, digitales Unternehmen versorgt Statista Kunden wie Google, Bloomberg, Forbes, Procter &amp; Gamble oder Porsche mit qualitativ hochwertigen Produkten und Services aus den Bereichen Research &amp; Analysis, Data Intelligence, Content Marketing und News. </p>\n\n<p>Mit 550 Mitarbeitern aus ¸ber 45 verschiedenen Nationen und B¸ros in Hamburg, New York, London und Paris schˆpft Statista seine Innovationskraft aus der Internationalit‰t und Vielf‰ltigkeit. </p>\n\n<p>Statista bietet eine Learning-by-Doing-Unternehmenskultur, lebt den \"Entrepreneurial Spirit\", zeichnet sich durch sehr gute Karrierechancen aus und verbindet den Pioniergeist eines Start-ups mit der Stabilit‰t eines etablierten Unternehmens.</p>\n\n<h2>Das Team</h2>\n\n<p>Die <strong>IT</strong> ist die zentrale Produktenwicklungsabteilung und daf¸r verantwortlich, dass Statista-Kunden weltweit zu jeder Zeit ein funktionsf‰higes und einwandfreies Produkt nutzen kˆnnen. Das  Team plant, konzipiert und gestaltet die Statista-Plattform und entwickelt sie stetig weiter ñ damit sie die f¸hrende, anwenderorientierte B2B2C-Plattform f¸r statistische Inhalte bleibt. Dar¸ber hinaus stellt die Statista IT sicher, dass den Mitarbeitern alle benˆtigten technischen Ressourcen jederzeit und ¸berall zur Verf¸gung stehen.</p>\n\n<h2>Deine Aufgaben</h2>\n\n<ul>\n<li>Installation und Einrichtung von Windows-Rechnern</li>\n<li>Arbeiten im Netzwerk- und Telekommunikations-Management</li>\n<li>Sicherstellung des reibungslosen Betriebs unserer internen IT-Systeme</li>\n<li>Bearbeitung von Tickets im 1st und 2nd Level Support</li>\n<li>Wartung interner Hardware und Backup von Daten</li>\n</ul><h2>Dein Profil</h2>\n\n<ul>\n<li>Abgeschlossenes Studium oder vergleichbare Ausbildung (vorzugsweise im IT-Bereich)</li>\n<li>Gute Kenntnisse von Windows-Systemen</li>\n<li>Gute Kenntnisse von Netzwerken</li>\n<li>Gute Englischkenntnisse</li>\n<li>Zielorientierte, pragmatische und proaktive Arbeitsweise</li>\n<li>Ausgepr‰gte Dienstleister-Mentalit‰t</li>\n</ul><h2>Was wir bieten</h2>\n\n<ul>\n<li>Teilnahme an Konferenzen</li>\n<li>Zahlreiche Weiterbildungsmˆglichkeiten</li>\n<li>Aktuelle Hardware</li>\n<li>Eigenverantwortliches Arbeiten vom ersten Tag an</li>\n<li>Sehr gute Entwicklungs- und Karrieremˆglichkeiten</li>\n<li>Zentrale Lage in Hamburgs Innenstadt</li>\n<li>Zuschuss zum HVV &amp; einer betrieblichen Altersvorsorge</li>\n</ul>",
    "how_to_apply": "<p>Please send your CV to <a href=\"mailto:jobs@statista.com\">jobs@statista.com</a></p>",
    "company": "Statista",
    "company_url": "https://de.statista.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/96822a86-d2f6-11e8-93ca-e0bc283c6d40.png",
    "url": "http://jobs.github.com/positions/23370e62-d2f5-11e8-82db-351ad9cb84fd"
  },
  {
    "id": "b603e600-d2e8-11e8-82e2-067404b31652",
    "created_at": "Thu Oct 18 15:16:35 UTC 2018",
    "title": "CTO, Co-Founder",
    "location": "London",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>Future Builders is an online academy transforming novice programmers into professional software developers. We’re pioneering a groundbreaking new approach to training developers which doesn’t exist anywhere else in the market. Our success will impact the lives of thousands of people by helping them land their dream career.</p>\n\n<p>We’re building a platform to support a massive peer-learning community, including:</p>\n\n<ul>\n<li>A fully-featured cross-platform cloud IDE to enable teams of students to work remotely together on projects;</li>\n<li>A CMS based on Github APIs for controlling team access to projects;</li>\n<li>Business logic matching team members and scheduling their synchronous work sessions;</li>\n<li>A front-end for students to navigate through the project catalogue.</li>\n</ul><p>The company is part of the Founders Factory incubator, which provides investment, office space, and operational support.</p>\n\n<p>As CTO, you will:</p>\n\n<ul>\n<li>Be co-founder of the business, taking founder-lever equity when the company spins-out of the incubator.</li>\n<li>Take charge of the technical build-out of the product, working closely with the CEO to prioritise the backlog based on validated learnings.</li>\n<li>Set up automation of essential business processes (applications, email responses, payments, account provisioning, support ticketing).</li>\n<li>Support the beta testing programme.</li>\n<li>Recruit and lead the engineering team.</li>\n</ul><p>Essential qualifications:</p>\n\n<ul>\n<li>You're sure you want to co-found a startup now. You've started either a business or side-project in the past, or built something of your own in your spare time.</li>\n<li>You are well-networked and active in the developer community.</li>\n<li>You're regularly involved in hackathons, meetups, or open-source projects. You’ll be able to attract and recruit more developers to build-out the Future Builders team.</li>\n<li>You're London-based and able to dedicate yourself to Future Builders full-time.</li>\n<li>You care about the mission and truly want to open up software development careers to more people from diverse backgrounds.</li>\n</ul><p>Bonus qualifications:</p>\n\n<ul>\n<li>You’ve hired junior developers for your own team before, so you understand how hiring managers source and evaluate new talent.<br>\n</li>\n<li>You’ve worked in the engineering function of an established tech company before, and have a good understanding of industry best practices and workflows in enterprise software development.</li>\n<li>You’ve trained or mentored junior developers and helped them grow.</li>\n<li>You have startup experience, ideally working on developer tools or an educational product.</li>\n</ul><p>Benefits:</p>\n\n<ul>\n<li>This is a salaried position which comes with founder-level equity.</li>\n<li>Office space in Founders Factory.</li>\n<li>Free breakfast and coffee, catered lunch on Thursday and Fridays.</li>\n<li>25 days' paid leave.</li>\n</ul>",
    "how_to_apply": "<p><a href=\"https://jobs.lever.co/foundersfactory/2743c99c-9cc7-489f-9159-bca12d8e9569\">https://jobs.lever.co/foundersfactory/2743c99c-9cc7-489f-9159-bca12d8e9569</a></p>",
    "company": "Founders Factory",
    "company_url": "http://founders factory",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9e1daee0-d2e8-11e8-92fd-82a450e47cce.png",
    "url": "http://jobs.github.com/positions/b603e600-d2e8-11e8-82e2-067404b31652"
  },
  {
    "id": "a07ed49a-a23f-11e8-9ebd-8434aae25a67",
    "created_at": "Thu Oct 18 12:07:39 UTC 2018",
    "title": "WebOps/AWS Specialist",
    "location": "New York, NY 10019",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>WebOps/AWS Specialist needed to join our cross-functional, collaborative tech team of five developers at WNET.  </p>\n\n<p>We build award-winning WordPress-powered websites with HTML5 and responsive design, and multi-platform OTT and mobile video apps. This is a terrific opportunity to expand your skill set to tackle projects that are fun and challenging while working with talented developers, designers, and producers who build media-rich products that reach tens of thousands of people every day.   Here are a few examples of our work:</p>\n\n<p>THIRTEEN Passport – <a href=\"https://www.thirteen.org/passport/\">https://www.thirteen.org/passport/</a>\nRoku, Apple TV, Fire TV, Android, and iOS Apps – <a href=\"https://www.thirteen.org/anywhere/\">https://www.thirteen.org/anywhere/</a>\nPBS SoCal – <a href=\"https://www.pbssocal.org/\">https://www.pbssocal.org/</a>\nMore examples and our tech blog – <a href=\"https://ieg.wnet.org/\">https://ieg.wnet.org/</a></p>\n\n<p>As the WebOps/AWS Specialist, you will maintain, upgrade, and refine our hosting infrastructure on AWS (&lt;10 EC2s) and help us optimize the performance and scalability of our websites and apps, with an eye toward optimal up-time. You will work and test on Mac and Windows, and use Git to deploy.  Additionally, you will:</p>\n\n<ul>\n<li>Deploy web sites with WordPress</li>\n<li>Deploy back-end resources for OTT and mobile apps</li>\n<li>Monitor website and API availability and mitigate any issues</li>\n<li>Write about your work for IEG’s tech blog</li>\n</ul><p>Qualifications:</p>\n\n<p>A minimum of 3 years of experience with the following:</p>\n\n<ul>\n<li>AWS CloudFront, EBS, EC2, IAM, RDS, S3, and SES</li>\n<li>LAMP configuration and Linux system administration</li>\n<li>GitHub or BitBucket</li>\n</ul><p>Additional experience with the following will be needed:</p>\n\n<ul>\n<li>Hardening AWS products against security threats</li>\n<li>Working with PHP, Memcached, and CloudFront caching</li>\n<li>Configuring caching and security-related HTTP headers</li>\n<li>Strong communication skills to collaborate with developers, producers, and designers</li>\n</ul><p>Bonus Points if you have experience with:</p>\n\n<ul>\n<li>OTT, mobile, or WordPress development</li>\n<li>API service or client development</li>\n<li>Docker or Amazon ECS</li>\n<li>ACM, CloudTrail, Config, GuardDuty, or WAF</li>\n<li>New Relic Alerts, Synthetics, Infrastructure, or APM</li>\n</ul><p>Apply online at <a href=\"http://www.wnet.org/careers\">www.wnet.org/careers</a>.</p>\n\n<p>WNET New York Public Media\n825 Eighth Avenue\nNew York, NY 10019</p>\n\n<p>WNET is an Equal Opportunity Employer.</p>\n\n<p>PERKS</p>\n\n<ul>\n<li>Work/Life Balance</li>\n<li>Paid Time Off (PTO) - 20 days; 10 holidays</li>\n<li>Health Insurance (Medical, Dental, Vision)</li>\n<li>Flexible Spending Accounts (Health, Dependent Care, Transit)</li>\n<li>Retirement </li>\n<li>Tuition reimbursement</li>\n</ul><p>IEG is a fun, creative, collaborative environment. Our offices are located at World Wide Plaza in the Theater District, with a wide variety of restaurants in the immediate area.</p>\n\n<p>ABOUT IEG</p>\n\n<p>The Interactive Engagement Group (IEG) at WNET is a team of over 20 content producers, social media managers, designers, and developers who provide ongoing Web and mobile app development for WNET’s station sites, local productions, PBS national programs, and external clients. The developers in IEG write the code that powers our multi-platform online experiences, and deploy and manage the hosting infrastructure for Web, mobile and online video. We make our online content interactive, fast, and available 24/7/365, and enjoy surmounting difficult technical challenges to increase user engagement with compelling content.</p>",
    "how_to_apply": "<p>Apply online at <a href=\"http://www.wnet.org/careers\">www.wnet.org/careers</a>.</p>\n\n<p>WNET New York Public Media\n825 Eighth Avenue\nNew York, NY 10019</p>\n\n<p>WNET is an Equal Opportunity Employer.</p>",
    "company": "WNET New York  Public Media",
    "company_url": "http://www.wnet.org/careers",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/a07ed49a-a23f-11e8-9ebd-8434aae25a67"
  },
  {
    "id": "b8e93ea2-d2b5-11e8-86e1-0fc70e8db824",
    "created_at": "Thu Oct 18 09:11:57 UTC 2018",
    "title": "Application Engineer",
    "location": "The Hague",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><b>Application Engineer</b><br>\n89898BR</p><p></p>\n\n<p><b>Job Description</b><br><b>We need a tech-savvy trouble-shooter to join our diverse global team. If you enjoy solving-problems and working with customers, you’ll find plenty of scope at Shell to stretch your skills.</b></p>\n\n<p><b>What’s the role?</b><br>\nWe call this a Systems Engineer role internally but, in practice it will be more of a DevOps role – an ideal next step for someone highly technically savvy who enjoys thinking beyond the obvious, to troubleshoot day-to-day problems. You’ll find it’s a refreshingly international role. Part of a supportive six-strong team within a wider department, you’ll be working (virtually) with colleagues in Houston, Bangalore and Rijswijk and interfacing with project teams and developer teams around the world. </p>\n\n<p>We invest heavily in technology at Shell – it fuels our progress – so you can look forward to stretching your skills on major projects (with increasing work in the cloud) across a diverse landscape, including Windows, Linux, Oracle and SQL. Life moves fast at Shell but provided you can juggle projects, adhere to service level agreements and keep internal customers happy, you’ll find huge scope to develop here and room to progress your career in any number of directions.</p>\n\n<p><b>Country of Work Location</b><br>\nNetherlands</p>\n\n<p><b>City, State (if applicable)</b><br>\nRijswijk</p>\n\n<p><b>Work Location</b><br>\nRijswijk - Kessler Park</p>\n\n<p><b>Company Description</b><br>\nShell Nederland BV is a platform for international collaboration, with Shell offering direct employment to around ten thousand people in the Netherlands alone, including roughly 2,800 non-Dutch employees from around 80 countries. Diversity is key at Shell Nederland, and our employees reflect the innovation that stems from a diverse workforce. By joining Shell Nederland, you will benefit from an unrivalled industry-leading development programme that will see you tap into a pool of expert knowledge that will help propel your career. Shell Nederland is the holding company of most Shell companies operating in the Netherlands. Shell Nederland also has an advisory and coordinating role in numerous areas.</p>\n\n<p><b>Requirements</b></p>\n\n<p><b>What we need from you</b><br>\nWe’re keen to hear from men and women who’ve shown they have strong analytical and troubleshooting skills, covering a variety of platforms. We’re looking for experienced professionals with:</p>\n\n<ul>\n<li>A Bachelor’s degree, preferably IT-related.<br>\n</li>\n<li>Accomplished IT Infrastructure skills especially Oracle (on Linux) and/or SQL Server (on Windows).<br>\n</li>\n<li>Experience with databases and automation.<br>\n</li>\n<li>Ideally experience with GIS applications, scripting (Python or PowerShell) and / or working in a virtual environment. If not, we’ll soon bring you up to speed.<p></p>\n</li>\n</ul><p>Personally, you’ll need to enjoy the customer-facing side of the job. Your colleagues would recognise you as someone who’s proactive and takes pride in seeing a job through. You’ll need to be able to solve complex problems working with diverse teams, often in different locations – so flexibility and good English are essential.</p>\n\n<p><b>Our values </b><br>\nShell is a company with shared values. Honesty, integrity, and respect aren't simply a strapline: they are a part of everything we do. What's more, Shell is an equal opportunities company, and we place the highest possible value on the diversity of our people and our inclusive approach. Join us and you’ll belong to a world where you can feel pride in your achievements and propel your career with global opportunities</p>\n\n<p><b>Women’s perspective</b><br>\nWe care deeply about fostering a truly diverse workplace. We believe in doing everything we can to make Shell as flexible, appealing and supportive a place for women to work as possible. And we've retained our title as a top employer for women in the Times again in 2017.</p>\n\n<p>We help with things like our formal (and informal) flexible working. Like our global and transparent pay policies backed by a leadership team fully supportive of our diversity ambitions. And we'll help foster your career through our Women's Career Development programme and our extensive Women's Network.</p>\n\n<p><b>People with an impairment</b><br>\nAt Shell, we're all about top talent. End of story. We want to encourage those of you who may face an impairment to regard Shell as a place where you'll be fully supported to grow and develop your career. It's as simple as that.</p>\n\n<p>If you'd like to apply, just let us know about your circumstances. We can support you throughout the process. From application, to interview, to your first day of a rewarding career with us.</p>\n\n<p><b>No. of Positions</b><br>\n1</p>\n\n<p><b>Apply</b><br>\nYou can apply via this <b><a href=\"https://shellinternational.redirect.your-jobresponse.com/application_engineer_the_hague/232511/V819/apply\">link</a></b></p>\n\n<p><b>Disclaimer</b><br>\nPlease note: We occasionally amend or withdraw Shell jobs and reserve the right to do so at any time, including prior to the advertised closing date.</p>\n\n<p>Before applying, you are advised to read our data protection policy. This policy describes the processing that may be associated with your personal data and informs you that your personal data may be transferred to Royal Dutch/Shell Group companies around the world.</p>\n\n<p>The Shell Group and its approved recruitment consultants will never ask you for a fee to process or consider your application for a career with Shell. Anyone who demands such a fee is not an authorised Shell representative and you are strongly advised to refuse any such demand.</p>\n\n<p>Shell is an Equal Opportunity Employer.</p>\n\n<p><b>Job Expires</b><br>\n16-Nov-2018</p>",
    "how_to_apply": "<p>You can apply via this <b><a href=\"https://shellinternational.redirect.your-jobresponse.com/application_engineer_the_hague/232511/V819/apply\">link</a></b></p>",
    "company": "Shell",
    "company_url": "https://shellinternational.redirect.your-jobresponse.com/a/232511/V819/apply",
    "company_logo": "http://github-jobs.s3.amazonaws.com/afc5efdc-d2b5-11e8-9024-be315def119f.jpg",
    "url": "http://jobs.github.com/positions/b8e93ea2-d2b5-11e8-86e1-0fc70e8db824"
  },
  {
    "id": "b1ae636c-d245-11e8-8561-d13cf21f1050",
    "created_at": "Wed Oct 17 19:49:51 UTC 2018",
    "title": "JavaScript Engineer",
    "location": "TORONTO",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><strong>RBC Ventures</strong></p>\n\n<p>Ampli is building a new national loyalty rewards platform with WestJet and other partners.  We need your help to build and scale this to millions of happy customers.</p>\n\n<p>As an RBC Venture, we're operating much like any other startup. This isn't the traditional bank. We keep process light, choose the right tools to solve problems, use modern practices such as automated testing, pair programming and peer review, iterative development, continuous integration, and frequent delivery.</p>\n\n<p>You'll have the opportunity to work with and learn from seasoned engineers who can provide mentorship. You'll contribute to all layers of our stack while having freedom to pursue expertise in tech that's interesting to you.</p>\n\n<p><strong>What We Are Looking For…</strong></p>\n\n<p>RBC Ventures is seeking a talented and passionate Sr. JavaScript Engineer to join our team. We want vocal futurists that can advocate their vision, who will be excited about creative problem-solving as part of a cross-functional team; will obsess over writing smart, simple clean code; will tirelessly strive for the best end-user experience and will have the drive and desire to keep learning the latest development techniques.</p>\n\n<p>We're building a fully distributed microservices architecture using React, React Native, Node.js, and AWS.</p>\n\n<p><strong>What you will do?</strong></p>\n\n<ul>\n<li><p>Help build a strong team of skilled Javascript developers creating new digital products for consumers</p></li>\n<li><p>Look outside for opportunities to disrupt from within and continually expand what is possible through technology</p></li>\n<li><p>Work within a cross functional team aimed at delivering high valued solutions</p></li>\n<li><p>Work with modern JavaScript frameworks (React, ReactNative) and Node.js</p></li>\n<li><p>Code, test and implement full stack solutions to meet business needs</p></li>\n<li><p>Create intuitive, robust and reusable user interfaces using modern frameworks</p></li>\n<li><p>Maintain code quality and best practices across the front-end team </p></li>\n</ul><p><strong>About You…</strong></p>\n\n<ul>\n<li><p>You think digital first and believe all customer experiences should be simple and effective</p></li>\n<li><p>A creative problem solver that can develop a plan, take ownership of tasks, and are outcome focused</p></li>\n<li><p>A team player, technical mentor, keen to coach others and share ideas with your team</p></li>\n<li><p>An exceptional communicator able to articulate technical issues in plain language</p></li>\n<li><p>You keep up to date on web and mobile development trends and understanding how it applies to our customers needs</p></li>\n<li><p>You understand web and application security</p></li>\n</ul><p><strong>What do you need to succeed?</strong></p>\n\n<p><strong>Must Haves:</strong></p>\n\n<ul>\n<li>You enjoy working as part of an agile team</li>\n<li>You've built and maintained something that made it out to production</li>\n<li>Desire to learn about all aspects of the software stack including mobile, web, database, - architecture, and cloud computing</li>\n<li>You write tests for your code</li>\n<li>You have opinions but are open-minded enough to change them as you learn</li>\n<li>You enjoy mentoring and otherwise helping your teammates grow in their knowledge and experience</li>\n<li>Experience with source control (e.g. Git,+ Github) and modern software delivery techniques and tools</li>\n</ul><p><strong>Nice To Haves</strong></p>\n\n<ul>\n<li>Post-secondary degree or diploma in a computer or design related program</li>\n<li>2+ years with experience in the development of the Front-End React and React Native applications\nwaterfall is your mortal enemy</li>\n<li>you know Javascript really well</li>\n<li>you know how the cloud works and you have experience with deployment automation</li>\n<li>you understand relational databases</li>\n<li>you have React and/or React Native experience</li>\n</ul><p><strong>What’s in it for you?</strong></p>\n\n<p>We thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.</p>\n\n<ul>\n<li><p>A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable</p></li>\n<li><p>Leaders who support your development through coaching and managing opportunities</p></li>\n<li><p>Ability to make a difference and lasting impact</p></li>\n<li><p>Work in a dynamic, collaborative, progressive, and high-performing team</p></li>\n<li><p>A world-class training program in financial services</p></li>\n</ul><p>SFDG <strong>RBCVentures</strong></p>\n\n<p><strong>techops VenturesTO</strong></p>\n\n<p><strong>About RBC</strong></p>\n\n<p>Royal Bank of Canada is Canada’s largest bank, and one of the largest banks in the world, based on market capitalization. We are one of North America’s leading diversified financial services companies, and provide personal and commercial banking, wealth management, insurance, investor services and capital markets products and services on a global basis. We have over 80,000 full- and part-time employees who serve more than 16 million personal, business, public sector and institutional clients through offices in Canada, the U.S. and 37 other countries. For more information, please visit (<a href=\"http://rbc.com\">http://rbc.com</a>).</p>\n\n<p><strong>Inclusion and Equal Opportunity Employment</strong></p>\n\n<p>RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request.</p>\n\n<p><strong>JOB SUMMARY</strong>\nCity:  Toronto\nAddress:  20 Bay street\nWork Hours/Week:  37.5\nWork Environment:  Office\nEmployment Type:  Permanent\nCareer Level:  Experienced Hire/Professional\nPay Type:  Salaried\nPosition Level:  PL07 \nRequired Travel(%):  0-25\nExempt/Non-Exempt:  N/A\nPeople Manager:  No\nApplication Deadline:  12/31/2018\nReq ID:  175083</p>\n\n<p><em>Ad Code(s):  RBC Ventures</em></p>",
    "how_to_apply": "<p><a href=\"https://ad.doubleclick.net/ddm/clk/426724670;228364266;m?https://jobs.rbc.com/ca/en/job/175083?locale=en_US?utm_campaign=rbc_rbc&amp;20ventures&amp;utm_source=GitHub\">https://ad.doubleclick.net/ddm/clk/426724670;228364266;m?https://jobs.rbc.com/ca/en/job/175083?locale=en_US?utm_campaign=rbc_rbc&amp;20ventures&amp;utm_source=GitHub</a></p>",
    "company": "RBC Venture Technology",
    "company_url": "https://jobs.rbc.com/ca/en/ventures",
    "company_logo": "http://github-jobs.s3.amazonaws.com/6a63c2cc-d245-11e8-9f41-f1c0d188dda1.png",
    "url": "http://jobs.github.com/positions/b1ae636c-d245-11e8-8561-d13cf21f1050"
  },
  {
    "id": "41cc4c36-d244-11e8-89d5-248e73ed1211",
    "created_at": "Wed Oct 17 19:39:28 UTC 2018",
    "title": "Full Stack Engineer",
    "location": "TORONTO",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><strong>RBCVentures Technology</strong></p>\n\n<p>RBC is changing how people think about and interact with the bank on a daily basis. We want to be more than just transactional and episodic, and are finding new and innovative ways to be an essential part of everyone’s daily life. At RBC Ventures we think and act like startups - exploring new ideas that are often completely unrelated to traditional banking products.</p>\n\n<p><strong>What We Are Looking For…</strong></p>\n\n<p>RBCVentures is seeking a talented and passionate Full Stack Engineer to join our team. We want vocal futurists that can advocate their vision, who will be excited about creative problem-solving as part of a cross-functional team; will obsess over writing smart, simple clean code; will tirelessly strive for the best end-user experience and will have the drive and desire to keep learning the latest development techniques.</p>\n\n<p><strong>What you will do?</strong></p>\n\n<ul>\n<li><p>Look outside for opportunities to disrupt from within and continually expand what is possible through technology</p></li>\n<li><p>Work within a cross functional team aimed at delivering high valued solutions</p></li>\n<li><p>Work with modern JavaScript frameworks: React, ReactNative and Node.js</p></li>\n<li><p>Code, test and implement full stack solutions to meet business needs</p></li>\n<li><p>Create intuitive, robust and reusable user interfaces using modern frameworks</p></li>\n<li><p>Maintain code quality and best practices across the front-end team </p></li>\n</ul><p><strong>About You…</strong></p>\n\n<ul>\n<li><p>You think digital first and believe all customer experiences should be simple and effective</p></li>\n<li><p>A creative problem solver that can develop a plan, take ownership of tasks, and are outcome focused</p></li>\n<li><p>A team player, technical mentor, keen to coach others and share ideas with your team</p></li>\n<li><p>An exceptional communicator able to articulate technical issues in plain language</p></li>\n<li><p>You keep up to date on web and mobile development trends and understanding how it applies to our customers needs</p></li>\n<li><p>You understand web and application security</p></li>\n</ul><p><strong>What do you need to succeed?</strong></p>\n\n<p><strong>Must Haves:</strong></p>\n\n<ul>\n<li>4+ years of JavaScript experience building web applications, HTML/CSS experience, including concepts like layout, specificity, cross browser compatibility, and accessibility</li>\n<li>2+ years with experience in the development of the Front-End React and React Native applications</li>\n<li>4+ years experience with browser APIs and optimizing front end performance with backend development in Node.js building API / Microservices.</li>\n<li>Strong understanding of responsive/mobile-first design, web standards, UI/UX best practices, microservices, client-side templating (e.g. Mustache, Handlebars, Jade)</li>\n<li>Experience with source control (e.g. Git, SVN) and working with data-handling using AJAX, JSON, and REST API</li>\n<li>Github account with a Portfolio for demonstration and review</li>\n</ul><p><strong>Nice To Haves</strong></p>\n\n<ul>\n<li>Experience with other JavaScript technologies including Angular</li>\n<li>Experience building and deploying solutions to cloud infrastructure including AWS</li>\n<li>Experience at a Financial Institution and product/process knowledge</li>\n<li>Familiarity with design thinking and customer centric design</li>\n<li>Experience working with startup companies and working in an agile environment</li>\n</ul><p><strong>What’s in it for you?</strong></p>\n\n<p>We thrive on the challenge to be our best, progressive thinking to keep growing, and working together to deliver trusted advice to help our clients thrive and communities prosper. We care about each other, reaching our potential, making a difference to our communities, and achieving success that is mutual.</p>\n\n<ul>\n<li><p>A comprehensive Total Rewards Program including bonuses and flexible benefits, competitive compensation, commissions, and stock where applicable</p></li>\n<li><p>Leaders who support your development through coaching and managing opportunities</p></li>\n<li><p>Ability to make a difference and lasting impact</p></li>\n<li><p>Work in a dynamic, collaborative, progressive, and high-performing team</p></li>\n<li><p>A world-class training program in financial services</p></li>\n</ul><p>SFDG <strong>RBCVentures VenturesTO</strong></p>\n\n<p><strong>techops</strong></p>\n\n<p>Learn more about RBC Tech Jobs</p>\n\n<p><strong>About RBC</strong></p>\n\n<p>Royal Bank of Canada is Canada’s largest bank, and one of the largest banks in the world, based on market capitalization. We are one of North America’s leading diversified financial services companies, and provide personal and commercial banking, wealth management, insurance, investor services and capital markets products and services on a global basis. We have over 80,000 full- and part-time employees who serve more than 16 million personal, business, public sector and institutional clients through offices in Canada, the U.S. and 37 other countries. For more information, please visit (<a href=\"http://rbc.com\">http://rbc.com</a>)</p>\n\n<p><strong>Join our Talent Community</strong></p>\n\n<p>Stay in-the-know about great career opportunities at RBC. Sign up and get customized info on our latest jobs, career tips and Recruitment events that matter to you.</p>\n\n<p>Expand your limits and create a new future together at RBC. Find out how we use our passion and drive to enhance the well-being of our clients and communities at rbc.com/careers.</p>\n\n<p><strong>Inclusion and Equal Opportunity Employment</strong></p>\n\n<p>RBC is an equal opportunity employer committed to diversity and inclusion. We are pleased to consider all qualified applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, protected veterans status, Aboriginal/Native American status or any other legally-protected factors. Disability-related accommodations during the application process are available upon request.</p>\n\n<p><strong>JOB SUMMARY</strong>\nCity:  Toronto\nAddress:  20 Bay street\nWork Hours/Week:  37.5\nWork Environment:  Office\nEmployment Type:  Permanent\nCareer Level:  Experienced Hire/Professional\nPay Type:  Salaried\nRequired Travel(%):  0-25\nExempt/Non-Exempt:  N/A\nPeople Manager:  No\nApplication Deadline:  12/24/2018\nReq ID:  175084</p>\n\n<p><em>Ad Code(s):  RBC Ventures</em></p>",
    "how_to_apply": "<p><a href=\"https://jobs.rbc.com/ca/en/job/175084?locale=en_US?utm_campaign=rbc_rbc&amp;20ventures&amp;utm_source=GitHub\">https://jobs.rbc.com/ca/en/job/175084?locale=en_US?utm_campaign=rbc_rbc&amp;20ventures&amp;utm_source=GitHub</a></p>",
    "company": "RBC Venture Technology",
    "company_url": "https://jobs.rbc.com/ca/en/ventures",
    "company_logo": "http://github-jobs.s3.amazonaws.com/d474bc0e-d243-11e8-8e8d-11fe7c4d86eb.png",
    "url": "http://jobs.github.com/positions/41cc4c36-d244-11e8-89d5-248e73ed1211"
  },
  {
    "id": "e5a6f5d0-d21d-11e8-9227-8acf3586fa9b",
    "created_at": "Wed Oct 17 18:34:35 UTC 2018",
    "title": "Java (Spring) Subject Matter Expert",
    "location": "Louisville, KY",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>As an Interapt Skills Subject Matter Expert (SME), it is your responsibility to work with a team to create a 12-week immersive curriculum with a focus on Java with Spring and SQL. This process should start from documenting skills required to be a Java developer, include building out interesting and fun projects for students, and writing lesson plans.</p>\n\n<p>Interapt Skills is defined by passionate and dedicated people focused on changing lives through technology education. The best candidate will redefine the SME role across the Interapt Skills Program and make a significant contribution to our efforts to bring high-income employment opportunities to overlooked and underserved populations.</p>\n\n<p>An Interapt Skills Subject Matter Expert reports to the Director of Curriculum and is responsible for understanding industry standards and trends as well as Interapt Skills curriculum, philosophy, and structure.</p>\n\n<p>Primary Responsibilities</p>\n\n<ul>\n<li>Work with a Lead Curriculum Engineer to develop a Java (Spring)/SQL curriculum</li>\n<li>Conduct industry research in study track field to ensure the curriculum is current with the industry and ahead of trends.</li>\n<li>Outline skills necessary for a junior developer to be successful in Java/Spring/SQL. </li>\n<li>Review curriculum to ensure job skills are taught.</li>\n</ul><p>Minimum Requirements</p>\n\n<ul>\n<li>Minimum 3 years professional experience in Java SE, Spring, and SQL. </li>\n<li>Minimum 1 year management experience</li>\n<li>Capacity to clearly and simply explain technical concepts.</li>\n<li>Experience in pedagogy, tutoring, and/or teaching.</li>\n<li>Creative, passionate, and driven by a growth-oriented mindset.</li>\n<li>Experience working with Google for Work suite.</li>\n<li>Strong verbal and written communication skills.</li>\n</ul><p>Preferred Experience</p>\n\n<ul>\n<li>5 or more years of work experience in Java SE and/or Java EE</li>\n<li>Experience writing curriculum, including lesson plans and projects.</li>\n<li>Experience teaching technical curricula.</li>\n</ul>",
    "how_to_apply": "<p>Email your resume to <a href=\"mailto:Crystal.Adkins@interapt.com\">Crystal.Adkins@interapt.com</a></p>",
    "company": "Interapt",
    "company_url": "https://www.interapt.com/",
    "company_logo": "http://github-jobs.s3.amazonaws.com/1fe2ede0-d23b-11e8-83ed-fff844e6b5f0.jpg",
    "url": "http://jobs.github.com/positions/e5a6f5d0-d21d-11e8-9227-8acf3586fa9b"
  },
  {
    "id": "aca15286-d230-11e8-8165-ce878343dca2",
    "created_at": "Wed Oct 17 17:18:57 UTC 2018",
    "title": "Senior Software Engineer - Full Stack",
    "location": "Raleigh, NC",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<h1>LifeIsSweet at SugarCRM</h1>\n\n<p>The people. The passion. The success. You will frequently see Sugas huddled around a desk or whiteboard collaborating, cranking out ideas, or solving the latest industry problem. Are you ready to play a key role in influencing how companies create extraordinary relationships with their customers? We’d love to hear your ideas! We’re going places… join us for the ride, experience sweet success and show us your passion. </p>\n\n<p>Where do you fit?</p>\n\n<p>The Relationship Intelligence team is at the forefront of combining technology, data, and advanced analytics to enthrall our customers.  You will be responsible for building out a new product line that is chartered with finding and delivering actionable insights to allow our customers to execute seamlessly in how they run and operate their business.  </p>\n\n<p>We are looking for an enthusiastic, performance-driven self-starter and a team player. You must have stellar software development, project organization, and communication skills, and work well in cross-functional teams. We are looking for an exceptional full stack engineer with a background in nodeJS and front-end technologies such as Backbone, React, Angular2, and jQuery.</p>\n\n<p>Impact you will make in the role:</p>\n\n<p>The opportunity to work on a new product line under the umbrella of an already solid and mature CRM leader\nWork with Product Management to help define the roadmap and set the strategic direction of the product\nPush the envelope of software design and architecture\nExtend and optimize current software architecture\nChallenge, mentor, and learn from your peers</p>\n\n<p>What you need to succeed:</p>\n\n<p>5+ years in software development\nExperience with Node.js API/backend development in a cloud-based, scalable, fault tolerant architecture\nExperience with client-side technologies (HTML5, CSS3) and JavaScript frameworks such as Backbone.js, React, and Angular 2 (and above)\nSolid Computer Science fundamentals: data structures, algorithms, design patterns, databases, operating systems, and debugging\nPassionate about AI and Machine Learning and stays up-to-date with the latest developments in the field\nFamiliarity with REST APIs\nFamiliarity with Micro-service architecture\nFamiliarity with source control such as Git/Bitbucket\nFamiliarity with AI and Machine Learning\nExposure to container technologies: Kubernetes, Docker, and AWS\nExposure to DevOps and CI/CD configuration management\nBS degree in Computer Science, or equivalent\nLocation: Cupertino, CA or Raleigh NC</p>\n\n<p>We are an Equal Opportunity, Affirmative Action employer. Minorities, women, veterans and individuals with disabilities are encouraged to apply.</p>\n\n<p>Benefits and Perks:</p>\n\n<p>Beyond a stellar work environment, friendly people, and inspiring, innovative work, we have some great benefits and perks:\nCompetitive salaries\nExcellent medical, dental and vision coverage for you and your family, along with other benefit plans like 401(k) match\nGenerous Paid Time Off Policy\nWellness Reimbursement and Workforce Fitness Program\nCareer &amp; Personal Development Program – multi-platform\nNew Hire Onboarding for all new employees worldwide – at Corporate Headquarters in Cupertino, California\nRegular social events and birthday celebrations (yes, sweet treats are a big deal at SugarCRM)\nOwnership is the greatest self-identity at SugarCRM - you are making an impact now\nWe are a merit-based company - many opportunities to learn, excel and grow your career\nLearn more on LinkedIn and Twitter @LifeAtSugar</p>",
    "how_to_apply": "<p><a href=\"https://app.jobvite.com/j?cj=o97d8fwl&amp;s=Github_JobPost\">https://app.jobvite.com/j?cj=o97d8fwl&amp;s=Github_JobPost</a></p>",
    "company": "SugarCRM",
    "company_url": "http://www.sugarcrm.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/9f1fe230-d230-11e8-90e4-50c8f07968b9.png",
    "url": "http://jobs.github.com/positions/aca15286-d230-11e8-8165-ce878343dca2"
  },
  {
    "id": "6fb10854-d225-11e8-9c64-0d6e4612d01d",
    "created_at": "Wed Oct 17 15:58:06 UTC 2018",
    "title": "Senior Software Engineer, Apple Pay",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>At Apple, new ideas have a way of becoming phenomenal products, services, and customer experiences very quickly. Imagine what you could do here. Bring passion and dedication to your job and there’s no telling what you could accomplish.</p>\n\n<p>The Apple Pay Server team is a rare engineering group within Apple. We provide critical services for the company across every product line. From manufacturing to customer facing, our services span across the entire lifecycle of most Apple hardware. By designing and implementing services that are tightly coupled with hardware, we support the ongoing need to improve security of customer’s sensitive data (financial or otherwise) and privacy. Many of our services are seen in the iOS Security Guide and are publicly discussed on Internet forums.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>8+ years experience in server software programming using Java</li>\n<li>Experienced in designing &amp; developing highly scalable applications, RESTful web services</li>\n<li>Detailed knowledge of relational and non-relational databases</li>\n<li>Expertise in test-driven development</li>\n<li>Proven track record of successful product delivery</li>\n<li>Exceptional analytical and problem solving skills across large ecosystems</li>\n<li>Demonstrated ability to think criticality and quickly learn new technologies</li>\n<li>Strong communication, collaboration &amp; interpersonal skills</li>\n<li>iOS and macOS familiarity preferred</li>\n<li>Experience in payment industry is a plus</li>\n<li>Expertise in identity management is a huge plus</li>\n<li>Experience/understanding of security &amp; cryptography is a plus</li>\n</ul><p>Description:\nImagine the freedom of a startup with the funding and laser focus of the most valuable company in the world. As a senior software engineer on the Apple Pay Server team:</p>\n\n<ul>\n<li>You will participate in initiatives that are essential to the success of upcoming product launches and product security initiatives.</li>\n<li>You will get the opportunity to lead a small group of engineers working on product features.</li>\n<li>You will develop the next generation of cloud support that powers Apple Pay.</li>\n<li>You will be responsible for designing and developing large scale platforms that can support future Apple Pay functionality.</li>\n<li>You will have the opportunity to explore and contribute to a wide range of technologies.</li>\n<li>You will work collaboratively with Apple’s iOS Engineering team, NFC team, security team, and external partners to define the next hot feature of Apple Pay.</li>\n</ul><p>Education:\nBS or MS in Computer Science/Engineering or equivalent practical experience</p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants.</p>\n\n<p>REQUISITION NUMBER: 114307974\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=e3872d14963801661cbcf1ba8fb9a916\">https://ars2.equest.com/?response_id=e3872d14963801661cbcf1ba8fb9a916</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/49501b1e-d225-11e8-8a3a-44abd2a8a19e.jpeg",
    "url": "http://jobs.github.com/positions/6fb10854-d225-11e8-9c64-0d6e4612d01d"
  },
  {
    "id": "5cb8f572-d225-11e8-8186-1f14f038aee5",
    "created_at": "Wed Oct 17 15:57:34 UTC 2018",
    "title": "Data Integrity Business Analyst",
    "location": "Cupertino, CA",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>DESCRIPTION: Changing the world is all in a day's work at Apple. If you love innovation, here's your chance to make a career of it. You'll work hard. But the job comes with more than a few perks.</p>\n\n<p>At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. If you are a self-motivated, high-energy individual who is not afraid of challenges, we’re looking for you. Apple is seeking a tried Data Integrity Business Analyst to join the Apple Media Products Analytics and Data Products team. The Data Integrity Business Analyst plays a meaningful role in defining data integrity framework, enabling process to measure and monitor data integrity, tracking data integrity issues to resolution.</p>\n\n<p>Key Qualifications:  </p>\n\n<ul>\n<li>8+ years of industry experience passionate about improving quality of the data in big data environment.</li>\n<li>Experienced in coordinating multi-functional activities between QA, Engineering, Business, Legal etc.</li>\n<li>Experienced in data integrity issue management - define &amp; monitor KPIs, recommend changes to improve data integrity, reduce cost from issues.</li>\n<li>Experienced in data quality issue tracking and resolution activities end to end (impact analysis, root cause analysis, data analysis etc.).</li>\n<li>Reciprocal; able to build consensus and drive valuable meetings among multi-functional teams while also meaningful assumptions in a relevant way.</li>\n<li>You have proven analytical and logic abilities.</li>\n<li>Strategic thinker with the ability to see the big picture while working with ambiguity and uncertainty.</li>\n<li>Validated ability to capture and analyze large amounts of data at a macro and micro level.</li>\n<li>Consistent focus on training and improving existing processes.</li>\n<li>Experience in working with ETL applications, data pipelines, and Big Data.</li>\n<li>Excellent oral and written communication and presentation skills.</li>\n</ul><p>Description:<br>\nData Integrity Framework</p>\n\n<p>Data Integrity Business Analyst will assist the data integrity program manager in the development and execution of a comprehensive data integrity framework.\nDefine process for monitoring, measuring, and reporting compliance with acceptable levels of data quality (completeness, validity, consistency, timeliness, and accuracy).\nCreate new KPIs and measures as well as designing interactive dashboards for technology implementations that helps the business understand state of quality and impact to the business.\nRequirements Gathering &amp; Data Integrity Solution Implementation</p>\n\n<p>Define a template to gather data quality requirements, oversee the definition of data quality requirements based on known business requirements, data quality issues, data quality resolution plan, and technology.\nCollaborate with Engineering to implement the solution (prevention, detection, monitoring and alerting) specific to data quality requirements.\nConduct end to end data and requirements analysis in order to understand the transformational and data processing lifecycles as the data migrates throughout the enterprise architecture. Candidate should be able to analyze data and identify any functional gaps based on data quality exceptions generated through Data quality tool/ solutions.\nIssue Management Data Integrity Exceptions</p>\n\n<p>Responsibilities include the Data Quality Issue Management, supporting all efforts and endeavors related to providing visibility about data issues and tracking the remediation efforts.\nThe issue management includes creating, supporting and evolving reports that has KPIs and measurements about the overall status and health of the data.\nDevelop data quality scorecard, issue dashboard.\nClassify root causes, conduct and organize sessions with SMEs to discuss or brainstorm the process gaps, solution gaps and present recommendations to permanently solve the problem.\nFocus and support all aspects of data quality issue management and improvement, exception handling and alerting process.\nTraining and Documentation</p>\n\n<p>Work with data integrity manager to promote data integrity best practices, create data integrity training, root cause analysis training and create templates and validations for data owners to use.\nCreate documentation, perform knowledge transfer and cross training for partners to develop new data quality rules as well as help data stewards tasked with remediating data quality issues.\nProduce and distribute daily/weekly team status reports or scorecards as well as give to project status reporting depending on the undertaking at and assist with any management reporting.\nAdditional Requirements</p>\n\n<p>NICE TO HAVE</p>\n\n<p>Six Sigma Certification</p>\n\n<p>Knowledge of building dashboards using Tableau, Qlikview or similar tools</p>\n\n<p>Knowledge of spark, scala, HDFS, Hive</p>\n\n<p>Knowledge of Data Integration tools, SQL, Talend, BI tools.\n </p>\n\n<p>Education:\nBachelor's degree or equivalent work experience in Engineering, Computer Science, Business Information Systems. </p>\n\n<p>Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. </p>\n\n<p>REQUISITION NUMBER: 114290203\nCOMPANY NAME: Apple Inc.</p>",
    "how_to_apply": "<p>APPLY URL: <a href=\"https://ars2.equest.com/?response_id=86f1d9fbedc832e6001ec9029428ca2f\">https://ars2.equest.com/?response_id=86f1d9fbedc832e6001ec9029428ca2f</a></p>",
    "company": "Apple Inc.",
    "company_url": "http://www.apple.com",
    "company_logo": "http://github-jobs.s3.amazonaws.com/4b6fd60a-d225-11e8-97e4-c75686fa40c1.jpeg",
    "url": "http://jobs.github.com/positions/5cb8f572-d225-11e8-8186-1f14f038aee5"
  },
  {
    "id": "6bb946ac-d221-11e8-901c-23e3aa880c59",
    "created_at": "Wed Oct 17 15:29:21 UTC 2018",
    "title": "Java Backend Engineer",
    "location": "Berlin, Germany",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><strong>Company Description</strong></p>\n\n<p>TECH @ reBuy reCommerce GmbH</p>\n\n<p>We are looking for the best people to be part of our adventure and create\nan enjoyable, focused and challenging environment which results in great\nculture, we live and enjoy everyday. Our small teams work closely together\nand can solve even the toughest business problems and find the best\npossible solution for our customers.\nAt reBuy TECH we believe that user experience depends on the software we\ndesign, which is why the code needs to excel. The whole architecture should\nbe fun to use, fast, rock solid and simply state of the art. Of course we\nalso know good code can only be created by great and happy people. In order\nto be good, you need to feel comfortable at work. We push hard to make work\nequal fun and challenging so you reach new heights.</p>\n\n<p><strong>Job Description</strong></p>\n\n<p>Join our Java backend team that focuses on supporting our sales and\noperations team and create a fully automated sales transaction process as\nwell as a new pricing solution for our marketplaces. While our system was\ndesigned to handle business through our own website and for B2C business,\nB2B transactions are getting more and more important to fulfill our\ncustomers needs. Apply now and make it happen!</p>\n\n<ul>\n<li>You and your team design and develop quality, proficient technical\nsolutions that satisfy business requirements and meet architectural\nstandards</li>\n<li>Ensure compliance with coding standards by regular code reviews and pair\nprogramming</li>\n<li>You review and constantly challenge that architecture and make\nsuggestions for improvements as requirements emerge</li>\n<li>Together with your team, you’ll develop and maintain REST based\nwebservices in a service-oriented architecture</li>\n<li>We follow the rule “use the right tool for the job” - over the years,\nthis mindset has created a great diversity of skills and we would love to\nkeep it that way</li>\n<li>We know our standards are hard to reach but we try our best to stay\nhungry and foolish for more. We hope you feel the same way and join us on\nthis challenging journey!</li>\n</ul><p><strong>Qualifications</strong></p>\n\n<ul>\n<li>Extensive knowledge in Java (8) and proven experience in defining,\ndeveloping and maintaining REST based interfaces</li>\n<li>Ideally, you gained first experience in Spring Boot, Spring Integration\nor Hibernate</li>\n<li>You have not just a deep understanding but also the ability to work with\ndatabases such as MySQL/ PostgreSQL</li>\n<li>Be part of a team you always wanted to work with and share your knowledge\nto help others to grow</li>\n<li>Working in an agile environment makes you happy</li>\n<li>You are results-driven with analytical skills and the ability to spark\nand simplify current processes and practices</li>\n<li>You love pragmatic solutions and have the personal drive and enthusiasm\nthat makes you stand out from the crowd</li>\n</ul><p><strong>Additional information</strong></p>\n\n<p>We are offering a unique job in an innovation-friendly company within an\ninspiring and flourishing environment. We always want you to be productive\nin your way. Before you join you can choose your state of the art hardware:\nAlthough our eco system is built around linux/mac, we don't care whether\nyou run Mac, Linux or Windows. Our atmosphere is open-minded: Something you\nwant to change or something to introduce? Let’s talk about it! The projects\nhave a broad scope for codecision-making. Our goals are ambitious and they\nwill lead us to exciting paths. So pick your favorite career, apply with a\npleasing CV and we will get back to you as quick as possible! For\ninternationals we provide relocation assistance.</p>\n\n<p>Get to know the reBuy TECH team, our Tryday and our projects on: <strong><a href=\"https://tech.rebuy.com/\">TECH @\nreBuy</a></strong></p>",
    "how_to_apply": "<p><a href=\"http://smrtr.io/HG6Q\">Apply here</a></p>",
    "company": "reBuy reCommerce GmbH",
    "company_url": "http://rebuy.de",
    "company_logo": "http://github-jobs.s3.amazonaws.com/66d45406-d221-11e8-93ca-f49d11874a94.jpg",
    "url": "http://jobs.github.com/positions/6bb946ac-d221-11e8-901c-23e3aa880c59"
  },
  {
    "id": "ad366204-d217-11e8-99db-09a4accdda69",
    "created_at": "Wed Oct 17 14:20:52 UTC 2018",
    "title": "Jr developer",
    "location": "Remote",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p>We created Sticker Mule to be the best place to work and shop. That means making ordering fast, simple and fun while creating a stable, low stress and enjoyable place for talented people to work.<br></p>\n\n<p>We're searching for more to join us as we look to build one of the Internet's best technical teams. Some of our current projects include migrating to a service architecture, inter-service communication with GCloud PubSub and GRPC, API Gateway based GraphQL, event sourcing persistence and CQRS, and manufacturing and artwork processing automation.<br></p>\n\n<p><a href=\"https://www.stickermule.com/about\">Watch a brief video to learn more</a></p>\n\n<p><strong>Why we enjoy working here</strong><br>\n1. We work flexible hours with an asynchronous culture. <br>\n2. We work at a sustainable pace without unreasonable external deadlines.<br>\n3. Varied, interesting technical challenges to work on.<br>\n4. Opportunities to make a large impact as part of a small, highly motivated team.<br></p>\n\n<p><strong>Our tech stack</strong><br>\n1. Backend: Ruby on Rails, NodeJS, Go<br>\n2. DB: Aurora/Mysql, Postgres, Redis<br>\n3. Frontend:  React, Redux, Webpack<br>\n4. APIS: GraphQL, GRPC, GCloud PubSub<br>\n5. AWS, migrating to Gcloud<br>\n6. Docker, Kubernetes<br></p>\n\n<p><strong>What you will do</strong><br>\n1. Design, build, test, deploy and maintain web applications and services<br>\n2. Work on bug fixes and improvements to customer-facing and admin applications<br>\n3. Write clean, performant code in accordance with our team's code style guidelines<br>\n4. Collaborate with team leads to ensure that we're always building the best possible solution in the optimal way<br></p>\n\n<p><strong>About you</strong><br>\n1. You’re able to show examples of software you have written<br>\n2. You have good understanding of JavaScript, HTML and CSS<br>\n3. Some experience with back-end programming, ideally with NodeJS, would be beneficial<br>\n4. You have strong analytical and critical thinking skills<br>\n5. You have great written and verbal communication skills in English<br></p>\n\n<p><strong>Requirements</strong><br>\n1. Applicants will be sent a Hackerrank test within 1-3 days of applying.<br>\n2. Test must be completed within 5 days.<br></p>\n\n<p><strong>Compensation</strong><br>\n1. $90,000-$115,000+ depending on experience<br>\n2. Signing bonus<br>\n3. 28 days vacation<br></p>",
    "how_to_apply": "<p>Apply here only: <a href=\"https://www.stickermule.com/career/ce28dfcc-6260-4703-9b99-66c69b34493a\">https://www.stickermule.com/career/ce28dfcc-6260-4703-9b99-66c69b34493a</a></p>",
    "company": "Sticker Mule",
    "company_url": "https://www.stickermule.com/careers",
    "company_logo": "http://github-jobs.s3.amazonaws.com/8b772c2a-d217-11e8-9cd0-788f7a643a90.png",
    "url": "http://jobs.github.com/positions/ad366204-d217-11e8-99db-09a4accdda69"
  },
  {
    "id": "792ba4c8-d204-11e8-9677-2f4a23fb09ab",
    "created_at": "Wed Oct 17 12:02:59 UTC 2018",
    "title": "JavaScript Engineer",
    "location": "Berlin (Germany) & Remote",
    "type": "Full Time",
    "jobtype": "Permanent",
    "label": "green",
    "keywords": "DevOps, Cloud, Python",
    "description": "<p><img src=\"https://www.blogfoster.com/assets/images/engineering/bf-loves-js-red.png\" alt=\"Iblogfoster loves JavaScript\"></p>\n\n<h2>The position</h2>\n\n<p>We are looking for a smart, self-motivated software engineer to strengthen our development team. Your preferred programming language is JavaScript and you are passionate about the latest developments in that ecosystem, just as we are.</p>\n\n<p>You’ll help us improve our entire platform, from our single-page web apps to our Node.js backend service.</p>\n\n<p>You are always keen to challenge the current way of how we do things and try to improve it by making technical decisions and introducing standards.</p>\n\n<p>You’ll be working in a small team that tries to operate agile and without much overhead.</p>\n\n<p>Your daily routine includes discussions with your peers to help find the best solutions and a default to action.</p>\n\n<h2>About you</h2>\n\n<ul>\n<li>Do you have experience and love working with JavaScript? Ideally you’ve worked with Node.js, and you’re interested in working with React, Hapi.js or Express.js.</li>\n<li>Do you love writing well-tested and robust code, according to modern JavaScript practices and standards?</li>\n<li>Do you equally care about how building software is done as having it done?</li>\n<li>Do you strive for innovative solutions that pushes the company and your peers instead of accepting the status quo?</li>\n<li>You leave no stone left unturned when you are on the hunt for solutions. New problems occur every single day and sometimes we need to leave our comfort zone to tackle them.</li>\n<li>You’re passionate about sharing your knowledge and experience among the team.</li>\n</ul><p><em>Are you interested?</em> <a href=\"https://www.blogfoster.com/engineering/jobs/javascript-engineer?utm_source=github&amp;utm_campaign=github-october\">Check out our full job description</a> to get information about our engineering culture &amp; values!</p>\n\n<h2>A few of the things you might work on</h2>\n\n<p><strong>React.js single-page applications</strong>: The most important part for our customers. We write all our SPAs in React.js, Redux, and the ecosystem around both. Quality is important, and so we incorporate common standards, for instance Storybook. You might help us extend our component library by creating isolated, reusable, and well-tested React components.</p>\n\n<p><strong>Node.js micro-service APIs</strong>: The APIs are the foundation of everything. We put a lot of effort into the quality, robustness, and scalability of our APIs. Designing new interfaces, creating new endpoints and improving the testability is an integral part.</p>\n\n<p><strong>CI / CD system</strong>: The bread and butter of successful product development. We ship software every day, and we want to make sure it happens with high quality, looking out for test coverage and for always keeping the build green. We apply automated test execution and code quality checks, like ESLint.</p>\n\n<p><strong>With product management</strong>: You can only do an excellent job if you know why we build things from a product perspective. That is why you work with the product management to test features.</p>\n\n<h2>About us</h2>\n\n<p><strong>Full-stack approach</strong>: The engineering team applies a full-stack approach. We encourage every engineer to work on the full range of tasks (infrastructure, backend, frontend) based on their preferences. The team supports each other to have the knowledge and skills for it.</p>\n\n<p><strong>Our engineering blog</strong>: We regularly publish articles about React &amp; Co., Node.js, product development and engineering management. You might find something interesting, and we’d love for you to share your experiences and findings too. You should check it out.</p>\n\n<p><strong>10% time</strong>: Everybody on the team is free to spend 10% of their work time on innovative ideas and technologies which interest them, such as open source and thought leadership.</p>\n\n<p><strong>Remote work</strong>: We are open to people who don’t live in Berlin and don’t want to relocate. The only requirement at the moment is that you live in Europe. This makes the organization and process easier for all of us.</p>\n\n<p><em>Do you need more information?</em> <a href=\"https://www.blogfoster.com/engineering/jobs/javascript-engineer?utm_source=github&amp;utm_campaign=github-october\">Check out our full job description</a> to get information about our engineering culture &amp; values!</p>",
    "how_to_apply": "<p>Please apply via <a href=\"https://blogfoster.workable.com/jobs/471948/candidates/new\">Workable</a></p>",
    "company": "blogfoster",
    "company_url": "https://blogfoster.com",
    "company_logo": null,
    "url": "http://jobs.github.com/positions/792ba4c8-d204-11e8-9677-2f4a23fb09ab"
  }
]
